{"id": "2505.09187v1", "title": "Wavefunction-Free Approach for Predicting Nonlinear Responses in Weyl Semimetals", "link": "http://arxiv.org/abs/2505.09187v1", "summary": "By sidestepping the intractable calculations of many-body wavefunctions,\ndensity functional theory (DFT) has revolutionized the prediction of ground\nstates of materials. However, predicting nonlinear responses--critical for\nnext-generation quantum devices--still relies heavily on explicit\nwavefunctions, limiting computational efficiency. In this letter, using the\ncircular photogalvanic effect (CPGE) in Weyl semimetals as a representative\nexample, we realize a 1000-fold computational speedup by eliminating the\nexplicit dependence on wavefunctions. Our approach leverages the one-to-one\ncorrespondence between free parameters of Weyl fermions and the associated\nresponses to obtain precise wavefunction-free formulations. Applying our\nmethodology, we systematically investigated known Weyl semimetals and revealed\nthat Ta$_3$S$_2$ exhibits photocurrents an order of magnitude greater than\nthose observed in TaAs, with potential for an additional order-of-magnitude\nenhancement under strain. Our work paves the way for substantially more\nefficient screening and optimization of nonlinear electromagnetic properties of\ntopological quantum materials.", "authors": ["Mohammad Yahyavi", "Ilya Belopolski", "Yuanjun Jin", "Md Shafayat Hossain", "Yilin Zhao", "Jinyang Ni", "Naizhou Wang", "Yi-Chun Hung", "Zi-Jia Cheng", "Tyler A. Cochran", "Tay-Rong Chang", "Wei-bo Gao", "Su-Yang Xu", "Jia-Xin Yin", "Qiong Ma", "M. Zahid Hasan", "Arun Bansil", "Naoto Nagaosa", "Guoqing Chang"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T06:32:11Z"}
{"id": "2505.09195v1", "title": "Study of magneto-thermal resistance effect in a Co50Fe50/Cu multilayer through the analysis of electron and lattice thermal conductivities", "link": "http://arxiv.org/abs/2505.09195v1", "summary": "This study investigates the giant magneto-thermal resistance (GMTR) effect in\na fully-bcc epitaxial Co50Fe50/Cu multilayer through both experimental and\ntheoretical approaches. The applied magnetic field results in a giant change of\nthe cross-plane thermal conductivity ({\\Delta}\\k{appa}) of 37 W m-1 K-1, which\nreaches 1.5 times larger than the previously reported value for a magnetic\nmultilayer and record the highest value at room temperature among the other\nsolid-state thermal switching materials working on different principles. We\ninvestigated the electron thermal conductivity for exploring the remarkable\n{\\Delta}\\k{appa} by the two-current-series-resistor model combined with the\nWiedemann-Franz (WF) law. However, the result shows the electron contribution\naccounts for only 35% of the {\\Delta}\\k{appa}, indicating the presence of\nadditional spin-dependent heat carriers. Further investigation of the lattice\nthermal conductivity, which is expected to be spin-independent, using\nnon-equilibrium molecular dynamics (NEMD) simulations suggests a striking\ncontrast: the additional spin-dependent heat carrier contribution is\nsignificantly enhanced in the parallel magnetization configuration but nearly\nnegligible in the antiparallel configuration. These findings provide a\nfundamental insight into the origin of large GMTR effect and highlight its\npotential of active thermal management technologies for future electronic\ndevices.", "authors": ["Fuya Makino", "Takamasa Hirai", "Takuma Shiga", "Hirofumi Suto", "Hiroshi Fujihisa", "Koichi Oyanagi", "Satoru Kobayashi", "Taisuke Sasaki", "Takashi Yagi", "Ken-ichi Uchida", "Yuya Sakuraba"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T07:08:40Z"}
{"id": "2505.09257v1", "title": "Recent progress on electron- and magnon-mediated torques", "link": "http://arxiv.org/abs/2505.09257v1", "summary": "The growing demand for artificial intelligence and complex computing has\nunderscored the urgent need for advanced data storage technologies. Spin-orbit\ntorque (SOT) has emerged as a leading candidate for high-speed, high-density\nmagnetic random-access memory due to its ultrafast switching speed and low\npower consumption. This review systematically explores the generation and\nswitching mechanisms of electron-mediated torques (including both conventional\nSOTs and orbital torques) and magnon-mediated torques. We discuss key materials\nthat enable these effects: heavy metals, topological insulators,\nlow-crystal-symmetry materials, non-collinear antiferromagnets, and\naltermagnets for conventional SOTs; 3d, 4d, and 5d transition metals for\norbital torques; and antiferromagnetic insulator NiO- and multiferroic\nBiFeO3-based sandwich structures for magnon torques. We emphasize that although\nkey components of SOT devices have been demonstrated, numerous promising\nmaterials and critical questions regarding their underlying mechanisms remain\nto be explored. Therefore, this field represents a dynamic and rapidly evolving\nfrontier in spintronics, offering significant potential for advancing\nnext-generation information storage and computational technologies.", "authors": ["Jia-Min Lai", "Bingyue Bian", "Zhonghai Yu", "Kaiwei Guo", "Yajing Zhang", "Pengnan Zhao", "Xiaoqian Zhang", "Chunyang Tang", "Jiasen Cao", "Zhiyong Quan", "Fei Wang", "Xiaohong Xu"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T10:13:12Z"}
{"id": "2505.09389v1", "title": "Imaging domain boundaries of rubrene thin crystallites by photoemission electron microscopy", "link": "http://arxiv.org/abs/2505.09389v1", "summary": "The progress of designing organic semiconductors is extensively dependent on\nthe quality of prepared organic molecular assemblies, since the charge\ntransport mechanism is strongly efficient in highly ordered crystals compared\nto amorphous domains. Here we present a comprehensive photoemission electron\nmicroscopy (PEEM) and time-of-flight (TOF) spectroscopic study of rubrene\n($\\mathrm{C}_{48}\\mathrm{H}_{24}$) thin crystals focusing on recently developed\northorhombic crystalline morphologies applied in organic electronic devices.\nUsing femtosecond pulsed lasers with photon energies between 3-6 eV, we explore\nthe interplay between photoemission processes, crystal morphology, and defect\nstates. In a 2-photon photoemission process (2PPE), the PEEM images reveal\ndominant emission localized at domain boundaries, indicating strong\ncontributions from trap states. In contrast, in 1PPE nm excitation uniform\nemission across the crystal surface is observed, highlighting a fundamental\ndifference in photoemission mechanisms. Furthermore, in the intermediate photon\nenergy range, we identify a nonlinear, non-integer photon order, where mostly\nthe triclinic morphology contributes to the emission, distinguishing it from\nthe orthorhombic phase. These findings provide a new framework for assessing\nthe quality and internal structure of organic semiconductor thin films via\nwavelength-dependent photoemission imaging and spectroscopy.", "authors": ["Moha Naeimi", "Katharina Engster", "Waqas Pervez", "Ingo Barke", "Sylvia Speller"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T13:42:46Z"}
{"id": "2505.09404v1", "title": "The meaning of Li diffusion in cathode materials for the cycling of Li-ion batteries: A case study on LiNi0.33Mn0.33Co0.33O2 thin films", "link": "http://arxiv.org/abs/2505.09404v1", "summary": "We demonstrate that for polycrystalline LiNi0.33Mn0.33Co0.33O2 c-axis\ntextured thin film cathodes of rechargeable lithium-ion batteries, the kinetics\nof Li storage and release including maximum specific capacity is determined by\nLi diffusion. The C-rate capability and long-term cycling behavior were\ninvestigated. The films exhibited up to 30% of the expected practical capacity\neven at low C-rates. However, 100% capacity was achieved at very low cycling\nrates below 0.01C. The capacity showed a reversible behaviour with changing\ncurrent density, indicating no film degradation. The C-rate capability\nexperiment showed a square root dependence of capacities on current density,\nwhich corresponds to a diffusion-controlled process. The estimated\ndiffusivities from the cycling experiments are independent of the current\ndensity. The Li chemical and tracer diffusivities were measured using standard\nelectrochemical and non-electrochemical diffusion measurement techniques.\nChemical diffusivities, thermodynamic factor, and hence Li tracer diffusivities\nwere determined from potentiostatic intermittent titration (PITT) and\nelectrochemical impedance spectroscopy (EIS) experiments as a function of\nelectrode potential and state of charge (SOC). The diffusivities were found to\nbe approximately independent of potential, SOC and cycle number. The Li tracer\ndiffusivities were validated by 6Li tracer diffusion experiments with secondary\nion mass spectrometry (SIMS). The diffusivities obtained by PITT and SIMS were\nfound to be more reliable for Li uptake and release than those obtained by EIS.\nBased on the diffusion results, a C-rate limit for full film delithiation below\n0.01 C was calculated due to slow Li diffusion.", "authors": ["Erwin Hüger", "Harald Schmidt"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T14:01:29Z"}
{"id": "2505.09431v1", "title": "Using Dopants as Agents to Probe Key Electronic Properties of Organic Semiconductors", "link": "http://arxiv.org/abs/2505.09431v1", "summary": "In organic electronics, conductivity doping is used primarily to eliminate\ncharge injection barriers in organic light-emitting diodes, organic\nphotovoltaics and other electronic devices. Therefore, research on conductivity\ndoping is primarily focused on understanding and enhancing the properties of\nthese doped layers. In contrast, this work shifts the focus from optimizing\ndoped layers to leveraging the doping process as a tool for investigating\nfundamental material properties. Specifically, the dopant is used as an \"agent\"\nto enable the measurement of three critical parameters: ionization potential\n(IP), electron affinity (EA), and Coulomb interaction energy (VC) - that govern\ndopant ionization and play central roles in organic electronic devices in\ngeneral. While these parameters can be measured experimentally, conventional\napproaches often involve intricate or indirect methods, such as spectral\ndeconvolution, which may introduce ambiguities or fail to represent bulk\nproperties. Here it is shown how consolidating the experimental data and\nsimulations on the dopant ionization fraction and doped-induced conductivity\ncan be used to estimate the mean IP or EA of the embedded organic molecule, and\nVC of the embedded charge-transfer complex. These results illustrate how\nmeasuring and simulating doped materials can provide access to the fundamental\ndesign parameters of organic electronic devices", "authors": ["Artem Fediai", "Franz Symalla", "Tobias Neumann", "Wolfgang Wenzel"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T14:34:50Z"}
{"id": "2505.09532v1", "title": "Unconventional magnetic glassiness in non-centrosymmetric Sm$_7$Pd$_3$: Interplay of magnetic frustration, long-range order, and frozen domains", "link": "http://arxiv.org/abs/2505.09532v1", "summary": "We present a comprehensive investigation of the intricate spin dynamics in\nthe non-centrosymmetric compound Sm$_7$Pd$_3$, revealing the coexistence of\nspin glass, domain glass, and ferromagnetic (FM) behaviors. Magnetic\nfield-dependent measurements indicate large coercivity, suggesting\nferromagnetic domain formation below the Curie temperature ($T_C \\sim 173$ K),\nwhile temperature-dependent magnetization data point to antiferromagnetic (AFM)\ncoupling, highlighting the competition between FM and AFM interactions.\nDetailed ac susceptibility, isothermal remanent magnetization, and aging effect\nmeasurements demonstrate the presence of two distinct types of glassiness in\nthe sample, and their possible origins are discussed extensively. Magnetization\nmeasurements reveal the mixing of the J = 5/2 ground state of Sm$^{3+}$ with\nthe excited J = 7/2 multiplet, lying 965 K above. The specific heat data show\nfurther crystalline electric field splitting of the J = 5/2 state into a\nground-state doublet and a fourfold-degenerate excited state.", "authors": ["Ajay Kumar", "Anis Biswas", "Yaroslav Mudryk"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T16:28:27Z"}
{"id": "2505.09574v1", "title": "Al$_2$MnCu: A magnetically ordered member of the Heusler alloy family despite having a valence electron count of 24", "link": "http://arxiv.org/abs/2505.09574v1", "summary": "The magnetic property of the Heusler alloys can be predicted by the famous\nSlater-Pauling (S-P) rule, which states the total magnetic moment ($m_t$) of\nsuch materials can be expressed as $m _t\\,=\\,(N_V-24)\\,\\mu_B/f.u.$, where $N_V$\nis the total valence electron count (VEC). Consequently, no Heusler alloys\nhaving VEC = 24 are theoretically expected as well as experimentally reported\nto have any magnetic ordering. Recently, a special class of Heusler alloys with\n50\\% concentration of $p$-block elements (anti-Heusler) have been identified,\nalthough none of such reported compounds belong to the VEC 24 category. Here,\nwe report a new anti-Heusler alloy, Al$_2$MnCu, that undergoes long-range\nferromagnetic (FM) ordering with $T_{\\rm C}\\sim$315 K and a large magnetic\nmoment of $\\sim$1.8 $\\mu_B$/f.u. despite having VEC 24. A phenomenological\nmodel based on molecular orbital hybridization is also proposed to understand\nthe magnetism and unusual deviation from the standard S-P rule.", "authors": ["Soumya Bhowmik", "Santanu Pakhira", "Renu Choudhary", "Ravi Kumar", "Rajashri Urkude", "Biplab Ghosh", "D. Bhattacharyya", "Maxim Avdeev", "Chandan Mazumdar"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T17:24:39Z"}
{"id": "2505.09579v1", "title": "Three regimes of a picosecond magnetoacoustics in ferromagnetic structures", "link": "http://arxiv.org/abs/2505.09579v1", "summary": "The development of magnonic devices requires energy-efficient methods for\ngenerating spin waves and controlling their parameters. Acoustic waves are\nknown to excite spin waves resonantly with magneto-elastic wave formation or to\ndrive non-resonantly forced magnetization oscillations. Short acoustic\nwavevpackets enable another resonant interaction regime - Cherenkov radiation\nof spin waves. This poses a question on the criteria and signatures of\ntransitions between these three regimes of a picosecond magnetoacoustic. Here,\nwe use the scanning magneto-optical pump-probe technique to directly reveal all\nthree regimes of interactions of laser-driven acoustic and magnetostatic wave\npackets in a thin permalloy film and a waveguide on top of a (011)-Si\nsubstrate. Direct measurements of the phase velocities revealed the transition\nfrom coupled magneto-elastic wavepacket to Cherenkov-like radiation and\nnon-resonant regime controlled by the detuning between magnon and phonon group\nvelocities. Acoustic pulse is found to be affected by the excited magnetization\ndynamics only in the magneto-elastic regime.", "authors": ["P. I. Gerevenkov", "Ia. A. Mogunov", "Ia. A. Filatov", "N. S. Gusev", "M. V. Sapozhnikov", "N. E. Khokhlov", "A. M. Kalashnikova"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T17:30:28Z"}
{"id": "2505.09084v1", "title": "Polarization switching in sliding ferroelectrics: the roles of fluctuation and domain wall", "link": "http://arxiv.org/abs/2505.09084v1", "summary": "Sliding ferroelectricity is highly attractive for its low energy barriers and\nfatigue resistance. As the origin of these exotic properties, its\nunconventional switching dynamics remains poorly understood: how an electric\nfield drives a perpendicular sliding? Taking $h$-BN bilayer as a model system,\nits switching dynamics is studied using \\textit{ab initio} calculations. The\noff-diagonal Born effective charge leads to the perpendicular relationship\nbetween the electric field and ionic movements. Interestingly, the rules of\nintrinsic coercive field are distinct between $h$-BN bilayer and conventional\nferroelectrics. For $h$-BN bilayer, any perturbation breaking the in-plane\nsymmetry plays a key role to assist the avalanche-like switching dynamics.\nMoreover, the exotic large off-diagonal Born effective charge near the $P=0$\nintermediate state results in a wriggling motion of domain walls in $h$-BN\nbilayer. Our results reveal the key factors in the ferroelectric switching of\nsliding ferroelectrics at room temperature.", "authors": ["Ziwen Wang", "Shuai Dong"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T02:36:40Z"}
{"id": "2505.09147v1", "title": "Extended Dynamical Kubo-Toyabe Relaxation for $μ$SR study of Ion Dynamics: An Introduction", "link": "http://arxiv.org/abs/2505.09147v1", "summary": "In the analysis of the ion diffusion in metal oxides based on muon spin\nrotation and relaxation ($\\mu$SR), the dynamical Kubo-Toyabe (dKT) function has\nbeen routinely used to deduce the jump frequency of ions. This is based on the\ntwo beliefs: (1) the fluctuations of the internal magnetic field ${\\bm H}(t)$\nare determined solely by the relative motion of the muons to the surrounding\nions, and (2) the muons are immobile due to bonding to the oxygen. However,\nthese are not necessarily trivial, and we addressed their credibility by\ndeveloping an extended dKT function corresponding to the realistic situation\nthat only a part of the ions surrounding muon are involved in a single\nfluctuation of ${\\bm H}(t)$ in the ion diffusion, and investigated its behavior\nin detail. The results show that the new function exhibits qualitatively\ndifferent behavior from the dKT function, and that it provides a way to\ndetermine whether muons or ions are in motion, as well as a means for\nquantitative analysis based on the assumption of immobile muons. As a typical\nexample, we examine the earlier $\\mu^\\pm$SR results on Na$_x$CoO$_2$ and\ndemonstrate that the internal field fluctuations observed in $\\mu^+$SR are\ndominated by muon self-diffusion, in contrast to previous interpretations.", "authors": ["Takashi U. Ito", "Ryosuke Kadono"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T05:05:39Z"}
{"id": "2505.09161v1", "title": "Bridging Theory and Experiment in Materials Discovery: Machine-Learning-Assisted Prediction of Synthesizable Structures", "link": "http://arxiv.org/abs/2505.09161v1", "summary": "Even though thermodynamic energy-based crystal structure prediction (CSP) has\nrevolutionized materials discovery, the energy-driven CSP approaches often\nstruggle to identify experimentally realizable metastable materials synthesized\nthrough kinetically controlled pathways, creating a critical gap between\ntheoretical predictions and experimental synthesis. Here, we propose a\nsynthesizability-driven CSP framework that integrates symmetry-guided structure\nderivation with a Wyckoff encode-based machine-learning model, allowing for the\nefficient localization of subspaces likely to yield highly synthesizable\nstructures. Within the identified promising subspaces, a structure-based\nsynthesizability evaluation model, fine-tuned using recently synthesized\nstructures to enhance predictive accuracy, is employed in conjunction with ab\ninitio calculations to systematically identify synthesizable candidates. The\nframework successfully reproduces 13 experimentally known XSe (X = Sc, Ti, Mn,\nFe, Ni, Cu, Zn) structures, demonstrating its effectiveness in predicting\nsynthesizable structures. Notably, 92,310 structures are filtered from the\n554,054 candidates predicted by GNoME, exhibiting great potential for promising\nsynthesizability. Additionally, eight thermodynamically favorable Hf-X-O (X =\nTi, V, and Mn) structures have been identified, among which three HfV$_2$O$_7$\ncandidates exhibit high synthesizability, presenting viable candidates for\nexperimental realization and potentially associated with experimentally\nobserved temperature-induced phase transitions. This work establishes a\ndata-driven paradigm for machine-learning-assisted inorganic materials\nsynthesis, highlighting its potential to bridge the gap between computational\npredictions and experimental realization while unlocking new opportunities for\nthe targeted discovery of novel functional materials.", "authors": ["Yu Xin", "Peng Liu", "Zhuohang Xie", "Wenhui Mi", "Pengyue Gao", "Hong Jian Zhao", "Jian Lv", "Yanchao Wang", "Yanming Ma"], "category": "cs.LG", "updated": "2025-05-14T05:48:55Z"}
{"id": "2505.09174v1", "title": "Quotient Complex Transformer (QCformer) for Perovskite Data Analysis", "link": "http://arxiv.org/abs/2505.09174v1", "summary": "The discovery of novel functional materials is crucial in addressing the\nchallenges of sustainable energy generation and climate change. Hybrid\norganic-inorganic perovskites (HOIPs) have gained attention for their\nexceptional optoelectronic properties in photovoltaics. Recently, geometric\ndeep learning, particularly graph neural networks (GNNs), has shown strong\npotential in predicting material properties and guiding material design.\nHowever, traditional GNNs often struggle to capture the periodic structures and\nhigher-order interactions prevalent in such systems. To address these\nlimitations, we propose a novel representation based on quotient complexes\n(QCs) and introduce the Quotient Complex Transformer (QCformer) for material\nproperty prediction. A material structure is modeled as a quotient complex,\nwhich encodes both pairwise and many-body interactions via simplices of varying\ndimensions and captures material periodicity through a quotient operation. Our\nmodel leverages higher-order features defined on simplices and processes them\nusing a simplex-based Transformer module. We pretrain QCformer on benchmark\ndatasets such as the Materials Project and JARVIS, and fine-tune it on HOIP\ndatasets. The results show that QCformer outperforms state-of-the-art models in\nHOIP property prediction, demonstrating its effectiveness. The quotient complex\nrepresentation and QCformer model together contribute a powerful new tool for\npredictive modeling of perovskite materials.", "authors": ["Xinyu You", "Xiang Liu", "Chuan-Shen Hu", "Kelin Xia", "Tze Chien Sum"], "category": "cs.LG", "updated": "2025-05-14T06:13:14Z"}
{"id": "2505.09210v1", "title": "Harnessing self-sensitized scintillation by supramolecular engineering of CsPbBr3 nanocrystals in dense mesoporous template nanospheres", "link": "http://arxiv.org/abs/2505.09210v1", "summary": "Perovskite-based nanoscintillators, such as CsPbBr3 nanocrystals (NCs), are\nemerging as promising candidates for ionizing radiation detection, thanks to\ntheir high emission efficiency, rapid response, and facile synthesis. However,\ntheir nanoscale dimensions - smaller than the mean free path of secondary\ncarriers - and relatively low emitter density per unit volume, limited by their\nhigh molecular weight and reabsorption losses, restrict efficient secondary\ncarrier conversion and hamper their practical deployment. In this work, we\nintroduce a strategy to enhance scintillation performance by organizing NCs\ninto densely packed domains within porous SiO2 mesospheres (MSNs). This\nengineered architecture achieves up to a 40-fold increase in radioluminescence\nintensity compared to colloidal NCs, driven by improved retention and\nconversion of secondary charges, as corroborated by electron release\nmeasurements. This approach offers a promising pathway toward developing\nnext-generation nanoscintillators with enhanced performance, with potential\napplications in high-energy physics, medical imaging, and space technologies.", "authors": ["Xiaohe Zhou", "Matteo L. Zaffalon", "Emanuele Mazzola", "Andrea Fratelli", "Francesco Carulli", "Chenger Wang", "Mengda He", "Francesco Bruni", "Saptarshi Chakraborty", "Leonardo Poletti", "Francesca Rossi", "Luca Gironi", "Francesco Meinardi", "Liang Li", "Sergio Brovelli"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T08:04:02Z"}
{"id": "2505.09227v1", "title": "High Chern Number Quantum Anomalous Hall States in Haldane-Graphene Multilayers", "link": "http://arxiv.org/abs/2505.09227v1", "summary": "Quantum anomalous Hall (QAH) systems with high Chern number ($|C|>1$) are\nrare. This Letter introduces a Haldane-graphene multilayer heterostructure\nhosting QAH states with arbitrary Chern number. In a rhombohedral-stacked\ngraphene $N$-layer, the Dirac points at $K_{\\pm}$ become $N^\\text{th}$-order\nzeros of the low-energy effective Hamiltonian. When an extra layer of Haldane\nmodel is stacked on top of the multilayer, the high-order Dirac points are\ngapped out and the heterostructure enters QAH phases with $|C|=N+1$. Therefore,\ngapping out high-order Dirac points paves a new way to high Chern number QAH\nstates.", "authors": ["Yuejiu Zhao", "Long Zhang", "Fu-Chun Zhang"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T09:05:10Z"}
{"id": "2505.09362v1", "title": "Optoelectronic properties and performance optimization for photovoltaic applications of R3m-RbGeX$_3$ (X = Cl, Br, I) perovskites: A combined DFT and SCAPS-1D study", "link": "http://arxiv.org/abs/2505.09362v1", "summary": "In pursuit of an all-inorganic non-toxic perovskite solar cell (PSC) with\nenhanced performance, we have investigated the rhombohedral phase of the\ngermanium-based rubidium halide perovskites RbGeX$_3$ (X = Cl, Br, I). The\nstructural analysis followed by an in-depth study of the electronic and optical\nproperties of these materials is performed within the framework of density\nfunctional theory (DFT). A detailed investigation of the electronic properties\nis carried out by examining the band structure and partial density of states\n(PDOS). PBE and TB-mBJ exchange-correlation functionals are used with and\nwithout the spin-orbit coupling (SOC), thereby obtaining accurate predictions\nof the band gaps. The key optical properties such as the real and imaginary\nparts of the dielectric function, absorption coefficient and refractive index\nare studied using PBE functional and compared among the three halides.\nRbGeI$_3$ exhibits the lowest band gap of 0.96 eV with the TB-mBJ + SOC\nfunctional, along with the most favorable optical properties, hence, it was\nidentified as the most suitable candidate for the absorber layer (AL) of the\nPSC. SCAPS-1D simulation is performed using various input parameters for the AL\nsuch as the band gap, the effective densities of states for the conduction and\nvalence bands and the electron and hole mobilities extracted from the DFT\ncalculation. Performance optimization is done by exploring the impact of\ndifferent inorganic hole transport layers (HTLs) and electron transport layers\n(ETLs). The impact of different layer thicknesses, doping densities, defect\ndensities at the AL, ETL/AL, and AL/HTL interfaces, various back contacts, and\nthe influence of series and shunt resistance on the overall device performance\nare studied. The optimized all-inorganic device demonstrated a remarkable power\nconversion efficiency (PCE) of $25.76\\%$ with a fill factor (FF) of $79.81\\%$.", "authors": ["Piyush Kumar Dash", "Palash Banarjee", "Anupriya Nyayban", "Subhasis Panda"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T13:12:03Z"}
{"id": "2505.09401v1", "title": "A unified bonding entropy model to determine magnetic properties in graphene nanoflakes", "link": "http://arxiv.org/abs/2505.09401v1", "summary": "Graphene nanoflakes (GNFs) exhibit rich magnetic behaviors arising from two\nprimary mechanisms: geometry frustration in non-Kekul\\'e structures and\nelectron delocalization-driven aromatic stabilization in Kekul\\'e-type systems.\nHerein, we develop a unified bonding entropy model (BEM) to quantitatively\ncharacterize the magnetic properties in GNFs within a statistical framework,\nproviding an entropy-based criterion for understanding and predicting bond\noccupancy numbers and unpaired electron distributions. While non-Kekul\\'e\nsystems naturally favor high-spin configurations due to topological\nfrustration, the BEM reveals that even Kekul\\'e-type GNFs can exhibit magnetic\ncharacter when the entropy gain from unpaired electrons outweighs the loss of\naromatic stabilization. The model predictions show excellent agreement with\ndensity functional theory calculations in terms of spin density distributions\nand unpaired electron counts. Our results establish bonding entropy as a\ngeneral guiding principle for designing carbon-based magentic materials with\ntunable magnetic properties.", "authors": ["Chang-Chun He", "Jiarui Zeng", "Yu-Jun Zhao", "Xiao-Bao Yang"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T13:59:00Z"}
{"id": "2505.09461v1", "title": "Natural layered phlogopite dielectric for ultrathin two-dimensional optoelectronics", "link": "http://arxiv.org/abs/2505.09461v1", "summary": "The integration of high-dielectric-constant (high-$\\kappa$) materials with\ntwo-dimensional (2D) semiconductors is promising to overcome performance\nlimitations and reach their full theoretical potential. Here we show that\nnaturally occurring phlogopite mica, exfoliated into ultrathin flakes, can\nserve as a robust high-$\\kappa$ dielectric layer for transition metal\ndichalcogenide-based 2D electronics and optoelectronics. Phlogopite's wide\nbandgap (~4.8 eV), high dielectric constant (~11), and large breakdown field\n(10 MVcm$^{-1}$) enable transistors with subthreshold swings down to 100\nmVdec$^{-1}$, minimal hysteresis (30-60 mV) and interface trap densities\ncomparable to state-of-the-art oxide dielectrics. Moreover, phototransistors\nbuilt upon monolayer molybdenum disulfide (MoS$_2$) and phlogopite exhibit\nresponsivities up to 3.3x10$^{4}$ AW$^{-1}$ and detectivities near 10$^{10}$\nJones, surpassing devices based on conventional gate insulators. We further\ndemonstrate the versatility of this natural dielectric by integrating\nphlogopite/MoS$_2$ heterostructures into NMOS inverters, showcasing robust\nvoltage gains and low-voltage operation. Our findings establish phlogopite as a\npromising, earth-abundant dielectric for next-generation 2D transistor\ntechnologies and high-performance photodetection.", "authors": ["Thomas Pucher", "Julia Hernandez-Ruiz", "Guillermo Tajuelo-Castilla", "José Ángel Martín-Gago", "Carmen Munuera", "Andres Castellanos-Gomez"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T15:11:25Z"}
{"id": "2505.09463v1", "title": "Dynamics of charge states at the surface of a ferroelectric nanoparticle in a liquid crystal", "link": "http://arxiv.org/abs/2505.09463v1", "summary": "The liquid crystal with suspended ferroelectric nanoparticles is an\ninteresting object for fundamental research of the long-range dipole-dipole\ninteractions; as well as it is promising for optical, optoelectronic and\nelectrochemical applications. Such suspensions can serve as basic elements for\nadvanced nonvolatile memory cells and energy storage devices. The work studies\nthe cells filled with a nematic liquid crystal 5CB and the cells containing 5CB\nwith 0.5 wt.% and 1 wt.% of BaTiO3 nanoparticles with an average size of 24 nm.\nWe analyzed the time dependences of the current flowing through the cells at\nconstant applied voltage and the voltage dynamics in the no-load mode. The time\ndependences of the current and voltage show a slowing down decay rate. For the\ncells with BaTiO3 nanoparticles, the decrease in the decay time is\ncharacteristic. A possible physical reason for the retarding decay time rate is\nthe indirect effect of screening charges, which cover ferroelectric\nnanoparticles, and slow ionic transport in the liquid crystal. To explain the\ndynamics of current and voltage, the finite element modeling of the\npolarization distribution, domain structure dynamics, and charge state of\nnanoparticles in a liquid crystal is performed using Landau-Ginzburg-Devonshire\napproach. Theoretical results confirmed the leading role of screening charges,\nbecause the surface of a ferroelectric nanoparticle adsorbs an ionic-electronic\ncharge that partially screens its spontaneous polarization in single-domain\nand/or poly-domain states. When an electric field is applied to the liquid\ncrystal with nanoparticles, it can release part of the screening charge (mainly\ndue to the change in the polarization of the nanoparticle), which will lead to\na decrease in decay time rate of the current and voltage dependences.", "authors": ["Julia M. Gudenko", "Oleksandr S. Pylypchuk", "Victor V. Vainberg", "Vladimir N. Poroshin", "Denis O. Stetsenko", "Igor A. Gvozdovskyy", "Oleksii V. Bereznykov", "Serhii E. Ivanchenko", "Eugene A. Eliseev", "Anna N. Morozovska"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T15:15:50Z"}
{"id": "2505.09494v1", "title": "Ultraviolet interband plasmonics down to the vacuum UV with ultrathin amorphous silicon nanostructures", "link": "http://arxiv.org/abs/2505.09494v1", "summary": "Silicon dominates electronics, optoelectronics, photovoltaics and photonics\nthanks to its suitable properties, abundance, and well-developed cost-effective\nmanufacturing processes. Recently, crystalline silicon has been demonstrated to\nbe an appealing alternative plasmonic material, both for the infrared where\nfree-carrier plasmons are enabled by heavy doping, and for the ultraviolet\nwhere plasmonic effects are induced by interband transitions. Herein, we\ndemonstrate that nanostructured amorphous silicon exhibits such so-called\ninterband plasmonic properties in the ultraviolet, as opposed to the\nexpectation that they would only arise in crystalline materials. We report\noptical plasmon resonances in the 100-to-300 nm wavelength range in ultrathin\nnanostructures. These resonances shift spectrally with the nanostructure shape\nand the nature of the surrounding matrix, while their field enhancement\nproperties turn from surface plasmonic to epsilon-near-zero plasmonic. We\npresent a vacuum ultraviolet wavelength- and polarization-selective ultrathin\nfilm absorber design based on deeply-subwavelength anisotropically-shaped\nnanostructures. These findings reveal amorphous silicon as a promising material\nplatform for ultracompact and room-temperature-processed ultraviolet plasmonic\ndevices operating down to vacuum ultraviolet wavelengths, for applications\nincluding anticounterfeiting, data encryption and storage, sensing and\ndetection. Furthermore, these findings raise a fundamental question on how\nplasmonics can be based on amorphous nanostructures.", "authors": ["Johann Toudert", "Rosalía Serna", "Javier Martín Sánchez", "Juan I. Larruquert", "Lorenzo Calvo-Barrío"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T15:43:09Z"}
{"id": "2505.09570v1", "title": "Analytical and Scale-Free Phase-Field Studies of $α$ to $ω$ Phase Transformation in Single Crystal Zirconium under Nonhydrostatic Loadings", "link": "http://arxiv.org/abs/2505.09570v1", "summary": "Zirconium (Zr) is an important engineering material with numerous practical\napplications. It undergoes martensitic $\\alpha$ to $\\omega$ phase\ntransformation (PT) at pressures that vary from 0.67 GPa to 17 GPa under\ndifferent loading conditions. Despite numerous experimental and theoretical\nstudies, the effect of the nonhydrostatic stresses is not well understood. To\nseparate the effect of nonhydrostatic stresses from the plastic deformation, a\nscale-free phase field approach (PFA) for multivariant $\\alpha$ to $\\omega$ PT\nin a single crystal Zr under general nonhydrostatic loadings is presented.\nExplicit conditions for the direct and reverse PTs between austenite and\nmartensitic variants and between martensitic variants under general stress\ntensor are derived and analyzed. In particular, the effect of the deviatoric\nstresses on the PT pressures is elucidated. It is shown that their effect\ncannot explain much larger reduction in the transformation pressure observed\nduring plastic flow, i.e., specific mechanisms of strain-induced phase\ntransformations should be involved. Under assumption of the homogeneous fields\nin the sample, complete analytical solutions that include stress-strain curves\nduring the PT, PT start and finish stresses (i.e., stress hysteresis), and\nvolume fraction of the variants, are determined for different loadings. Finite\nelement method (FEM) solutions are found for the phase field simulations of the\nmicrostructure evolution for the same loadings, as well as for two grains of\nthe polycrystalline sample. Macroscopic averaged characteristics of the PFA\nsolutions are well described by an analytical solution, which also simplifies\ntheir interpretations. Obtained results are in good qualitative agreement with\nexisting experiments. In addition, some controversies of the previous\napproaches are analysed.", "authors": ["Raghunandan Pratoori", "Hamed Babaei", "Valery I. Levitas"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T17:14:03Z"}
{"id": "2505.09587v1", "title": "On-surface Synthesis of a Ferromagnetic Molecular Spin Trimer", "link": "http://arxiv.org/abs/2505.09587v1", "summary": "Triangulenes are prototypical examples of open-shell nanographenes. Their\nmagnetic properties, arising from the presence of unpaired $\\pi$ electrons, can\nbe extensively tuned by modifying their size and shape or by introducing\nheteroatoms. Different triangulene derivatives have been designed and\nsynthesized in recent years, thanks to the development of on-surface synthesis\nstrategies. Triangulene-based nanostructures with polyradical character,\nhosting several interacting spin units, can be challenging to fabricate but are\nparticularly interesting for potential applications in carbon-based\nspintronics. Here, we combine pristine and N-doped triangulenes into a more\ncomplex nanographene, \\textbf{TTAT}, predicted to possess three unpaired $\\pi$\nelectrons delocalized along the zigzag periphery. We generate the molecule on\nan Au(111) surface and detect direct fingerprints of multi-radical coupling and\nhigh-spin state using scanning tunneling microscopy and spectroscopy. With the\nsupport of theoretical calculations, we show that its three radical units are\nlocalized at distinct parts of the molecule and couple via symmetric\nferromagnetic interactions, which result in a $S=3/2$ ground state, thus\ndemonstrating the realization of a molecular ferromagnetic Heisenberg-like spin\ntrimer", "authors": ["Alessio Vegliante", "Manuel Vilas-Varela", "Ricardo Ortiz", "Francisco Romero Lara", "Manish Kumar", "Lucía Gómez-Rodrigo", "Stefano Trivini", "Fabian Schulz", "Diego Soler", "Hassan Ahmoum", "Emilio Artacho", "Thomas Frederiksen", "Pavel Jelínek", "Jose Ignacio Pascual", "Diego Peña"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T17:38:12Z"}
{"id": "2505.09606v1", "title": "Comparative Analysis of GFN Methods in Geometry Optimization of Small Organic Semiconductor Molecules: A DFT Benchmarking Study", "link": "http://arxiv.org/abs/2505.09606v1", "summary": "This study benchmarks the geometric, frequency, non-covalent (GFN)\nsemi-empirical methods, GFN1-xTB, GFN2-xTB, GFN0-xTB, and GFN-FF, against\ndensity functional theory (DFT) for the geometry optimization of small organic\nsemiconductor molecules. Two datasets are evaluated: a QM9-derived subset of\nsmall organic molecules and the Harvard Clean Energy Project (CEP) database of\nextended $\\pi$-systems relevant to organic photovoltaics. Structural agreement\nis quantified using heavy-atom RMSD, equilibrium rotational constants, bond\nlengths, angles, and HOMO-LUMO energy gaps. Computational efficiency is\nassessed via CPU time and scaling behavior. GFN1-xTB and GFN2-xTB demonstrate\nthe highest structural fidelity, while GFN-FF offers an optimal balance between\naccuracy and speed, particularly for larger systems. The results indicate that\nGFN-based methods are suitable for high-throughput molecular screening of small\norganic semiconductors, the choice of the method depending on the accuracy-cost\ntrade-offs. The findings support the deployment of GFN approaches in\ncomputational pipelines for the discovery of organic electronics and materials,\nproviding information on their strengths and limitations relative to\nestablished DFT methods.", "authors": ["Steve Cabrel Teguia Kouam", "Jean-Pierre Tchapet Njafa", "Raoult Dabou Teukam", "Patrick Mvoto Kongo", "Jean-Pierre Nguenang", "Serge Guy Nana Engo"], "category": "physics.chem-ph", "updated": "2025-05-14T17:57:21Z"}
{"id": "2505.09203v1", "title": "InvDesFlow-AL: Active Learning-based Workflow for Inverse Design of Functional Materials", "link": "http://arxiv.org/abs/2505.09203v1", "summary": "Developing inverse design methods for functional materials with specific\nproperties is critical to advancing fields like renewable energy, catalysis,\nenergy storage, and carbon capture. Generative models based on diffusion\nprinciples can directly produce new materials that meet performance\nconstraints, thereby significantly accelerating the material design process.\nHowever, existing methods for generating and predicting crystal structures\noften remain limited by low success rates. In this work, we propose a novel\ninverse material design generative framework called InvDesFlow-AL, which is\nbased on active learning strategies. This framework can iteratively optimize\nthe material generation process to gradually guide it towards desired\nperformance characteristics. In terms of crystal structure prediction, the\nInvDesFlow-AL model achieves an RMSE of 0.0423 {\\AA}, representing an 32.96%\nimprovement in performance compared to exsisting generative models.\nAdditionally, InvDesFlow-AL has been successfully validated in the design of\nlow-formation-energy and low-Ehull materials. It can systematically generate\nmaterials with progressively lower formation energies while continuously\nexpanding the exploration across diverse chemical spaces. These results fully\ndemonstrate the effectiveness of the proposed active learning-driven generative\nmodel in accelerating material discovery and inverse design. To further prove\nthe effectiveness of this method, we took the search for BCS superconductors\nunder ambient pressure as an example explored by InvDesFlow-AL. As a result, we\nsuccessfully identified Li\\(_2\\)AuH\\(_6\\) as a conventional BCS superconductor\nwith an ultra-high transition temperature of 140 K. This discovery provides\nstrong empirical support for the application of inverse design in materials\nscience.", "authors": ["Xiao-Qi Han", "Peng-Jie Guo", "Ze-Feng Gao", "Hao Sun", "Zhong-Yi Lu"], "category": "cs.LG", "updated": "2025-05-14T07:29:06Z"}
{"id": "2505.09248v1", "title": "Enhanced Spin Pumping and Magnetization dynamics in Ni$_{80}$Fe$_{20}$/MoS$_2$ stack via interface modification", "link": "http://arxiv.org/abs/2505.09248v1", "summary": "Materials with strong spin orbit coupling (SOC) are essential for realizing\nspin orbit torque (SOT) based magnetic memory devices. Transition metal\ndichalcogenides (TMDs) are promising candidates for such appli cations because\nof their inherently high SOC strength. In this study, we investigate the spin\npumping effect at the interface between a monolayer of molybdenum disulfide\n(ML-MoS$_2$) and Ni$_{80}$Fe$_{20}$ (Py) thin films using broadband\nferromagnetic resonance (FMR) spectroscopy. FMR measurements reveal a notable\nenhancement in the effective Gilbert damping factor for the ML-MoS$_2$/Py (Pt =\n0 nm) interface compared to the reference Py thin films, attributed to spin\npumping across the ML-MoS$_2$/Py interface. To further quantify spin pumping\nefficiency, we introduce a high SOC platinum (Pt) interlayer at the\nML-MoS$_2$/Py interface and systematically vary its thickness. This allows us\nto evaluate key spin transport parameters, including the enhancement in the\neffective Gilbert damping parameter, the effective spin mixing conductance that\nreflects the transfer of spin angular momentum from Py to ML-MoS$_2$ and the\neffective spin current density.", "authors": ["Mahammad Tahir", "Somya Diwakar", "Subhakanta Das", "Mukul Gupta", "Rohit Medwal", "Soumik Mukhopadhyay"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T09:38:40Z"}
{"id": "2505.09547v1", "title": "Bulk superinsulation and polar nematic order in nanopatterned NbTiN", "link": "http://arxiv.org/abs/2505.09547v1", "summary": "We present an experimental evidence of 3D superinsulation in a nanopatterned\nslab of NbTiN, given by the Vogel-Fulcher-Tamman (VFT) scaling of the\nconductance when approaching the critical temperature from above and by the\nvanishing of the conductance below the transition. In the electric Meissner\nstate, we find polar nematic order arising from ferroelectric alignement of\nshort electric strings excited by external electromagnetic fields. Our results\nprove that superinsulation appears also in ordered structures provided that\nthese are large enough, thereby confirming the origin of superinsulation as\nelectric confinement, independent of disorder.", "authors": ["A. Yu. Mironov", "C. A. Trugenberger", "M. C. Diamantini", "D. A. Nasimov", "V. M. Vinokur"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T16:46:18Z"}
{"id": "2505.09442v1", "title": "Probing the Temporal Response of Liquid Water to a THz Pump Pulse Using Machine Learning-Accelerated Non-Equilibrium Molecular Dynamics", "link": "http://arxiv.org/abs/2505.09442v1", "summary": "Ultrafast, time-resolved spectroscopies enable the direct observation of\nnon-equilibrium processes in condensed-phase systems and have revealed key\ninsights into energy transport, hydrogen-bond dynamics, and vibrational\ncoupling. While ab initio molecular dynamics (AIMD) provides accurate,\natomistic resolution of such dynamics, it becomes prohibitively expensive for\nnon-equilibrium processes that require many independent trajectories to capture\nthe stochastic nature of excitation and relaxation. To address this, we\nimplemented a machine learning potential that incorporates time-dependent\nelectric fields in a perturbative fashion, retaining AIMD-level accuracy. Using\nthis approach, we simulate the time-dependent response of liquid water to a\n12.3 THz Gaussian pump pulse (1.3 ps width), generating 32 ns of total\ntrajectory data. With access to ab initio-quality electronic structure, we\ncompute absorption coefficients and frequency-dependent refractive indices\nbefore, during, and after the pulse. The simulations reproduce key experimental\nobservables, including transient birefringence and relaxation times. We observe\nenergy transfer from the excited librational modes into translational and\nintramolecular vibrations, accompanied by a transient, nonlinear response of\nthe hydrogen-bond network and a characteristic 0.7 ps timescale associated with\nlibrational energy dissipation. These findings demonstrate the method's ability\nto capture essential non-equilibrium dynamics with theoretical time-dependent\nIR spectroscopy and establish a broadly applicable framework for studying\nfield-driven processes in complex molecular systems.", "authors": ["Kit Joll", "Philipp Schienbein"], "category": "physics.chem-ph", "updated": "2025-05-14T14:50:36Z"}
{"id": "2505.09418v1", "title": "DIALECT, a software package for exciton spectra and dynamics in large molecular assemblies from weak to strong light-matter coupling regimes", "link": "http://arxiv.org/abs/2505.09418v1", "summary": "The software package DIALECT is introduced, which provides the capability of\ncalculating excited-state properties and nonadiabatic dynamics of large\nmolecular systems and can be applied to simulate energy and charge-transfer\nprocesses in molecular materials. To this end, we employ the FMO-LC-TDDFTB\nmethodology, which combines the use of the fragment molecular orbital approach\nwith the density-functional tight-binding method and an excitonic Hamiltonian\nincluding local and charge-transfer excitations. In this work, we present the\nfeatures and capabilities of the DIALECT software package in simulating the\nexcited state dynamics of molecules and molecular aggregates using exemplary\ntrajectory surface hopping as well as decoherence corrected Ehrenfest dynamics\ncalculations in the framework of LC-TDDFTB and FMO-LC-TDDFTB. In addition, the\ncapability of simulating the polaritonic excited state properties is\nhighlighted by the calculation of the polariton dispersion of an aggregate of\nnaphthalene molecules. The development of the DIALECT program will facilitate\nthe investigation of exciton and charge transport in large and complex\nmolecular systems, such as biological aggregates, nanomaterials and other\ncomplex organic molecular systems.", "authors": ["Richard Einsele", "Xincheng Miao", "Luca Nils Philipp", "Roland Mitric"], "category": "physics.comp-ph", "updated": "2025-05-14T14:18:26Z"}
{"id": "2505.09060v1", "title": "SpectraMatcher: A Python Program for Interactive Analysis and Peak Assignment of Vibronic Spectra", "link": "http://arxiv.org/abs/2505.09060v1", "summary": "SpectraMatcher is a cross-platform desktop application for interactive\ncomparison of experimental and computed vibronic spectra, designed to assist in\nthe recognition and assignment of spectral patterns. It provides an intuitive\ngraphical interface -- with no coding or scripting required -- for importing\nexperimental spectra, visualizing them alongside the corresponding theoretical\nspectra constructed from Gaussian frequency calculations, and adjusting key\nparameters such as peak width, intensity scaling factors, and\nvibration-type-specific anharmonic corrections. SpectraMatcher features an\nautomated peak-matching algorithm that assigns experimental and computed peaks\nbased on their intensity ratio and proximity. Assignments and spectra can be\nexported in multiple formats for publication or for further analysis. The\nsoftware remains responsive even for large datasets, and supports efficient and\nreproducible interpretation of vibronic spectra.", "authors": ["Johanna Langner", "Isabelle Weber", "Henryk A. Witek", "Yuan-Pern Lee"], "category": "physics.comp-ph", "updated": "2025-05-14T01:44:23Z"}
{"id": "2505.09262v1", "title": "EDBench: Large-Scale Electron Density Data for Molecular Modeling", "link": "http://arxiv.org/abs/2505.09262v1", "summary": "Existing molecular machine learning force fields (MLFFs) generally focus on\nthe learning of atoms, molecules, and simple quantum chemical properties (such\nas energy and force), but ignore the importance of electron density (ED)\n$\\rho(r)$ in accurately understanding molecular force fields (MFFs). ED\ndescribes the probability of finding electrons at specific locations around\natoms or molecules, which uniquely determines all ground state properties (such\nas energy, molecular structure, etc.) of interactive multi-particle systems\naccording to the Hohenberg-Kohn theorem. However, the calculation of ED relies\non the time-consuming first-principles density functional theory (DFT) which\nleads to the lack of large-scale ED data and limits its application in MLFFs.\nIn this paper, we introduce EDBench, a large-scale, high-quality dataset of ED\ndesigned to advance learning-based research at the electronic scale. Built upon\nthe PCQM4Mv2, EDBench provides accurate ED data, covering 3.3 million\nmolecules. To comprehensively evaluate the ability of models to understand and\nutilize electronic information, we design a suite of ED-centric benchmark tasks\nspanning prediction, retrieval, and generation. Our evaluation on several\nstate-of-the-art methods demonstrates that learning from EDBench is not only\nfeasible but also achieves high accuracy. Moreover, we show that learning-based\nmethod can efficiently calculate ED with comparable precision while\nsignificantly reducing the computational cost relative to traditional DFT\ncalculations. All data and benchmarks from EDBench will be freely available,\nlaying a robust foundation for ED-driven drug discovery and materials science.", "authors": ["Hongxin Xiang", "Ke Li", "Mingquan Liu", "Zhixiang Cheng", "Bin Yao", "Wenjie Du", "Jun Xia", "Li Zeng", "Xin Jin", "Xiangxiang Zeng"], "category": "cs.LG", "updated": "2025-05-14T10:23:22Z"}
{"id": "2505.09543v1", "title": "Learned Free-Energy Functionals from Pair-Correlation Matching for Dynamical Density Functional Theory", "link": "http://arxiv.org/abs/2505.09543v1", "summary": "Classical density functional theory (cDFT) and dynamical density functional\ntheory (DDFT) are modern statistical mechanical theories for modelling\nmany-body colloidal systems at the one-body density level. The theories hinge\non knowing the excess free-energy accurately, which is however not feasible for\nmost practical applications. Dijkman et al. [Phys. Rev. Lett. 134, 056103\n(2025)] recently showed how a neural excess free-energy functional for cDFT can\nbe learned from inexpensive bulk simulations via pair-correlation matching. In\nthis Letter, we demonstrate how this same functional can be applied to DDFT,\nwithout any retraining, to simulate non-equilibrium overdamped dynamics of\ninhomogeneous densities. We evaluate this on a 3D Lennard-Jones system with\nplanar geometry under various complex external potentials and observe good\nagreement of the dynamical densities with those from expensive Brownian dynamic\nsimulations, up to the limit of the adiabatic approximation. We further develop\nand apply an extension of DDFT to a grand-canonical system modeled after\nbreakthrough gas adsorption studies, finding similarly good agreement. Our\nresults demonstrate a practical route for leveraging learned free-energy\nfunctionals in DDFT, paving the way for accurate and efficient modeling of\nnon-equilibrium systems.", "authors": ["Karnik Ram", "Jacobus Dijkman", "René van Roij", "Jan-Willem Van de Meent", "Bernd Ensing", "Max Welling", "Daniel Cremers"], "category": "physics.chem-ph", "updated": "2025-05-14T16:42:36Z"}
{"id": "2505.09071v1", "title": "Autoencoder-based Dimensionality Reduction for Accelerating the Solution of Nonlinear Time-Dependent PDEs: Transport in Porous Media with Reactions", "link": "http://arxiv.org/abs/2505.09071v1", "summary": "Physics-based models often involve large systems of parametrized partial\ndifferential equations, where design parameters control various properties.\nHowever, high-fidelity simulations of such systems on large domains or with\nhigh grid resolution can be computationally expensive for the accurate\nevaluation of a large number of parameters. Reduced-order modeling has emerged\nas a solution to reduce the dimensionality of such problems. This work focuses\non a nonlinear compression technique using a convolutional autoencoder for\naccelerating the solution of transport in porous media problems. The model\ndemonstrates successful training, achieving a mean square error (MSE) on the\norder of \\num{1e-3} for the validation data. For an unseen parameter set, the\nmodel exhibits mixed performance; it achieves acceptable accuracy for larger\ntime steps but shows lower performance for earlier times. This issue could\npotentially be resolved by fine-tuning the network architecture.", "authors": ["Diba Behnoudfar"], "category": "physics.comp-ph", "updated": "2025-05-14T02:14:26Z"}
{"id": "2505.09297v1", "title": "Unified gas-kinetic wave-particle method for multi-scale phonon transport", "link": "http://arxiv.org/abs/2505.09297v1", "summary": "Over the past 7 decades, the classical Monte Carlo method has played a huge\nrole in the fields of rarefied gas flow and micro/nano scale heat transfer, but\nit also has shortcomings: the time step and cell size are limited by the\nrelaxation time and mean free path, making it difficult to efficiently simulate\nmulti-scale heat and mass transfer problems from the ballistic to diffusion\nlimit. To overcome this drawback, a unified gas-kinetic wave-particle (UGKWP)\nmethod is developed for solving the phonon Boltzmann transport equation (BTE)\nin all regimes covering both ballistic and diffusive limits. This method is\nbuilt upon the space-time coupled evolution model of the phonon BTE, which\nprovides the framework for constructing a multi-scale flux at the cell\ninterfaces. At the same time, in order to capture non-equilibrium transport\nefficiently, the multi-scale flux comprises two distinct components: a\ndeterministic part for capturing the near-equilibrium or diffusive transport\nand a statistical particle part for recovering non-equilibrium or ballistic\ntransport phenomena. The UGKWP method exhibits remarkable multi-scale\nadaptability and versatility, seamlessly bridging the gap between the diffusive\nand ballistic transport phenomena. In the diffusive limit, the present method\nnaturally converges to the Fourier's law, with the diminishing particle\ncontribution, whereas in the ballistic limit, the non-equilibrium flux is fully\ndescribed by the free-streaming particles. This inherent adaptability not only\nallows for precise capturing of both equilibrium and non-equilibrium heat\ntransfer processes but also guarantees that the model adheres strictly to the\nunderlying physical laws in each phonon transport regime.", "authors": ["Hongyu Liu", "Xiaojian Yang", "Chuang Zhang", "Xing Ji", "Kun Xu"], "category": "physics.comp-ph", "updated": "2025-05-14T11:26:04Z"}
{"id": "2505.09540v1", "title": "Atomic Confinement Potentials", "link": "http://arxiv.org/abs/2505.09540v1", "summary": "Motivated by the development of reusable software for computational chemistry\n[Lehtola, J. Chem. Phys. 159, 180901 (2023)], we aim to establish novel open\nsource infrastructure for calculations with numerical atomic orbital (NAO)\nbasis sets. Soft confinement potentials are typically used in this context to\nforce the NAO radial basis functions {\\psi}nl (r) to vanish smoothly in\nincreasing r and to generate localized unoccupied states; we review such\npotentials in this work as a follow-up to our recent study on hard-wall\nconfinement [{\\AA}str\\\"om and Lehtola, J. Phys. Chem. A 129, 2791 (2025)]. We\nalso note that in addition to their use in NAO generation, confinement\npotentials are also employed to simulate environmental effects in other\nresearch areas, such as studies of (i) atoms in solids, (ii) quantum dots, and\n(iii) high-pressure chemistry.\n  As in our earlier work, we perform fully numerical density functional theory\n(DFT) calculations with the Perdew-Burke-Ernzerhof (PBE) exchange-correlation\nfunctional, and employ spherically averaged, spin-restricted densities, as is\nusual in NAO studies. Our calculations employ the HelFEM program, which\nimplements the finite element method (FEM), yielding variational energies and\nenabling the use of various boundary conditions.\n  We consider four families of potentials to study the Mg and Ca atoms, which\nare textbook examples of extended electronic structures. We show that the\nresulting ground-state orbitals are surprisingly insensitive to the employed\nform of the confinement potential, and that the orbitals decay quickly under\nconfinement. We study increasingly steep potentials and point out how they\napproach the hard-wall limit in a systematic and smooth manner. Finally, we\nassess NAO basis set truncation errors arising from various parameter choices\nfor the singular potentials that are now broadly used in the NAO literature.", "authors": ["Hugo Åström", "Susi Lehtola"], "category": "physics.comp-ph", "updated": "2025-05-14T16:32:50Z"}
{"id": "2505.09545v1", "title": "TorchGDM: A GPU-Accelerated Python Toolkit for Multi-Scale Electromagnetic Scattering with Automatic Differentiation", "link": "http://arxiv.org/abs/2505.09545v1", "summary": "We present \"torchGDM\", a numerical framework for nano-optical simulations\nbased on the Green's Dyadic Method (GDM). This toolkit combines a hybrid\napproach, allowing for both fully discretized nano-structures and structures\napproximated by sets of effective electric and magnetic dipoles. It supports\nsimulations in three dimensions and for infinitely long, two-dimensional\nstructures. This capability is particularly suited for multi-scale modeling,\nenabling accurate near-field calculations within or around a discretized\nstructure embedded in a complex environment of scatterers represented by\neffective models. Importantly, torchGDM is entirely implemented in PyTorch, a\nwell-optimized and GPU-enabled automatic differentiation framework. This allows\nfor the efficient calculation of exact derivatives of any simulated observable\nwith respect to various inputs, including positions, wavelengths or\npermittivity, but also intermediate parameters like Green's tensors. We\nanticipate that this toolkit will be valuable for applications merging\nnano-photonics and machine learning, as well as for solving nano-photonic\noptimization and inverse problems, such as the global design and\ncharacterization of metasurfaces, where optical interactions between structures\nare critical.", "authors": ["Sofia Ponomareva", "Adelin Patoux", "Clément Majorel", "Antoine Azéma", "Aurélien Cuche", "Christian Girard", "Arnaud Arbouet", "Peter R. Wiecha"], "category": "physics.comp-ph", "updated": "2025-05-14T16:45:46Z"}
{"id": "2505.09469v1", "title": "Primal-dual splitting methods for phase-field surfactant model with moving contact lines", "link": "http://arxiv.org/abs/2505.09469v1", "summary": "Surfactants have important effects on the dynamics of droplets on solid\nsurfaces, which has inspired many industrial applications. Phase-field\nsurfactant model with moving contact lines (PFS-MCL) has been employed to\ninvestigate the complex droplet dynamics with surfactants, while its numerical\nsimulation remains challenging due to the coupling of gradient flows with\nrespect to transport distances involving nonlinear and degenerate mobilities.\nWe propose a novel structure-preserving variational scheme for PFS-MCL model\nwith the dynamic boundary condition based on the minimizing movement scheme and\noptimal transport theory for Wasserstein gradient flows. The proposed scheme\nconsists of a series of convex minimization problems and can be efficiently\nsolved by our proposed primal-dual splitting method and its accelerated\nversions. By respecting the underlying PDE's variational structure with respect\nto the transport distance, the proposed scheme is proved to inherits the\ndesirable properties including original energy dissipation, bound-preserving,\nand mass conservation. Through a suite of numerical simulations, we validate\nthe performance of the proposed scheme and investigate the effects of\nsurfactants on the droplet dynamics.", "authors": ["Wei Wu", "Zhen Zhang", "Chaozhen Wei"], "category": "physics.comp-ph", "updated": "2025-05-14T15:20:53Z"}
{"id": "2505.09289v1", "title": "Reproducibility Study of \"Cooperate or Collapse: Emergence of Sustainable Cooperation in a Society of LLM Agents\"", "link": "http://arxiv.org/abs/2505.09289v1", "summary": "This study evaluates and extends the findings made by Piatti et al., who\nintroduced GovSim, a simulation framework designed to assess the cooperative\ndecision-making capabilities of large language models (LLMs) in\nresource-sharing scenarios. By replicating key experiments, we validate claims\nregarding the performance of large models, such as GPT-4-turbo, compared to\nsmaller models. The impact of the universalization principle is also examined,\nwith results showing that large models can achieve sustainable cooperation,\nwith or without the principle, while smaller models fail without it. In\naddition, we provide multiple extensions to explore the applicability of the\nframework to new settings. We evaluate additional models, such as DeepSeek-V3\nand GPT-4o-mini, to test whether cooperative behavior generalizes across\ndifferent architectures and model sizes. Furthermore, we introduce new\nsettings: we create a heterogeneous multi-agent environment, study a scenario\nusing Japanese instructions, and explore an \"inverse environment\" where agents\nmust cooperate to mitigate harmful resource distributions. Our results confirm\nthat the benchmark can be applied to new models, scenarios, and languages,\noffering valuable insights into the adaptability of LLMs in complex cooperative\ntasks. Moreover, the experiment involving heterogeneous multi-agent systems\ndemonstrates that high-performing models can influence lower-performing ones to\nadopt similar behaviors. This finding has significant implications for other\nagent-based applications, potentially enabling more efficient use of\ncomputational resources and contributing to the development of more effective\ncooperative AI systems.", "authors": ["Pedro M. P. Curvo", "Mara Dragomir", "Salvador Torpes", "Mohammadmahdi Rahimi"], "category": "cs.AI", "updated": "2025-05-14T11:15:14Z"}
{"id": "2505.09341v1", "title": "Access Controls Will Solve the Dual-Use Dilemma", "link": "http://arxiv.org/abs/2505.09341v1", "summary": "AI safety systems face a dual-use dilemma. Since the same request can be\neither harmless or harmful depending on who made it and why, if the system\nmakes decisions based solely on the request's content, it will refuse some\nlegitimate queries and let pass harmful ones. To address this, we propose a\nconceptual access control framework, based on verified user credentials (such\nas institutional affiliation) and classifiers that assign model outputs to risk\ncategories (such as advanced virology). The system permits responses only when\nthe user's verified credentials match the category's requirements. For\nimplementation of the model output classifiers, we introduce a theoretical\napproach utilizing small, gated expert modules integrated into the generator\nmodel, trained with gradient routing, that enable efficient risk detection\nwithout the capability gap problems of external monitors. While open questions\nremain about the verification mechanisms, risk categories, and the technical\nimplementation, our framework makes the first step toward enabling granular\ngovernance of AI capabilities: verified users gain access to specialized\nknowledge without arbitrary restrictions, while adversaries are blocked from\nit. This contextual approach reconciles model utility with robust safety,\naddressing the dual-use dilemma.", "authors": ["Evžen Wybitul"], "category": "cs.AI", "updated": "2025-05-14T12:38:08Z"}
{"id": "2505.09412v1", "title": "Counterfactual Strategies for Markov Decision Processes", "link": "http://arxiv.org/abs/2505.09412v1", "summary": "Counterfactuals are widely used in AI to explain how minimal changes to a\nmodel's input can lead to a different output. However, established methods for\ncomputing counterfactuals typically focus on one-step decision-making, and are\nnot directly applicable to sequential decision-making tasks. This paper fills\nthis gap by introducing counterfactual strategies for Markov Decision Processes\n(MDPs). During MDP execution, a strategy decides which of the enabled actions\n(with known probabilistic effects) to execute next. Given an initial strategy\nthat reaches an undesired outcome with a probability above some limit, we\nidentify minimal changes to the initial strategy to reduce that probability\nbelow the limit. We encode such counterfactual strategies as solutions to\nnon-linear optimization problems, and further extend our encoding to synthesize\ndiverse counterfactual strategies. We evaluate our approach on four real-world\ndatasets and demonstrate its practical viability in sophisticated sequential\ndecision-making tasks.", "authors": ["Paul Kobialka", "Lina Gerlach", "Francesco Leofante", "Erika Ábrahám", "Silvia Lizeth Tapia Tarifa", "Einar Broch Johnsen"], "category": "cs.AI", "updated": "2025-05-14T14:07:27Z"}
{"id": "2505.09082v1", "title": "CEC-Zero: Chinese Error Correction Solution Based on LLM", "link": "http://arxiv.org/abs/2505.09082v1", "summary": "Recent advancements in large language models (LLMs) demonstrate exceptional\nChinese text processing capabilities, particularly in Chinese Spelling\nCorrection (CSC). While LLMs outperform traditional BERT-based models in\naccuracy and robustness, challenges persist in reliability and generalization.\nThis paper proposes CEC-Zero, a novel reinforcement learning (RL) framework\nenabling LLMs to self-correct through autonomous error strategy learning\nwithout external supervision. By integrating RL with LLMs' generative power,\nthe method eliminates dependency on annotated data or auxiliary models.\nExperiments reveal RL-enhanced LLMs achieve industry-viable accuracy and\nsuperior cross-domain generalization, offering a scalable solution for\nreliability optimization in Chinese NLP applications. This breakthrough\nfacilitates LLM deployment in practical Chinese text correction scenarios while\nestablishing a new paradigm for self-improving language models.", "authors": ["Sophie Zhang", "Zhiming Lin"], "category": "cs.CL", "updated": "2025-05-14T02:35:47Z"}
{"id": "2505.09085v1", "title": "Human-like Cognitive Generalization for Large Models via Brain-in-the-loop Supervision", "link": "http://arxiv.org/abs/2505.09085v1", "summary": "Recent advancements in deep neural networks (DNNs), particularly large-scale\nlanguage models, have demonstrated remarkable capabilities in image and natural\nlanguage understanding. Although scaling up model parameters with increasing\nvolume of training data has progressively improved DNN capabilities, achieving\ncomplex cognitive abilities - such as understanding abstract concepts,\nreasoning, and adapting to novel scenarios, which are intrinsic to human\ncognition - remains a major challenge. In this study, we show that\nbrain-in-the-loop supervised learning, utilizing a small set of brain signals,\ncan effectively transfer human conceptual structures to DNNs, significantly\nenhancing their comprehension of abstract and even unseen concepts.\nExperimental results further indicate that the enhanced cognitive capabilities\nlead to substantial performance gains in challenging tasks, including\nfew-shot/zero-shot learning and out-of-distribution recognition, while also\nyielding highly interpretable concept representations. These findings highlight\nthat human-in-the-loop supervision can effectively augment the complex\ncognitive abilities of large models, offering a promising pathway toward\ndeveloping more human-like cognitive abilities in artificial systems.", "authors": ["Jiaxuan Chen", "Yu Qi", "Yueming Wang", "Gang Pan"], "category": "cs.LG", "updated": "2025-05-14T02:39:10Z"}
{"id": "2505.09108v1", "title": "Air-Ground Collaboration for Language-Specified Missions in Unknown Environments", "link": "http://arxiv.org/abs/2505.09108v1", "summary": "As autonomous robotic systems become increasingly mature, users will want to\nspecify missions at the level of intent rather than in low-level detail.\nLanguage is an expressive and intuitive medium for such mission specification.\nHowever, realizing language-guided robotic teams requires overcoming\nsignificant technical hurdles. Interpreting and realizing language-specified\nmissions requires advanced semantic reasoning. Successful heterogeneous robots\nmust effectively coordinate actions and share information across varying\nviewpoints. Additionally, communication between robots is typically\nintermittent, necessitating robust strategies that leverage communication\nopportunities to maintain coordination and achieve mission objectives. In this\nwork, we present a first-of-its-kind system where an unmanned aerial vehicle\n(UAV) and an unmanned ground vehicle (UGV) are able to collaboratively\naccomplish missions specified in natural language while reacting to changes in\nspecification on the fly. We leverage a Large Language Model (LLM)-enabled\nplanner to reason over semantic-metric maps that are built online and\nopportunistically shared between an aerial and a ground robot. We consider\ntask-driven navigation in urban and rural areas. Our system must infer\nmission-relevant semantics and actively acquire information via semantic\nmapping. In both ground and air-ground teaming experiments, we demonstrate our\nsystem on seven different natural-language specifications at up to\nkilometer-scale navigation.", "authors": ["Fernando Cladera", "Zachary Ravichandran", "Jason Hughes", "Varun Murali", "Carlos Nieto-Granda", "M. Ani Hsieh", "George J. Pappas", "Camillo J. Taylor", "Vijay Kumar"], "category": "cs.AI", "updated": "2025-05-14T03:33:46Z"}
{"id": "2505.09114v1", "title": "Beyond the Known: Decision Making with Counterfactual Reasoning Decision Transformer", "link": "http://arxiv.org/abs/2505.09114v1", "summary": "Decision Transformers (DT) play a crucial role in modern reinforcement\nlearning, leveraging offline datasets to achieve impressive results across\nvarious domains. However, DT requires high-quality, comprehensive data to\nperform optimally. In real-world applications, the lack of training data and\nthe scarcity of optimal behaviours make training on offline datasets\nchallenging, as suboptimal data can hinder performance. To address this, we\npropose the Counterfactual Reasoning Decision Transformer (CRDT), a novel\nframework inspired by counterfactual reasoning. CRDT enhances DT ability to\nreason beyond known data by generating and utilizing counterfactual\nexperiences, enabling improved decision-making in unseen scenarios. Experiments\nacross Atari and D4RL benchmarks, including scenarios with limited data and\naltered dynamics, demonstrate that CRDT outperforms conventional DT approaches.\nAdditionally, reasoning counterfactually allows the DT agent to obtain\nstitching abilities, combining suboptimal trajectories, without architectural\nmodifications. These results highlight the potential of counterfactual\nreasoning to enhance reinforcement learning agents' performance and\ngeneralization capabilities.", "authors": ["Minh Hoang Nguyen", "Linh Le Pham Van", "Thommen George Karimpanal", "Sunil Gupta", "Hung Le"], "category": "cs.LG", "updated": "2025-05-14T03:45:16Z"}
{"id": "2505.09115v1", "title": "PreCare: Designing AI Assistants for Advance Care Planning (ACP) to Enhance Personal Value Exploration, Patient Knowledge, and Decisional Confidence", "link": "http://arxiv.org/abs/2505.09115v1", "summary": "Advance Care Planning (ACP) allows individuals to specify their preferred\nend-of-life life-sustaining treatments before they become incapacitated by\ninjury or terminal illness (e.g., coma, cancer, dementia). While online ACP\noffers high accessibility, it lacks key benefits of clinical consultations,\nincluding personalized value exploration, immediate clarification of decision\nconsequences. To bridge this gap, we conducted two formative studies: 1)\nshadowed and interviewed 3 ACP teams consisting of physicians, nurses, and\nsocial workers (18 patients total), and 2) interviewed 14 users of ACP\nwebsites. Building on these insights, we designed PreCare in collaboration with\n6 ACP professionals. PreCare is a website with 3 AI-driven assistants designed\nto guide users through exploring personal values, gaining ACP knowledge, and\nsupporting informed decision-making. A usability study (n=12) showed that\nPreCare achieved a System Usability Scale (SUS) rating of excellent. A\ncomparative evaluation (n=12) showed that PreCare's AI assistants significantly\nimproved exploration of personal values, knowledge, and decisional confidence,\nand was preferred by 92% of participants.", "authors": ["Yu Lun Hsu", "Yun-Rung Chou", "Chiao-Ju Chang", "Yu-Cheng Chang", "Zer-Wei Lee", "Rokas Gipiškis", "Rachel Li", "Chih-Yuan Shih", "Jen-Kuei Peng", "Hsien-Liang Huang", "Jaw-Shiun Tsai", "Mike Y. Chen"], "category": "cs.AI", "updated": "2025-05-14T03:53:35Z"}
{"id": "2505.09129v1", "title": "WSCIF: A Weakly-Supervised Color Intelligence Framework for Tactical Anomaly Detection in Surveillance Keyframes", "link": "http://arxiv.org/abs/2505.09129v1", "summary": "The deployment of traditional deep learning models in high-risk security\ntasks in an unlabeled, data-non-exploitable video intelligence environment\nfaces significant challenges. In this paper, we propose a lightweight anomaly\ndetection framework based on color features for surveillance video clips in a\nhigh sensitivity tactical mission, aiming to quickly identify and interpret\npotential threat events under resource-constrained and data-sensitive\nconditions. The method fuses unsupervised KMeans clustering with RGB channel\nhistogram modeling to achieve composite detection of structural anomalies and\ncolor mutation signals in key frames. The experiment takes an operation\nsurveillance video occurring in an African country as a research sample, and\nsuccessfully identifies multiple highly anomalous frames related to high-energy\nlight sources, target presence, and reflective interference under the condition\nof no access to the original data. The results show that this method can be\neffectively used for tactical assassination warning, suspicious object\nscreening and environmental drastic change monitoring with strong deployability\nand tactical interpretation value. The study emphasizes the importance of color\nfeatures as low semantic battlefield signal carriers, and its battlefield\nintelligent perception capability will be further extended by combining graph\nneural networks and temporal modeling in the future.", "authors": ["Wei Meng"], "category": "cs.AI", "updated": "2025-05-14T04:24:37Z"}
{"id": "2505.09166v1", "title": "An Initial Exploration of Default Images in Text-to-Image Generation", "link": "http://arxiv.org/abs/2505.09166v1", "summary": "In the creative practice of text-to-image generation (TTI), images are\ngenerated from text prompts. However, TTI models are trained to always yield an\noutput, even if the prompt contains unknown terms. In this case, the model may\ngenerate what we call \"default images\": images that closely resemble each other\nacross many unrelated prompts. We argue studying default images is valuable for\ndesigning better solutions for TTI and prompt engineering. In this paper, we\nprovide the first investigation into default images on Midjourney, a popular\nimage generator. We describe our systematic approach to create input prompts\ntriggering default images, and present the results of our initial experiments\nand several small-scale ablation studies. We also report on a survey study\ninvestigating how default images affect user satisfaction. Our work lays the\nfoundation for understanding default images in TTI and highlights challenges\nand future research directions.", "authors": ["Hannu Simonen", "Atte Kiviniemi", "Jonas Oppenlaender"], "category": "cs.AI", "updated": "2025-05-14T05:59:23Z"}
{"id": "2505.09168v1", "title": "DRRNet: Macro-Micro Feature Fusion and Dual Reverse Refinement for Camouflaged Object Detection", "link": "http://arxiv.org/abs/2505.09168v1", "summary": "The core challenge in Camouflage Object Detection (COD) lies in the\nindistinguishable similarity between targets and backgrounds in terms of color,\ntexture, and shape. This causes existing methods to either lose edge details\n(such as hair-like fine structures) due to over-reliance on global semantic\ninformation or be disturbed by similar backgrounds (such as vegetation\npatterns) when relying solely on local features. We propose DRRNet, a\nfour-stage architecture characterized by a \"context-detail-fusion-refinement\"\npipeline to address these issues. Specifically, we introduce an Omni-Context\nFeature Extraction Module to capture global camouflage patterns and a Local\nDetail Extraction Module to supplement microstructural information for the\nfull-scene context module. We then design a module for forming dual\nrepresentations of scene understanding and structural awareness, which fuses\npanoramic features and local features across various scales. In the decoder, we\nalso introduce a reverse refinement module that leverages spatial edge priors\nand frequency-domain noise suppression to perform a two-stage inverse\nrefinement of the output. By applying two successive rounds of inverse\nrefinement, the model effectively suppresses background interference and\nenhances the continuity of object boundaries. Experimental results demonstrate\nthat DRRNet significantly outperforms state-of-the-art methods on benchmark\ndatasets. Our code is available at https://github.com/jerrySunning/DRRNet.", "authors": ["Jianlin Sun", "Xiaolin Fang", "Juwei Guan", "Dongdong Gui", "Teqi Wang", "Tongxin Zhu"], "category": "cs.AI", "updated": "2025-05-14T06:03:53Z"}
{"id": "2505.09208v1", "title": "Educational impacts of generative artificial intelligence on learning and performance of engineering students in China", "link": "http://arxiv.org/abs/2505.09208v1", "summary": "With the rapid advancement of generative artificial intelligence(AI), its\npotential applications in higher education have attracted significant\nattention. This study investigated how 148 students from diverse engineering\ndisciplines and regions across China used generative AI, focusing on its impact\non their learning experience and the opportunities and challenges it poses in\nengineering education. Based on the surveyed data, we explored four key areas:\nthe frequency and application scenarios of AI use among engineering students,\nits impact on students' learning and performance, commonly encountered\nchallenges in using generative AI, and future prospects for its adoption in\nengineering education. The results showed that more than half of the\nparticipants reported a positive impact of generative AI on their learning\nefficiency, initiative, and creativity, with nearly half believing it also\nenhanced their independent thinking. However, despite acknowledging improved\nstudy efficiency, many felt their actual academic performance remained largely\nunchanged and expressed concerns about the accuracy and domain-specific\nreliability of generative AI. Our findings provide a first-hand insight into\nthe current benefits and challenges generative AI brings to students,\nparticularly Chinese engineering students, while offering several\nrecommendations, especially from the students' perspective, for effectively\nintegrating generative AI into engineering education.", "authors": ["Lei Fan", "Kunyang Deng", "Fangxue Liu"], "category": "cs.AI", "updated": "2025-05-14T07:52:54Z"}
{"id": "2505.09263v1", "title": "Few-Shot Anomaly-Driven Generation for Anomaly Classification and Segmentation", "link": "http://arxiv.org/abs/2505.09263v1", "summary": "Anomaly detection is a practical and challenging task due to the scarcity of\nanomaly samples in industrial inspection. Some existing anomaly detection\nmethods address this issue by synthesizing anomalies with noise or external\ndata. However, there is always a large semantic gap between synthetic and\nreal-world anomalies, resulting in weak performance in anomaly detection. To\nsolve the problem, we propose a few-shot Anomaly-driven Generation (AnoGen)\nmethod, which guides the diffusion model to generate realistic and diverse\nanomalies with only a few real anomalies, thereby benefiting training anomaly\ndetection models. Specifically, our work is divided into three stages. In the\nfirst stage, we learn the anomaly distribution based on a few given real\nanomalies and inject the learned knowledge into an embedding. In the second\nstage, we use the embedding and given bounding boxes to guide the diffusion\nmodel to generate realistic and diverse anomalies on specific objects (or\ntextures). In the final stage, we propose a weakly-supervised anomaly detection\nmethod to train a more powerful model with generated anomalies. Our method\nbuilds upon DRAEM and DesTSeg as the foundation model and conducts experiments\non the commonly used industrial anomaly detection dataset, MVTec. The\nexperiments demonstrate that our generated anomalies effectively improve the\nmodel performance of both anomaly classification and segmentation tasks\nsimultaneously, \\eg, DRAEM and DseTSeg achieved a 5.8\\% and 1.5\\% improvement\nin AU-PR metric on segmentation task, respectively. The code and generated\nanomalous data are available at https://github.com/gaobb/AnoGen.", "authors": ["Guan Gui", "Bin-Bin Gao", "Jun Liu", "Chengjie Wang", "Yunsheng Wu"], "category": "cs.AI", "updated": "2025-05-14T10:25:06Z"}
{"id": "2505.09264v1", "title": "Learning to Detect Multi-class Anomalies with Just One Normal Image Prompt", "link": "http://arxiv.org/abs/2505.09264v1", "summary": "Unsupervised reconstruction networks using self-attention transformers have\nachieved state-of-the-art performance for multi-class (unified) anomaly\ndetection with a single model. However, these self-attention reconstruction\nmodels primarily operate on target features, which may result in perfect\nreconstruction for both normal and anomaly features due to high consistency\nwith context, leading to failure in detecting anomalies. Additionally, these\nmodels often produce inaccurate anomaly segmentation due to performing\nreconstruction in a low spatial resolution latent space. To enable\nreconstruction models enjoying high efficiency while enhancing their\ngeneralization for unified anomaly detection, we propose a simple yet effective\nmethod that reconstructs normal features and restores anomaly features with\njust One Normal Image Prompt (OneNIP). In contrast to previous work, OneNIP\nallows for the first time to reconstruct or restore anomalies with just one\nnormal image prompt, effectively boosting unified anomaly detection\nperformance. Furthermore, we propose a supervised refiner that regresses\nreconstruction errors by using both real normal and synthesized anomalous\nimages, which significantly improves pixel-level anomaly segmentation. OneNIP\noutperforms previous methods on three industry anomaly detection benchmarks:\nMVTec, BTAD, and VisA. The code and pre-trained models are available at\nhttps://github.com/gaobb/OneNIP.", "authors": ["Bin-Bin Gao"], "category": "cs.AI", "updated": "2025-05-14T10:25:14Z"}
{"id": "2505.09265v1", "title": "MetaUAS: Universal Anomaly Segmentation with One-Prompt Meta-Learning", "link": "http://arxiv.org/abs/2505.09265v1", "summary": "Zero- and few-shot visual anomaly segmentation relies on powerful\nvision-language models that detect unseen anomalies using manually designed\ntextual prompts. However, visual representations are inherently independent of\nlanguage. In this paper, we explore the potential of a pure visual foundation\nmodel as an alternative to widely used vision-language models for universal\nvisual anomaly segmentation. We present a novel paradigm that unifies anomaly\nsegmentation into change segmentation. This paradigm enables us to leverage\nlarge-scale synthetic image pairs, featuring object-level and local region\nchanges, derived from existing image datasets, which are independent of target\nanomaly datasets. We propose a one-prompt Meta-learning framework for Universal\nAnomaly Segmentation (MetaUAS) that is trained on this synthetic dataset and\nthen generalizes well to segment any novel or unseen visual anomalies in the\nreal world. To handle geometrical variations between prompt and query images,\nwe propose a soft feature alignment module that bridges paired-image change\nperception and single-image semantic segmentation. This is the first work to\nachieve universal anomaly segmentation using a pure vision model without\nrelying on special anomaly detection datasets and pre-trained visual-language\nmodels. Our method effectively and efficiently segments any anomalies with only\none normal image prompt and enjoys training-free without guidance from\nlanguage. Our MetaUAS significantly outperforms previous zero-shot, few-shot,\nand even full-shot anomaly segmentation methods. The code and pre-trained\nmodels are available at https://github.com/gaobb/MetaUAS.", "authors": ["Bin-Bin Gao"], "category": "cs.AI", "updated": "2025-05-14T10:25:26Z"}
{"id": "2505.09329v1", "title": "BioVFM-21M: Benchmarking and Scaling Self-Supervised Vision Foundation Models for Biomedical Image Analysis", "link": "http://arxiv.org/abs/2505.09329v1", "summary": "Scaling up model and data size have demonstrated impressive performance\nimprovement over a wide range of tasks. Despite extensive studies on scaling\nbehaviors for general-purpose tasks, medical images exhibit substantial\ndifferences from natural data. It remains unclear the key factors in developing\nmedical vision foundation models at scale due to the absence of an extensive\nunderstanding of scaling behavior in the medical domain. In this paper, we\nexplored the scaling behavior across model sizes, training algorithms, data\nsizes, and imaging modalities in developing scalable medical vision foundation\nmodels by self-supervised learning. To support scalable pretraining, we\nintroduce BioVFM-21M, a large-scale biomedical image dataset encompassing a\nwide range of biomedical image modalities and anatomies. We observed that\nscaling up does provide benefits but varies across tasks. Additional analysis\nreveals several factors correlated with scaling benefits. Finally, we propose\nBioVFM, a large-scale medical vision foundation model pretrained on 21 million\nbiomedical images, which outperforms the previous state-of-the-art foundation\nmodels across 12 medical benchmarks. Our results highlight that while scaling\nup is beneficial for pursuing better performance, task characteristics, data\ndiversity, pretraining methods, and computational efficiency remain critical\nconsiderations for developing scalable medical foundation models.", "authors": ["Jiarun Liu", "Hong-Yu Zhou", "Weijian Huang", "Hao Yang", "Dongning Song", "Tao Tan", "Yong Liang", "Shanshan Wang"], "category": "cs.AI", "updated": "2025-05-14T12:25:41Z"}
{"id": "2505.09385v1", "title": "FedSaaS: Class-Consistency Federated Semantic Segmentation via Global Prototype Supervision and Local Adversarial Harmonization", "link": "http://arxiv.org/abs/2505.09385v1", "summary": "Federated semantic segmentation enables pixel-level classification in images\nthrough collaborative learning while maintaining data privacy. However,\nexisting research commonly overlooks the fine-grained class relationships\nwithin the semantic space when addressing heterogeneous problems, particularly\ndomain shift. This oversight results in ambiguities between class\nrepresentation. To overcome this challenge, we propose a novel federated\nsegmentation framework that strikes class consistency, termed FedSaaS.\nSpecifically, we introduce class exemplars as a criterion for both local- and\nglobal-level class representations. On the server side, the uploaded class\nexemplars are leveraged to model class prototypes, which supervise global\nbranch of clients, ensuring alignment with global-level representation. On the\nclient side, we incorporate an adversarial mechanism to harmonize contributions\nof global and local branches, leading to consistent output. Moreover,\nmultilevel contrastive losses are employed on both sides to enforce consistency\nbetween two-level representations in the same semantic space. Extensive\nexperiments on several driving scene segmentation datasets demonstrate that our\nframework outperforms state-of-the-art methods, significantly improving average\nsegmentation accuracy and effectively addressing the class-consistency\nrepresentation problem.", "authors": ["Xiaoyang Yu", "Xiaoming Wu", "Xin Wang", "Dongrun Li", "Ming Yang", "Peng Cheng"], "category": "cs.AI", "updated": "2025-05-14T13:38:30Z"}
{"id": "2505.09396v1", "title": "The Influence of Human-inspired Agentic Sophistication in LLM-driven Strategic Reasoners", "link": "http://arxiv.org/abs/2505.09396v1", "summary": "The rapid rise of large language models (LLMs) has shifted artificial\nintelligence (AI) research toward agentic systems, motivating the use of weaker\nand more flexible notions of agency. However, this shift raises key questions\nabout the extent to which LLM-based agents replicate human strategic reasoning,\nparticularly in game-theoretic settings. In this context, we examine the role\nof agentic sophistication in shaping artificial reasoners' performance by\nevaluating three agent designs: a simple game-theoretic model, an unstructured\nLLM-as-agent model, and an LLM integrated into a traditional agentic framework.\nUsing guessing games as a testbed, we benchmarked these agents against human\nparticipants across general reasoning patterns and individual role-based\nobjectives. Furthermore, we introduced obfuscated game scenarios to assess\nagents' ability to generalise beyond training distributions. Our analysis,\ncovering over 2000 reasoning samples across 25 agent configurations, shows that\nhuman-inspired cognitive structures can enhance LLM agents' alignment with\nhuman strategic behaviour. Still, the relationship between agentic design\ncomplexity and human-likeness is non-linear, highlighting a critical dependence\non underlying LLM capabilities and suggesting limits to simple architectural\naugmentation.", "authors": ["Vince Trencsenyi", "Agnieszka Mensfelt", "Kostas Stathis"], "category": "cs.AI", "updated": "2025-05-14T13:51:24Z"}
{"id": "2505.09435v1", "title": "Endo-CLIP: Progressive Self-Supervised Pre-training on Raw Colonoscopy Records", "link": "http://arxiv.org/abs/2505.09435v1", "summary": "Pre-training on image-text colonoscopy records offers substantial potential\nfor improving endoscopic image analysis, but faces challenges including\nnon-informative background images, complex medical terminology, and ambiguous\nmulti-lesion descriptions. We introduce Endo-CLIP, a novel self-supervised\nframework that enhances Contrastive Language-Image Pre-training (CLIP) for this\ndomain. Endo-CLIP's three-stage framework--cleansing, attunement, and\nunification--addresses these challenges by (1) removing background frames, (2)\nleveraging large language models to extract clinical attributes for\nfine-grained contrastive learning, and (3) employing patient-level\ncross-attention to resolve multi-polyp ambiguities. Extensive experiments\ndemonstrate that Endo-CLIP significantly outperforms state-of-the-art\npre-training methods in zero-shot and few-shot polyp detection and\nclassification, paving the way for more accurate and clinically relevant\nendoscopic analysis.", "authors": ["Yili He", "Yan Zhu", "Peiyao Fu", "Ruijie Yang", "Tianyi Chen", "Zhihua Wang", "Quanlin Li", "Pinghong Zhou", "Xian Yang", "Shuo Wang"], "category": "cs.AI", "updated": "2025-05-14T14:43:31Z"}
{"id": "2505.09438v1", "title": "Evaluating GPT- and Reasoning-based Large Language Models on Physics Olympiad Problems: Surpassing Human Performance and Implications for Educational Assessment", "link": "http://arxiv.org/abs/2505.09438v1", "summary": "Large language models (LLMs) are now widely accessible, reaching learners at\nall educational levels. This development has raised concerns that their use may\ncircumvent essential learning processes and compromise the integrity of\nestablished assessment formats. In physics education, where problem solving\nplays a central role in instruction and assessment, it is therefore essential\nto understand the physics-specific problem-solving capabilities of LLMs. Such\nunderstanding is key to informing responsible and pedagogically sound\napproaches to integrating LLMs into instruction and assessment. This study\ntherefore compares the problem-solving performance of a general-purpose LLM\n(GPT-4o, using varying prompting techniques) and a reasoning-optimized model\n(o1-preview) with that of participants of the German Physics Olympiad, based on\na set of well-defined Olympiad problems. In addition to evaluating the\ncorrectness of the generated solutions, the study analyzes characteristic\nstrengths and limitations of LLM-generated solutions. The findings of this\nstudy indicate that both tested LLMs (GPT-4o and o1-preview) demonstrate\nadvanced problem-solving capabilities on Olympiad-type physics problems, on\naverage outperforming the human participants. Prompting techniques had little\neffect on GPT-4o's performance, while o1-preview almost consistently\noutperformed both GPT-4o and the human benchmark. Based on these findings, the\nstudy discusses implications for the design of summative and formative\nassessment in physics education, including how to uphold assessment integrity\nand support students in critically engaging with LLMs.", "authors": ["Paul Tschisgale", "Holger Maus", "Fabian Kieser", "Ben Kroehs", "Stefan Petersen", "Peter Wulff"], "category": "cs.AI", "updated": "2025-05-14T14:46:32Z"}
{"id": "2505.09466v1", "title": "A 2D Semantic-Aware Position Encoding for Vision Transformers", "link": "http://arxiv.org/abs/2505.09466v1", "summary": "Vision transformers have demonstrated significant advantages in computer\nvision tasks due to their ability to capture long-range dependencies and\ncontextual relationships through self-attention. However, existing position\nencoding techniques, which are largely borrowed from natural language\nprocessing, fail to effectively capture semantic-aware positional relationships\nbetween image patches. Traditional approaches like absolute position encoding\nand relative position encoding primarily focus on 1D linear position\nrelationship, often neglecting the semantic similarity between distant yet\ncontextually related patches. These limitations hinder model generalization,\ntranslation equivariance, and the ability to effectively handle repetitive or\nstructured patterns in images. In this paper, we propose 2-Dimensional\nSemantic-Aware Position Encoding ($\\text{SaPE}^2$), a novel position encoding\nmethod with semantic awareness that dynamically adapts position representations\nby leveraging local content instead of fixed linear position relationship or\nspatial coordinates. Our method enhances the model's ability to generalize\nacross varying image resolutions and scales, improves translation equivariance,\nand better aggregates features for visually similar but spatially distant\npatches. By integrating $\\text{SaPE}^2$ into vision transformers, we bridge the\ngap between position encoding and perceptual similarity, thereby improving\nperformance on computer vision tasks.", "authors": ["Xi Chen", "Shiyang Zhou", "Muqi Huang", "Jiaxu Feng", "Yun Xiong", "Kun Zhou", "Biao Yang", "Yuhui Zhang", "Huishuai Bao", "Sijia Peng", "Chuan Li", "Feng Shi"], "category": "cs.AI", "updated": "2025-05-14T15:17:34Z"}
{"id": "2505.09477v1", "title": "Deploying Foundation Model-Enabled Air and Ground Robots in the Field: Challenges and Opportunities", "link": "http://arxiv.org/abs/2505.09477v1", "summary": "The integration of foundation models (FMs) into robotics has enabled robots\nto understand natural language and reason about the semantics in their\nenvironments. However, existing FM-enabled robots primary operate in\nclosed-world settings, where the robot is given a full prior map or has a full\nview of its workspace. This paper addresses the deployment of FM-enabled robots\nin the field, where missions often require a robot to operate in large-scale\nand unstructured environments. To effectively accomplish these missions, robots\nmust actively explore their environments, navigate obstacle-cluttered terrain,\nhandle unexpected sensor inputs, and operate with compute constraints. We\ndiscuss recent deployments of SPINE, our LLM-enabled autonomy framework, in\nfield robotic settings. To the best of our knowledge, we present the first\ndemonstration of large-scale LLM-enabled robot planning in unstructured\nenvironments with several kilometers of missions. SPINE is agnostic to a\nparticular LLM, which allows us to distill small language models capable of\nrunning onboard size, weight and power (SWaP) limited platforms. Via\npreliminary model distillation work, we then present the first language-driven\nUAV planner using on-device language models. We conclude our paper by proposing\nseveral promising directions for future research.", "authors": ["Zachary Ravichandran", "Fernando Cladera", "Jason Hughes", "Varun Murali", "M. Ani Hsieh", "George J. Pappas", "Camillo J. Taylor", "Vijay Kumar"], "category": "cs.AI", "updated": "2025-05-14T15:28:43Z"}
{"id": "2505.09486v1", "title": "Preserving Plasticity in Continual Learning with Adaptive Linearity Injection", "link": "http://arxiv.org/abs/2505.09486v1", "summary": "Loss of plasticity in deep neural networks is the gradual reduction in a\nmodel's capacity to incrementally learn and has been identified as a key\nobstacle to learning in non-stationary problem settings. Recent work has shown\nthat deep linear networks tend to be resilient towards loss of plasticity.\nMotivated by this observation, we propose Adaptive Linearization (AdaLin), a\ngeneral approach that dynamically adapts each neuron's activation function to\nmitigate plasticity loss. Unlike prior methods that rely on regularization or\nperiodic resets, AdaLin equips every neuron with a learnable parameter and a\ngating mechanism that injects linearity into the activation function based on\nits gradient flow. This adaptive modulation ensures sufficient gradient signal\nand sustains continual learning without introducing additional hyperparameters\nor requiring explicit task boundaries. When used with conventional activation\nfunctions like ReLU, Tanh, and GeLU, we demonstrate that AdaLin can\nsignificantly improve performance on standard benchmarks, including Random\nLabel and Permuted MNIST, Random Label and Shuffled CIFAR-10, and Class-Split\nCIFAR-100. Furthermore, its efficacy is shown in more complex scenarios, such\nas class-incremental learning on CIFAR-100 with a ResNet-18 backbone, and in\nmitigating plasticity loss in off-policy reinforcement learning agents. We\nperform a systematic set of ablations that show that neuron-level adaptation is\ncrucial for good performance and analyze a number of metrics in the network\nthat might be correlated to loss of plasticity.", "authors": ["Seyed Roozbeh Razavi Rohani", "Khashayar Khajavi", "Wesley Chung", "Mo Chen", "Sharan Vaswani"], "category": "cs.LG", "updated": "2025-05-14T15:36:51Z"}
{"id": "2505.09498v1", "title": "Flash-VL 2B: Optimizing Vision-Language Model Performance for Ultra-Low Latency and High Throughput", "link": "http://arxiv.org/abs/2505.09498v1", "summary": "In this paper, we introduce Flash-VL 2B, a novel approach to optimizing\nVision-Language Models (VLMs) for real-time applications, targeting ultra-low\nlatency and high throughput without sacrificing accuracy. Leveraging advanced\narchitectural enhancements and efficient computational strategies, Flash-VL 2B\nis designed to maximize throughput by reducing processing time while\nmaintaining competitive performance across multiple vision-language benchmarks.\nOur approach includes tailored architectural choices, token compression\nmechanisms, data curation, training schemes, and a novel image processing\ntechnique called implicit semantic stitching that effectively balances\ncomputational load and model performance. Through extensive evaluations on 11\nstandard VLM benchmarks, we demonstrate that Flash-VL 2B achieves\nstate-of-the-art results in both speed and accuracy, making it a promising\nsolution for deployment in resource-constrained environments and large-scale\nreal-time applications.", "authors": ["Bo Zhang", "Shuo Li", "Runhe Tian", "Yang Yang", "Jixin Tang", "Jinhao Zhou", "Lin Ma"], "category": "cs.AI", "updated": "2025-05-14T15:45:17Z"}
{"id": "2505.09518v1", "title": "\\textsc{rfPG}: Robust Finite-Memory Policy Gradients for Hidden-Model POMDPs", "link": "http://arxiv.org/abs/2505.09518v1", "summary": "Partially observable Markov decision processes (POMDPs) model specific\nenvironments in sequential decision-making under uncertainty. Critically,\noptimal policies for POMDPs may not be robust against perturbations in the\nenvironment. Hidden-model POMDPs (HM-POMDPs) capture sets of different\nenvironment models, that is, POMDPs with a shared action and observation space.\nThe intuition is that the true model is hidden among a set of potential models,\nand it is unknown which model will be the environment at execution time. A\npolicy is robust for a given HM-POMDP if it achieves sufficient performance for\neach of its POMDPs. We compute such robust policies by combining two orthogonal\ntechniques: (1) a deductive formal verification technique that supports\ntractable robust policy evaluation by computing a worst-case POMDP within the\nHM-POMDP and (2) subgradient ascent to optimize the candidate policy for a\nworst-case POMDP. The empirical evaluation shows that, compared to various\nbaselines, our approach (1) produces policies that are more robust and\ngeneralize better to unseen POMDPs and (2) scales to HM-POMDPs that consist of\nover a hundred thousand environments.", "authors": ["Maris F. L. Galesloot", "Roman Andriushchenko", "Milan Češka", "Sebastian Junges", "Nils Jansen"], "category": "cs.LG", "updated": "2025-05-14T16:15:58Z"}
{"id": "2505.09568v1", "title": "BLIP3-o: A Family of Fully Open Unified Multimodal Models-Architecture, Training and Dataset", "link": "http://arxiv.org/abs/2505.09568v1", "summary": "Unifying image understanding and generation has gained growing attention in\nrecent research on multimodal models. Although design choices for image\nunderstanding have been extensively studied, the optimal model architecture and\ntraining recipe for a unified framework with image generation remain\nunderexplored. Motivated by the strong potential of autoregressive and\ndiffusion models for high-quality generation and scalability, we conduct a\ncomprehensive study of their use in unified multimodal settings, with emphasis\non image representations, modeling objectives, and training strategies.\nGrounded in these investigations, we introduce a novel approach that employs a\ndiffusion transformer to generate semantically rich CLIP image features, in\ncontrast to conventional VAE-based representations. This design yields both\nhigher training efficiency and improved generative quality. Furthermore, we\ndemonstrate that a sequential pretraining strategy for unified models-first\ntraining on image understanding and subsequently on image generation-offers\npractical advantages by preserving image understanding capability while\ndeveloping strong image generation ability. Finally, we carefully curate a\nhigh-quality instruction-tuning dataset BLIP3o-60k for image generation by\nprompting GPT-4o with a diverse set of captions covering various scenes,\nobjects, human gestures, and more. Building on our innovative model design,\ntraining recipe, and datasets, we develop BLIP3-o, a suite of state-of-the-art\nunified multimodal models. BLIP3-o achieves superior performance across most of\nthe popular benchmarks spanning both image understanding and generation tasks.\nTo facilitate future research, we fully open-source our models, including code,\nmodel weights, training scripts, and pretraining and instruction tuning\ndatasets.", "authors": ["Jiuhai Chen", "Zhiyang Xu", "Xichen Pan", "Yushi Hu", "Can Qin", "Tom Goldstein", "Lifu Huang", "Tianyi Zhou", "Saining Xie", "Silvio Savarese", "Le Xue", "Caiming Xiong", "Ran Xu"], "category": "cs.AI", "updated": "2025-05-14T17:11:07Z"}
{"id": "2505.09576v1", "title": "Ethics and Persuasion in Reinforcement Learning from Human Feedback: A Procedural Rhetorical Approach", "link": "http://arxiv.org/abs/2505.09576v1", "summary": "Since 2022, versions of generative AI chatbots such as ChatGPT and Claude\nhave been trained using a specialized technique called Reinforcement Learning\nfrom Human Feedback (RLHF) to fine-tune language model output using feedback\nfrom human annotators. As a result, the integration of RLHF has greatly\nenhanced the outputs of these large language models (LLMs) and made the\ninteractions and responses appear more \"human-like\" than those of previous\nversions using only supervised learning. The increasing convergence of human\nand machine-written text has potentially severe ethical, sociotechnical, and\npedagogical implications relating to transparency, trust, bias, and\ninterpersonal relations. To highlight these implications, this paper presents a\nrhetorical analysis of some of the central procedures and processes currently\nbeing reshaped by RLHF-enhanced generative AI chatbots: upholding language\nconventions, information seeking practices, and expectations for social\nrelationships. Rhetorical investigations of generative AI and LLMs have, to\nthis point, focused largely on the persuasiveness of the content generated.\nUsing Ian Bogost's concept of procedural rhetoric, this paper shifts the site\nof rhetorical investigation from content analysis to the underlying mechanisms\nof persuasion built into RLHF-enhanced LLMs. In doing so, this theoretical\ninvestigation opens a new direction for further inquiry in AI ethics that\nconsiders how procedures rerouted through AI-driven technologies might\nreinforce hegemonic language use, perpetuate biases, decontextualize learning,\nand encroach upon human relationships. It will therefore be of interest to\neducators, researchers, scholars, and the growing number of users of generative\nAI chatbots.", "authors": ["Shannon Lodoen", "Alexi Orchard"], "category": "cs.AI", "updated": "2025-05-14T17:29:19Z"}
{"id": "2505.09591v1", "title": "Variational Visual Question Answering", "link": "http://arxiv.org/abs/2505.09591v1", "summary": "Despite remarkable progress in multimodal models for Visual Question\nAnswering (VQA), there remain major reliability concerns because the models can\noften be overconfident and miscalibrated, especially in out-of-distribution\n(OOD) settings. Plenty has been done to address such issues for unimodal\nmodels, but little work exists for multimodal cases. Here, we address\nunreliability in multimodal models by proposing a Variational VQA approach.\nSpecifically, instead of fine-tuning vision-language models by using AdamW, we\nemploy a recently proposed variational algorithm called IVON, which yields a\nposterior distribution over model parameters. Through extensive experiments, we\nshow that our approach improves calibration and abstentions without sacrificing\nthe accuracy of AdamW. For instance, compared to AdamW fine-tuning, we reduce\nExpected Calibration Error by more than 50% compared to the AdamW baseline and\nraise Coverage by 4% vs. SOTA (for a fixed risk of 1%). In the presence of\ndistribution shifts, the performance gain is even higher, achieving 8% Coverage\n(@ 1% risk) improvement vs. SOTA when 50% of test cases are OOD. Overall, we\npresent variational learning as a viable option to enhance the reliability of\nmultimodal models.", "authors": ["Tobias Jan Wieczorek", "Nathalie Daun", "Mohammad Emtiyaz Khan", "Marcus Rohrbach"], "category": "cs.AI", "updated": "2025-05-14T17:40:22Z"}
{"id": "2505.09598v1", "title": "How Hungry is AI? Benchmarking Energy, Water, and Carbon Footprint of LLM Inference", "link": "http://arxiv.org/abs/2505.09598v1", "summary": "As large language models (LLMs) spread across industries, understanding their\nenvironmental footprint at the inference level is no longer optional; it is\nessential. However, most existing studies exclude proprietary models, overlook\ninfrastructural variability and overhead, or focus solely on training, even as\ninference increasingly dominates AI's environmental impact. To bridge this gap,\nthis paper introduces a novel infrastructure-aware benchmarking framework for\nquantifying the environmental footprint of LLM inference across 30\nstate-of-the-art models as deployed in commercial data centers. Our framework\ncombines public API performance data with region-specific environmental\nmultipliers and statistical inference of hardware configurations. We\nadditionally utilize cross-efficiency Data Envelopment Analysis (DEA) to rank\nmodels by performance relative to environmental cost. Our results show that o3\nand DeepSeek-R1 emerge as the most energy-intensive models, consuming over 33\nWh per long prompt, more than 70 times the consumption of GPT-4.1 nano, and\nthat Claude-3.7 Sonnet ranks highest in eco-efficiency. While a single short\nGPT-4o query consumes 0.43 Wh, scaling this to 700 million queries/day results\nin substantial annual environmental impacts. These include electricity use\ncomparable to 35,000 U.S. homes, freshwater evaporation matching the annual\ndrinking needs of 1.2 million people, and carbon emissions requiring a\nChicago-sized forest to offset. These findings illustrate a growing paradox:\nalthough individual queries are efficient, their global scale drives\ndisproportionate resource consumption. Our study provides a standardized,\nempirically grounded methodology for benchmarking the sustainability of LLM\ndeployments, laying a foundation for future environmental accountability in AI\ndevelopment and sustainability standards.", "authors": ["Nidhal Jegham", "Marwen Abdelatti", "Lassad Elmoubarki", "Abdeltawab Hendawi"], "category": "cs.AI", "updated": "2025-05-14T17:47:00Z"}
{"id": "2505.09614v1", "title": "Language Agents Mirror Human Causal Reasoning Biases. How Can We Help Them Think Like Scientists?", "link": "http://arxiv.org/abs/2505.09614v1", "summary": "Language model (LM) agents are increasingly used as autonomous\ndecision-makers who need to actively gather information to guide their\ndecisions. A crucial cognitive skill for such agents is the efficient\nexploration and understanding of the causal structure of the world -- key to\nrobust, scientifically grounded reasoning. Yet, it remains unclear whether LMs\npossess this capability or exhibit systematic biases leading to erroneous\nconclusions. In this work, we examine LMs' ability to explore and infer causal\nrelationships, using the well-established \"Blicket Test\" paradigm from\ndevelopmental psychology. We find that LMs reliably infer the common, intuitive\ndisjunctive causal relationships but systematically struggle with the unusual,\nyet equally (or sometimes even more) evidenced conjunctive ones. This\n\"disjunctive bias\" persists across model families, sizes, and prompting\nstrategies, and performance further declines as task complexity increases.\nInterestingly, an analogous bias appears in human adults, suggesting that LMs\nmay have inherited deep-seated reasoning heuristics from their training data.\nTo this end, we quantify similarities between LMs and humans, finding that LMs\nexhibit adult-like inference profiles (but not children-like). Finally, we\npropose a test-time sampling method which explicitly samples and eliminates\nhypotheses about causal relationships from the LM. This scalable approach\nsignificantly reduces the disjunctive bias and moves LMs closer to the goal of\nscientific, causally rigorous reasoning.", "authors": ["Anthony GX-Chen", "Dongyan Lin", "Mandana Samiei", "Doina Precup", "Blake A. Richards", "Rob Fergus", "Kenneth Marino"], "category": "cs.CL", "updated": "2025-05-14T17:59:35Z"}
{"id": "2505.09062v1", "title": "Variational Prefix Tuning for Diverse and Accurate Code Summarization Using Pre-trained Language Models", "link": "http://arxiv.org/abs/2505.09062v1", "summary": "Recent advancements in source code summarization have leveraged\ntransformer-based pre-trained models, including Large Language Models of Code\n(LLMCs), to automate and improve the generation of code summaries. However,\nexisting methods often focus on generating a single high-quality summary for a\ngiven source code, neglecting scenarios where the generated summary might be\ninadequate and alternative options are needed. In this paper, we introduce\nVariational Prefix Tuning (VPT), a novel approach that enhances pre-trained\nmodels' ability to generate diverse yet accurate sets of summaries, allowing\nthe user to choose the most suitable one for the given source code. Our method\nintegrates a Conditional Variational Autoencoder (CVAE) framework as a modular\ncomponent into pre-trained models, enabling us to model the distribution of\nobserved target summaries and sample continuous embeddings to be used as\nprefixes to steer the generation of diverse outputs during decoding.\nImportantly, we construct our method in a parameter-efficient manner,\neliminating the need for expensive model retraining, especially when using\nLLMCs. Furthermore, we employ a bi-criteria reranking method to select a subset\nof generated summaries, optimizing both the diversity and the accuracy of the\noptions presented to users. We present extensive experimental evaluations using\nwidely used datasets and current state-of-the-art pre-trained code\nsummarization models to demonstrate the effectiveness of our approach and its\nadaptability across models.", "authors": ["Junda Zhao", "Yuliang Song", "Eldan Cohen"], "category": "cs.LG", "updated": "2025-05-14T01:46:56Z"}
{"id": "2505.09081v1", "title": "SALM: A Multi-Agent Framework for Language Model-Driven Social Network Simulation", "link": "http://arxiv.org/abs/2505.09081v1", "summary": "Contemporary approaches to agent-based modeling (ABM) of social systems have\ntraditionally emphasized rule-based behaviors, limiting their ability to\ncapture nuanced dynamics by moving beyond predefined rules and leveraging\ncontextual understanding from LMs of human social interaction. This paper\npresents SALM (Social Agent LM Framework), a novel approach for integrating\nlanguage models (LMs) into social network simulation that achieves\nunprecedented temporal stability in multi-agent scenarios. Our primary\ncontributions include: (1) a hierarchical prompting architecture enabling\nstable simulation beyond 4,000 timesteps while reducing token usage by 73%, (2)\nan attention-based memory system achieving 80% cache hit rates (95% CI [78%,\n82%]) with sub-linear memory growth of 9.5%, and (3) formal bounds on\npersonality stability. Through extensive validation against SNAP ego networks,\nwe demonstrate the first LLM-based framework capable of modeling long-term\nsocial phenomena while maintaining empirically validated behavioral fidelity.", "authors": ["Gaurav Koley"], "category": "cs.AI", "updated": "2025-05-14T02:29:46Z"}
{"id": "2505.09131v1", "title": "Fair Clustering via Alignment", "link": "http://arxiv.org/abs/2505.09131v1", "summary": "Algorithmic fairness in clustering aims to balance the proportions of\ninstances assigned to each cluster with respect to a given sensitive attribute.\nWhile recently developed fair clustering algorithms optimize clustering\nobjectives under specific fairness constraints, their inherent complexity or\napproximation often results in suboptimal clustering utility or numerical\ninstability in practice. To resolve these limitations, we propose a new fair\nclustering algorithm based on a novel decomposition of the fair K-means\nclustering objective function. The proposed algorithm, called Fair Clustering\nvia Alignment (FCA), operates by alternately (i) finding a joint probability\ndistribution to align the data from different protected groups, and (ii)\noptimizing cluster centers in the aligned space. A key advantage of FCA is that\nit theoretically guarantees approximately optimal clustering utility for any\ngiven fairness level without complex constraints, thereby enabling high-utility\nfair clustering in practice. Experiments show that FCA outperforms existing\nmethods by (i) attaining a superior trade-off between fairness level and\nclustering utility, and (ii) achieving near-perfect fairness without numerical\ninstability.", "authors": ["Kunwoong Kim", "Jihu Lee", "Sangchul Park", "Yongdai Kim"], "category": "cs.LG", "updated": "2025-05-14T04:29:09Z"}
{"id": "2505.09142v1", "title": "ELIS: Efficient LLM Iterative Scheduling System with Response Length Predictor", "link": "http://arxiv.org/abs/2505.09142v1", "summary": "We propose ELIS, a serving system for Large Language Models (LLMs) featuring\nan Iterative Shortest Remaining Time First (ISRTF) scheduler designed to\nefficiently manage inference tasks with the shortest remaining tokens. Current\nLLM serving systems often employ a first-come-first-served scheduling strategy,\nwhich can lead to the \"head-of-line blocking\" problem. To overcome this\nlimitation, it is necessary to predict LLM inference times and apply a shortest\njob first scheduling strategy. However, due to the auto-regressive nature of\nLLMs, predicting the inference latency is challenging. ELIS addresses this\nchallenge by training a response length predictor for LLMs using the BGE model,\nan encoder-based state-of-the-art model. Additionally, we have devised the\nISRTF scheduling strategy, an optimization of shortest remaining time first\ntailored to existing LLM iteration batching. To evaluate our work in an\nindustrial setting, we simulate streams of requests based on our study of\nreal-world user LLM serving trace records. Furthermore, we implemented ELIS as\na cloud-native scheduler system on Kubernetes to evaluate its performance in\nproduction environments. Our experimental results demonstrate that ISRTF\nreduces the average job completion time by up to 19.6%.", "authors": ["Seungbeom Choi", "Jeonghoe Goo", "Eunjoo Jeon", "Mingyu Yang", "Minsung Jang"], "category": "cs.LG", "updated": "2025-05-14T04:50:00Z"}
{"id": "2505.09160v1", "title": "A Multi-Task Foundation Model for Wireless Channel Representation Using Contrastive and Masked Autoencoder Learning", "link": "http://arxiv.org/abs/2505.09160v1", "summary": "Current applications of self-supervised learning to wireless channel\nrepresentation often borrow paradigms developed for text and image processing,\nwithout fully addressing the unique characteristics and constraints of wireless\ncommunications. Aiming to fill this gap, we first propose WiMAE (Wireless\nMasked Autoencoder), a transformer-based encoder-decoder foundation model\npretrained on a realistic open-source multi-antenna wireless channel dataset.\nBuilding upon this foundation, we develop ContraWiMAE, which enhances WiMAE by\nincorporating a contrastive learning objective alongside the reconstruction\ntask in a unified multi-task framework. By warm-starting from pretrained WiMAE\nweights and generating positive pairs via noise injection, the contrastive\ncomponent enables the model to capture both structural and discriminative\nfeatures, enhancing representation quality beyond what reconstruction alone can\nachieve. Through extensive evaluation on unseen scenarios, we demonstrate the\neffectiveness of both approaches across multiple downstream tasks, with\nContraWiMAE showing further improvements in linear separability and\nadaptability in diverse wireless environments. Comparative evaluations against\na state-of-the-art wireless channel foundation model confirm the superior\nperformance and data efficiency of our models, highlighting their potential as\npowerful baselines for future research in self-supervised wireless channel\nrepresentation learning.", "authors": ["Berkay Guler", "Giovanni Geraci", "Hamid Jafarkhani"], "category": "cs.LG", "updated": "2025-05-14T05:45:22Z"}
{"id": "2505.09246v1", "title": "Focus, Merge, Rank: Improved Question Answering Based on Semi-structured Knowledge Bases", "link": "http://arxiv.org/abs/2505.09246v1", "summary": "In many real-world settings, machine learning models and interactive systems\nhave access to both structured knowledge, e.g., knowledge graphs or tables, and\nunstructured content, e.g., natural language documents. However, most rely on\neither. Semi-Structured Knowledge Bases (SKBs) bridge this gap by linking\nunstructured content to nodes within structured data, thereby enabling new\nstrategies for knowledge access and use. In this work, we present\nFocusedRetriever, a modular SKB-based framework for multi-hop question\nanswering. It integrates components (VSS-based entity search, LLM-based\ngeneration of Cypher queries and pairwise re-ranking) in a way that enables it\nto outperform state-of-the-art methods across all three STaRK benchmark test\nsets, covering diverse domains and multiple performance metrics. The average\nfirst-hit rate exceeds that of the second-best method by 25.7%.\nFocusedRetriever leverages (1) the capacity of Large Language Models (LLMs) to\nextract relational facts and entity attributes from unstructured text, (2) node\nset joins to filter answer candidates based on these extracted triplets and\nconstraints, (3) vector similarity search to retrieve and rank relevant\nunstructured content, and (4) the contextual capabilities of LLMs to finally\nrank the top-k answers. For generality, we only incorporate base LLMs in\nFocusedRetriever in our evaluation. However, our analysis of intermediate\nresults highlights several opportunities for further upgrades including\nfinetuning. The source code is publicly available at\nhttps://github.com/kramerlab/FocusedRetriever .", "authors": ["Derian Boer", "Stephen Roth", "Stefan Kramer"], "category": "cs.CL", "updated": "2025-05-14T09:35:56Z"}
{"id": "2505.09295v1", "title": "Toward Fair Federated Learning under Demographic Disparities and Data Imbalance", "link": "http://arxiv.org/abs/2505.09295v1", "summary": "Ensuring fairness is critical when applying artificial intelligence to\nhigh-stakes domains such as healthcare, where predictive models trained on\nimbalanced and demographically skewed data risk exacerbating existing\ndisparities. Federated learning (FL) enables privacy-preserving collaboration\nacross institutions, but remains vulnerable to both algorithmic bias and\nsubgroup imbalance - particularly when multiple sensitive attributes intersect.\nWe propose FedIDA (Fed erated Learning for Imbalance and D isparity A\nwareness), a framework-agnostic method that combines fairness-aware\nregularization with group-conditional oversampling. FedIDA supports multiple\nsensitive attributes and heterogeneous data distributions without altering the\nconvergence behavior of the underlying FL algorithm. We provide theoretical\nanalysis establishing fairness improvement bounds using Lipschitz continuity\nand concentration inequalities, and show that FedIDA reduces the variance of\nfairness metrics across test sets. Empirical results on both benchmark and\nreal-world clinical datasets confirm that FedIDA consistently improves fairness\nwhile maintaining competitive predictive performance, demonstrating its\neffectiveness for equitable and privacy-preserving modeling in healthcare. The\nsource code is available on GitHub.", "authors": ["Qiming Wu", "Siqi Li", "Doudou Zhou", "Nan Liu"], "category": "cs.LG", "updated": "2025-05-14T11:22:54Z"}
{"id": "2505.09324v1", "title": "Neural Video Compression using 2D Gaussian Splatting", "link": "http://arxiv.org/abs/2505.09324v1", "summary": "The computer vision and image processing research community has been involved\nin standardizing video data communications for the past many decades, leading\nto standards such as AVC, HEVC, VVC, AV1, AV2, etc. However, recent\ngroundbreaking works have focused on employing deep learning-based techniques\nto replace the traditional video codec pipeline to a greater affect. Neural\nvideo codecs (NVC) create an end-to-end ML-based solution that does not rely on\nany handcrafted features (motion or edge-based) and have the ability to learn\ncontent-aware compression strategies, offering better adaptability and higher\ncompression efficiency than traditional methods. This holds a great potential\nnot only for hardware design, but also for various video streaming platforms\nand applications, especially video conferencing applications such as MS-Teams\nor Zoom that have found extensive usage in classrooms and workplaces. However,\ntheir high computational demands currently limit their use in real-time\napplications like video conferencing. To address this, we propose a\nregion-of-interest (ROI) based neural video compression model that leverages 2D\nGaussian Splatting. Unlike traditional codecs, 2D Gaussian Splatting is capable\nof real-time decoding and can be optimized using fewer data points, requiring\nonly thousands of Gaussians for decent quality outputs as opposed to millions\nin 3D scenes. In this work, we designed a video pipeline that speeds up the\nencoding time of the previous Gaussian splatting-based image codec by 88% by\nusing a content-aware initialization strategy paired with a novel Gaussian\ninter-frame redundancy-reduction mechanism, enabling Gaussian splatting to be\nused for a video-codec solution, the first of its kind solution in this neural\nvideo codec space.", "authors": ["Lakshya Gupta", "Imran N. Junejo"], "category": "cs.LG", "updated": "2025-05-14T12:23:53Z"}
{"id": "2505.09342v1", "title": "Evaluating the Robustness of Adversarial Defenses in Malware Detection Systems", "link": "http://arxiv.org/abs/2505.09342v1", "summary": "Machine learning is a key tool for Android malware detection, effectively\nidentifying malicious patterns in apps. However, ML-based detectors are\nvulnerable to evasion attacks, where small, crafted changes bypass detection.\nDespite progress in adversarial defenses, the lack of comprehensive evaluation\nframeworks in binary-constrained domains limits understanding of their\nrobustness. We introduce two key contributions. First, Prioritized Binary\nRounding, a technique to convert continuous perturbations into binary feature\nspaces while preserving high attack success and low perturbation size. Second,\nthe sigma-binary attack, a novel adversarial method for binary domains,\ndesigned to achieve attack goals with minimal feature changes. Experiments on\nthe Malscan dataset show that sigma-binary outperforms existing attacks and\nexposes key vulnerabilities in state-of-the-art defenses. Defenses equipped\nwith adversary detectors, such as KDE, DLA, DNN+, and ICNN, exhibit significant\nbrittleness, with attack success rates exceeding 90% using fewer than 10\nfeature modifications and reaching 100% with just 20. Adversarially trained\ndefenses, including AT-rFGSM-k, AT-MaxMA, improves robustness under small\nbudgets but remains vulnerable to unrestricted perturbations, with attack\nsuccess rates of 99.45% and 96.62%, respectively. Although PAD-SMA demonstrates\nstrong robustness against state-of-the-art gradient-based adversarial attacks\nby maintaining an attack success rate below 16.55%, the sigma-binary attack\nsignificantly outperforms these methods, achieving a 94.56% success rate under\nunrestricted perturbations. These findings highlight the critical need for\nprecise method like sigma-binary to expose hidden vulnerabilities in existing\ndefenses and support the development of more resilient malware detection\nsystems.", "authors": ["Mostafa Jafari", "Alireza Shameli-Sendi"], "category": "cs.LG", "updated": "2025-05-14T12:38:43Z"}
{"id": "2505.09343v1", "title": "Insights into DeepSeek-V3: Scaling Challenges and Reflections on Hardware for AI Architectures", "link": "http://arxiv.org/abs/2505.09343v1", "summary": "The rapid scaling of large language models (LLMs) has unveiled critical\nlimitations in current hardware architectures, including constraints in memory\ncapacity, computational efficiency, and interconnection bandwidth. DeepSeek-V3,\ntrained on 2,048 NVIDIA H800 GPUs, demonstrates how hardware-aware model\nco-design can effectively address these challenges, enabling cost-efficient\ntraining and inference at scale. This paper presents an in-depth analysis of\nthe DeepSeek-V3/R1 model architecture and its AI infrastructure, highlighting\nkey innovations such as Multi-head Latent Attention (MLA) for enhanced memory\nefficiency, Mixture of Experts (MoE) architectures for optimized\ncomputation-communication trade-offs, FP8 mixed-precision training to unlock\nthe full potential of hardware capabilities, and a Multi-Plane Network Topology\nto minimize cluster-level network overhead. Building on the hardware\nbottlenecks encountered during DeepSeek-V3's development, we engage in a\nbroader discussion with academic and industry peers on potential future\nhardware directions, including precise low-precision computation units,\nscale-up and scale-out convergence, and innovations in low-latency\ncommunication fabrics. These insights underscore the critical role of hardware\nand model co-design in meeting the escalating demands of AI workloads, offering\na practical blueprint for innovation in next-generation AI systems.", "authors": ["Chenggang Zhao", "Chengqi Deng", "Chong Ruan", "Damai Dai", "Huazuo Gao", "Jiashi Li", "Liyue Zhang", "Panpan Huang", "Shangyan Zhou", "Shirong Ma", "Wenfeng Liang", "Ying He", "Yuqing Wang", "Yuxuan Liu", "Y. X. Wei"], "category": "cs.AI", "updated": "2025-05-14T12:39:03Z"}
{"id": "2505.09344v1", "title": "GreenFactory: Ensembling Zero-Cost Proxies to Estimate Performance of Neural Networks", "link": "http://arxiv.org/abs/2505.09344v1", "summary": "Determining the performance of a Deep Neural Network during Neural\nArchitecture Search processes is essential for identifying optimal\narchitectures and hyperparameters. Traditionally, this process requires\ntraining and evaluation of each network, which is time-consuming and\nresource-intensive. Zero-cost proxies estimate performance without training,\nserving as an alternative to traditional training. However, recent proxies\noften lack generalization across diverse scenarios and provide only relative\nrankings rather than predicted accuracies. To address these limitations, we\npropose GreenFactory, an ensemble of zero-cost proxies that leverages a random\nforest regressor to combine multiple predictors' strengths and directly predict\nmodel test accuracy. We evaluate GreenFactory on NATS-Bench, achieving robust\nresults across multiple datasets. Specifically, GreenFactory achieves high\nKendall correlations on NATS-Bench-SSS, indicating substantial agreement\nbetween its predicted scores and actual performance: 0.907 for CIFAR-10, 0.945\nfor CIFAR-100, and 0.920 for ImageNet-16-120. Similarly, on NATS-Bench-TSS, we\nachieve correlations of 0.921 for CIFAR-10, 0.929 for CIFAR-100, and 0.908 for\nImageNet-16-120, showcasing its reliability in both search spaces.", "authors": ["Gabriel Cortês", "Nuno Lourenço", "Paolo Romano", "Penousal Machado"], "category": "cs.LG", "updated": "2025-05-14T12:40:34Z"}
{"id": "2505.09371v1", "title": "TensorRL-QAS: Reinforcement learning with tensor networks for scalable quantum architecture search", "link": "http://arxiv.org/abs/2505.09371v1", "summary": "Variational quantum algorithms hold the promise to address meaningful quantum\nproblems already on noisy intermediate-scale quantum hardware, but they face\nthe challenge of designing quantum circuits that both solve the target problem\nand comply with device limitations. Quantum architecture search (QAS) automates\nthis design process, with reinforcement learning (RL) emerging as a promising\napproach. Yet, RL-based QAS methods encounter significant scalability issues,\nas computational and training costs grow rapidly with the number of qubits,\ncircuit depth, and noise, severely impacting performance. To address these\nchallenges, we introduce $\\textit{TensorRL-QAS}$, a scalable framework that\ncombines tensor network (TN) methods with RL for designing quantum circuits. By\nwarm-starting the architecture search with a matrix product state approximation\nof the target solution, TensorRL-QAS effectively narrows the search space to\nphysically meaningful circuits, accelerating convergence to the desired\nsolution. Tested on several quantum chemistry problems of up to 12-qubit,\nTensorRL-QAS achieves up to a 10-fold reduction in CNOT count and circuit depth\ncompared to baseline methods, while maintaining or surpassing chemical\naccuracy. It reduces function evaluations by up to 100-fold, accelerates\ntraining episodes by up to $98\\%$, and achieves up to $50\\%$ success\nprobability for 10-qubit systems-far exceeding the $<1\\%$ rates of baseline\napproaches. Robustness and versatility are demonstrated both in the noiseless\nand noisy scenarios, where we report a simulation of up to 8-qubit. These\nadvancements establish TensorRL-QAS as a promising candidate for a scalable and\nefficient quantum circuit discovery protocol on near-term quantum hardware.", "authors": ["Akash Kundu", "Stefano Mangini"], "category": "cs.LG", "updated": "2025-05-14T13:23:34Z"}
{"id": "2505.09380v1", "title": "Examining Deployment and Refinement of the VIOLA-AI Intracranial Hemorrhage Model Using an Interactive NeoMedSys Platform", "link": "http://arxiv.org/abs/2505.09380v1", "summary": "Background: There are many challenges and opportunities in the clinical\ndeployment of AI tools in radiology. The current study describes a radiology\nsoftware platform called NeoMedSys that can enable efficient deployment and\nrefinements of AI models. We evaluated the feasibility and effectiveness of\nrunning NeoMedSys for three months in real-world clinical settings and focused\non improvement performance of an in-house developed AI model (VIOLA-AI)\ndesigned for intracranial hemorrhage (ICH) detection.\n  Methods: NeoMedSys integrates tools for deploying, testing, and optimizing AI\nmodels with a web-based medical image viewer, annotation system, and\nhospital-wide radiology information systems. A pragmatic investigation was\ndeployed using clinical cases of patients presenting to the largest Emergency\nDepartment in Norway (site-1) with suspected traumatic brain injury (TBI) or\npatients with suspected stroke (site-2). We assessed ICH classification\nperformance as VIOLA-AI encountered new data and underwent pre-planned model\nretraining. Performance metrics included sensitivity, specificity, accuracy,\nand the area under the receiver operating characteristic curve (AUC).\n  Results: NeoMedSys facilitated iterative improvements in the AI model,\nsignificantly enhancing its diagnostic accuracy. Automated bleed detection and\nsegmentation were reviewed in near real-time to facilitate re-training\nVIOLA-AI. The iterative refinement process yielded a marked improvement in\nclassification sensitivity, rising to 90.3% (from 79.2%), and specificity that\nreached 89.3% (from 80.7%). The bleed detection ROC analysis for the entire\nsample demonstrated a high area-under-the-curve (AUC) of 0.949 (from 0.873).\nModel refinement stages were associated with notable gains, highlighting the\nvalue of real-time radiologist feedback.", "authors": ["Qinghui Liu", "Jon Nesvold", "Hanna Raaum", "Elakkyen Murugesu", "Martin Røvang", "Bradley J Maclntosh", "Atle Bjørnerud", "Karoline Skogen"], "category": "cs.LG", "updated": "2025-05-14T13:33:38Z"}
{"id": "2505.09382v1", "title": "The Voice Timbre Attribute Detection 2025 Challenge Evaluation Plan", "link": "http://arxiv.org/abs/2505.09382v1", "summary": "Voice timbre refers to the unique quality or character of a person's voice\nthat distinguishes it from others as perceived by human hearing. The Voice\nTimbre Attribute Detection (VtaD) 2025 challenge focuses on explaining the\nvoice timbre attribute in a comparative manner. In this challenge, the human\nimpression of voice timbre is verbalized with a set of sensory descriptors,\nincluding bright, coarse, soft, magnetic, and so on. The timbre is explained\nfrom the comparison between two voices in their intensity within a specific\ndescriptor dimension. The VtaD 2025 challenge starts in May and culminates in a\nspecial proposal at the NCMMSC2025 conference in October 2025 in Zhenjiang,\nChina.", "authors": ["Zhengyan Sheng", "Jinghao He", "Liping Chen", "Kong Aik Lee", "Zhen-Hua Ling"], "category": "cs.AI", "updated": "2025-05-14T13:35:53Z"}
{"id": "2505.09393v1", "title": "UMotion: Uncertainty-driven Human Motion Estimation from Inertial and Ultra-wideband Units", "link": "http://arxiv.org/abs/2505.09393v1", "summary": "Sparse wearable inertial measurement units (IMUs) have gained popularity for\nestimating 3D human motion. However, challenges such as pose ambiguity, data\ndrift, and limited adaptability to diverse bodies persist. To address these\nissues, we propose UMotion, an uncertainty-driven, online fusing-all state\nestimation framework for 3D human shape and pose estimation, supported by six\nintegrated, body-worn ultra-wideband (UWB) distance sensors with IMUs. UWB\nsensors measure inter-node distances to infer spatial relationships, aiding in\nresolving pose ambiguities and body shape variations when combined with\nanthropometric data. Unfortunately, IMUs are prone to drift, and UWB sensors\nare affected by body occlusions. Consequently, we develop a tightly coupled\nUnscented Kalman Filter (UKF) framework that fuses uncertainties from sensor\ndata and estimated human motion based on individual body shape. The UKF\niteratively refines IMU and UWB measurements by aligning them with uncertain\nhuman motion constraints in real-time, producing optimal estimates for each.\nExperiments on both synthetic and real-world datasets demonstrate the\neffectiveness of UMotion in stabilizing sensor data and the improvement over\nstate of the art in pose accuracy.", "authors": ["Huakun Liu", "Hiroki Ota", "Xin Wei", "Yutaro Hirao", "Monica Perusquia-Hernandez", "Hideaki Uchiyama", "Kiyoshi Kiyokawa"], "category": "cs.AI", "updated": "2025-05-14T13:48:36Z"}
{"id": "2505.09395v1", "title": "Quantum-Enhanced Parameter-Efficient Learning for Typhoon Trajectory Forecasting", "link": "http://arxiv.org/abs/2505.09395v1", "summary": "Typhoon trajectory forecasting is essential for disaster preparedness but\nremains computationally demanding due to the complexity of atmospheric dynamics\nand the resource requirements of deep learning models. Quantum-Train (QT), a\nhybrid quantum-classical framework that leverages quantum neural networks\n(QNNs) to generate trainable parameters exclusively during training,\neliminating the need for quantum hardware at inference time. Building on QT's\nsuccess across multiple domains, including image classification, reinforcement\nlearning, flood prediction, and large language model (LLM) fine-tuning, we\nintroduce Quantum Parameter Adaptation (QPA) for efficient typhoon forecasting\nmodel learning. Integrated with an Attention-based Multi-ConvGRU model, QPA\nenables parameter-efficient training while maintaining predictive accuracy.\nThis work represents the first application of quantum machine learning (QML) to\nlarge-scale typhoon trajectory prediction, offering a scalable and\nenergy-efficient approach to climate modeling. Our results demonstrate that QPA\nsignificantly reduces the number of trainable parameters while preserving\nperformance, making high-performance forecasting more accessible and\nsustainable through hybrid quantum-classical learning.", "authors": ["Chen-Yu Liu", "Kuan-Cheng Chen", "Yi-Chien Chen", "Samuel Yen-Chi Chen", "Wei-Hao Huang", "Wei-Jia Huang", "Yen-Jui Chang"], "category": "cs.LG", "updated": "2025-05-14T13:50:44Z"}
{"id": "2505.09407v1", "title": "Multilingual Machine Translation with Quantum Encoder Decoder Attention-based Convolutional Variational Circuits", "link": "http://arxiv.org/abs/2505.09407v1", "summary": "Cloud-based multilingual translation services like Google Translate and\nMicrosoft Translator achieve state-of-the-art translation capabilities. These\nservices inherently use large multilingual language models such as GRU, LSTM,\nBERT, GPT, T5, or similar encoder-decoder architectures with attention\nmechanisms as the backbone. Also, new age natural language systems, for\ninstance ChatGPT and DeepSeek, have established huge potential in multiple\ntasks in natural language processing. At the same time, they also possess\noutstanding multilingual translation capabilities. However, these models use\nthe classical computing realm as a backend. QEDACVC (Quantum Encoder Decoder\nAttention-based Convolutional Variational Circuits) is an alternate solution\nthat explores the quantum computing realm instead of the classical computing\nrealm to study and demonstrate multilingual machine translation. QEDACVC\nintroduces the quantum encoder-decoder architecture that simulates and runs on\nquantum computing hardware via quantum convolution, quantum pooling, quantum\nvariational circuit, and quantum attention as software alterations. QEDACVC\nachieves an Accuracy of 82% when trained on the OPUS dataset for English,\nFrench, German, and Hindi corpora for multilingual translations.", "authors": ["Subrit Dikshit", "Ritu Tiwari", "Priyank Jain"], "category": "cs.CL", "updated": "2025-05-14T14:04:44Z"}
{"id": "2505.09436v1", "title": "CXMArena: Unified Dataset to benchmark performance in realistic CXM Scenarios", "link": "http://arxiv.org/abs/2505.09436v1", "summary": "Large Language Models (LLMs) hold immense potential for revolutionizing\nCustomer Experience Management (CXM), particularly in contact center\noperations. However, evaluating their practical utility in complex operational\nenvironments is hindered by data scarcity (due to privacy concerns) and the\nlimitations of current benchmarks. Existing benchmarks often lack realism,\nfailing to incorporate deep knowledge base (KB) integration, real-world noise,\nor critical operational tasks beyond conversational fluency. To bridge this\ngap, we introduce CXMArena, a novel, large-scale synthetic benchmark dataset\nspecifically designed for evaluating AI in operational CXM contexts. Given the\ndiversity in possible contact center features, we have developed a scalable\nLLM-powered pipeline that simulates the brand's CXM entities that form the\nfoundation of our datasets-such as knowledge articles including product\nspecifications, issue taxonomies, and contact center conversations. The\nentities closely represent real-world distribution because of controlled noise\ninjection (informed by domain experts) and rigorous automated validation.\nBuilding on this, we release CXMArena, which provides dedicated benchmarks\ntargeting five important operational tasks: Knowledge Base Refinement, Intent\nPrediction, Agent Quality Adherence, Article Search, and Multi-turn RAG with\nIntegrated Tools. Our baseline experiments underscore the benchmark's\ndifficulty: even state of the art embedding and generation models achieve only\n68% accuracy on article search, while standard embedding methods yield a low F1\nscore of 0.3 for knowledge base refinement, highlighting significant challenges\nfor current models necessitating complex pipelines and solutions over\nconventional techniques.", "authors": ["Raghav Garg", "Kapil Sharma", "Karan Gupta"], "category": "cs.CL", "updated": "2025-05-14T14:44:30Z"}
{"id": "2505.09456v1", "title": "Quantum state-agnostic work extraction (almost) without dissipation", "link": "http://arxiv.org/abs/2505.09456v1", "summary": "We investigate work extraction protocols designed to transfer the maximum\npossible energy to a battery using sequential access to $N$ copies of an\nunknown pure qubit state. The core challenge is designing interactions to\noptimally balance two competing goals: charging of the battery optimally using\nthe qubit in hand, and acquiring more information by qubit to improve energy\nharvesting in subsequent rounds. Here, we leverage exploration-exploitation\ntrade-off in reinforcement learning to develop adaptive strategies achieving\nenergy dissipation that scales only poly-logarithmically in $N$. This\nrepresents an exponential improvement over current protocols based on full\nstate tomography.", "authors": ["Josep Lumbreras", "Ruo Cheng Huang", "Yanglin Hu", "Mile Gu", "Marco Tomamichel"], "category": "cs.LG", "updated": "2025-05-14T15:07:58Z"}
{"id": "2505.09561v1", "title": "Learning Long-Context Diffusion Policies via Past-Token Prediction", "link": "http://arxiv.org/abs/2505.09561v1", "summary": "Reasoning over long sequences of observations and actions is essential for\nmany robotic tasks. Yet, learning effective long-context policies from\ndemonstrations remains challenging. As context length increases, training\nbecomes increasingly expensive due to rising memory demands, and policy\nperformance often degrades as a result of spurious correlations. Recent methods\ntypically sidestep these issues by truncating context length, discarding\nhistorical information that may be critical for subsequent decisions. In this\npaper, we propose an alternative approach that explicitly regularizes the\nretention of past information. We first revisit the copycat problem in\nimitation learning and identify an opposite challenge in recent diffusion\npolicies: rather than over-relying on prior actions, they often fail to capture\nessential dependencies between past and future actions. To address this, we\nintroduce Past-Token Prediction (PTP), an auxiliary task in which the policy\nlearns to predict past action tokens alongside future ones. This regularization\nsignificantly improves temporal modeling in the policy head, with minimal\nreliance on visual representations. Building on this observation, we further\nintroduce a multistage training strategy: pre-train the visual encoder with\nshort contexts, and fine-tune the policy head using cached long-context\nembeddings. This strategy preserves the benefits of PTP while greatly reducing\nmemory and computational overhead. Finally, we extend PTP into a\nself-verification mechanism at test time, enabling the policy to score and\nselect candidates consistent with past actions during inference. Experiments\nacross four real-world and six simulated tasks demonstrate that our proposed\nmethod improves the performance of long-context diffusion policies by 3x and\naccelerates policy training by more than 10x.", "authors": ["Marcel Torne", "Andy Tang", "Yuejiang Liu", "Chelsea Finn"], "category": "cs.LG", "updated": "2025-05-14T17:00:47Z"}
{"id": "2505.09565v1", "title": "Meta-learning Slice-to-Volume Reconstruction in Fetal Brain MRI using Implicit Neural Representations", "link": "http://arxiv.org/abs/2505.09565v1", "summary": "High-resolution slice-to-volume reconstruction (SVR) from multiple\nmotion-corrupted low-resolution 2D slices constitutes a critical step in\nimage-based diagnostics of moving subjects, such as fetal brain Magnetic\nResonance Imaging (MRI). Existing solutions struggle with image artifacts and\nsevere subject motion or require slice pre-alignment to achieve satisfying\nreconstruction performance. We propose a novel SVR method to enable fast and\naccurate MRI reconstruction even in cases of severe image and motion\ncorruption. Our approach performs motion correction, outlier handling, and\nsuper-resolution reconstruction with all operations being entirely based on\nimplicit neural representations. The model can be initialized with\ntask-specific priors through fully self-supervised meta-learning on either\nsimulated or real-world data. In extensive experiments including over 480\nreconstructions of simulated and clinical MRI brain data from different\ncenters, we prove the utility of our method in cases of severe subject motion\nand image artifacts. Our results demonstrate improvements in reconstruction\nquality, especially in the presence of severe motion, compared to\nstate-of-the-art methods, and up to 50% reduction in reconstruction time.", "authors": ["Maik Dannecker", "Thomas Sanchez", "Meritxell Bach Cuadra", "Özgün Turgut", "Anthony N. Price", "Lucilio Cordero-Grande", "Vanessa Kyriakopoulou", "Joseph V. Hajnal", "Daniel Rueckert"], "category": "cs.AI", "updated": "2025-05-14T17:07:37Z"}
{"id": "2505.09595v1", "title": "WorldView-Bench: A Benchmark for Evaluating Global Cultural Perspectives in Large Language Models", "link": "http://arxiv.org/abs/2505.09595v1", "summary": "Large Language Models (LLMs) are predominantly trained and aligned in ways\nthat reinforce Western-centric epistemologies and socio-cultural norms, leading\nto cultural homogenization and limiting their ability to reflect global\ncivilizational plurality. Existing benchmarking frameworks fail to adequately\ncapture this bias, as they rely on rigid, closed-form assessments that overlook\nthe complexity of cultural inclusivity. To address this, we introduce\nWorldView-Bench, a benchmark designed to evaluate Global Cultural Inclusivity\n(GCI) in LLMs by analyzing their ability to accommodate diverse worldviews. Our\napproach is grounded in the Multiplex Worldview proposed by Senturk et al.,\nwhich distinguishes between Uniplex models, reinforcing cultural\nhomogenization, and Multiplex models, which integrate diverse perspectives.\nWorldView-Bench measures Cultural Polarization, the exclusion of alternative\nperspectives, through free-form generative evaluation rather than conventional\ncategorical benchmarks. We implement applied multiplexity through two\nintervention strategies: (1) Contextually-Implemented Multiplex LLMs, where\nsystem prompts embed multiplexity principles, and (2) Multi-Agent System\n(MAS)-Implemented Multiplex LLMs, where multiple LLM agents representing\ndistinct cultural perspectives collaboratively generate responses. Our results\ndemonstrate a significant increase in Perspectives Distribution Score (PDS)\nentropy from 13% at baseline to 94% with MAS-Implemented Multiplex LLMs,\nalongside a shift toward positive sentiment (67.7%) and enhanced cultural\nbalance. These findings highlight the potential of multiplex-aware AI\nevaluation in mitigating cultural bias in LLMs, paving the way for more\ninclusive and ethically aligned AI systems.", "authors": ["Abdullah Mushtaq", "Imran Taj", "Rafay Naeem", "Ibrahim Ghaznavi", "Junaid Qadir"], "category": "cs.CL", "updated": "2025-05-14T17:43:40Z"}
{"id": "2505.09610v1", "title": "Customizing a Large Language Model for VHDL Design of High-Performance Microprocessors", "link": "http://arxiv.org/abs/2505.09610v1", "summary": "The use of Large Language Models (LLMs) in hardware design has taken off in\nrecent years, principally through its incorporation in tools that increase chip\ndesigner productivity. There has been considerable discussion about the use of\nLLMs in RTL specifications of chip designs, for which the two most popular\nlanguages are Verilog and VHDL. LLMs and their use in Verilog design has\nreceived significant attention due to the higher popularity of the language,\nbut little attention so far has been given to VHDL despite its continued\npopularity in the industry. There has also been little discussion about the\nunique needs of organizations that engage in high-performance processor design,\nand techniques to deploy AI solutions in these settings. In this paper, we\ndescribe our journey in developing a Large Language Model (LLM) specifically\nfor the purpose of explaining VHDL code, a task that has particular importance\nin an organization with decades of experience and assets in high-performance\nprocessor design. We show how we developed test sets specific to our needs and\nused them for evaluating models as we performed extended pretraining (EPT) of a\nbase LLM. Expert evaluation of the code explanations produced by the EPT model\nincreased to 69% compared to a base model rating of 43%. We further show how we\ndeveloped an LLM-as-a-judge to gauge models similar to expert evaluators. This\nled us to deriving and evaluating a host of new models, including an\ninstruction-tuned version of the EPT model with an expected expert evaluator\nrating of 71%. Our experiments also indicate that with the potential use of\nnewer base models, this rating can be pushed to 85% and beyond. We conclude\nwith a discussion on further improving the quality of hardware design LLMs\nusing exciting new developments in the Generative AI world.", "authors": ["Nicolas Dupuis", "Ravi Nair", "Shyam Ramji", "Sean McClintock", "Nishant Chauhan", "Priyanka Nagpal", "Bart Blaner", "Ken Valk", "Leon Stok", "Ruchir Puri"], "category": "cs.CL", "updated": "2025-05-14T17:58:40Z"}
{"id": "2505.09091v1", "title": "DPN-GAN: Inducing Periodic Activations in Generative Adversarial Networks for High-Fidelity Audio Synthesis", "link": "http://arxiv.org/abs/2505.09091v1", "summary": "In recent years, generative adversarial networks (GANs) have made significant\nprogress in generating audio sequences. However, these models typically rely on\nbandwidth-limited mel-spectrograms, which constrain the resolution of generated\naudio sequences, and lead to mode collapse during conditional generation. To\naddress this issue, we propose Deformable Periodic Network based GAN (DPN-GAN),\na novel GAN architecture that incorporates a kernel-based periodic ReLU\nactivation function to induce periodic bias in audio generation. This\ninnovative approach enhances the model's ability to capture and reproduce\nintricate audio patterns. In particular, our proposed model features a DPN\nmodule for multi-resolution generation utilizing deformable convolution\noperations, allowing for adaptive receptive fields that improve the quality and\nfidelity of the synthetic audio. Additionally, we enhance the discriminator\nnetwork using deformable convolution to better distinguish between real and\ngenerated samples, further refining the audio quality. We trained two versions\nof the model: DPN-GAN small (38.67M parameters) and DPN-GAN large (124M\nparameters). For evaluation, we use five different datasets, covering both\nspeech synthesis and music generation tasks, to demonstrate the efficiency of\nthe DPN-GAN. The experimental results demonstrate that DPN-GAN delivers\nsuperior performance on both out-of-distribution and noisy data, showcasing its\nrobustness and adaptability. Trained across various datasets, DPN-GAN\noutperforms state-of-the-art GAN architectures on standard evaluation metrics,\nand exhibits increased robustness in synthesized audio.", "authors": ["Zeeshan Ahmad", "Shudi Bao", "Meng Chen"], "category": "cs.LG", "updated": "2025-05-14T02:52:16Z"}
{"id": "2505.09558v1", "title": "WavReward: Spoken Dialogue Models With Generalist Reward Evaluators", "link": "http://arxiv.org/abs/2505.09558v1", "summary": "End-to-end spoken dialogue models such as GPT-4o-audio have recently garnered\nsignificant attention in the speech domain. However, the evaluation of spoken\ndialogue models' conversational performance has largely been overlooked. This\nis primarily due to the intelligent chatbots convey a wealth of non-textual\ninformation which cannot be easily measured using text-based language models\nlike ChatGPT. To address this gap, we propose WavReward, a reward feedback\nmodel based on audio language models that can evaluate both the IQ and EQ of\nspoken dialogue systems with speech input. Specifically, 1) based on audio\nlanguage models, WavReward incorporates the deep reasoning process and the\nnonlinear reward mechanism for post-training. By utilizing multi-sample\nfeedback via the reinforcement learning algorithm, we construct a specialized\nevaluator tailored to spoken dialogue models. 2) We introduce ChatReward-30K, a\npreference dataset used to train WavReward. ChatReward-30K includes both\ncomprehension and generation aspects of spoken dialogue models. These scenarios\nspan various tasks, such as text-based chats, nine acoustic attributes of\ninstruction chats, and implicit chats. WavReward outperforms previous\nstate-of-the-art evaluation models across multiple spoken dialogue scenarios,\nachieving a substantial improvement about Qwen2.5-Omni in objective accuracy\nfrom 55.1$\\%$ to 91.5$\\%$. In subjective A/B testing, WavReward also leads by a\nmargin of 83$\\%$. Comprehensive ablation studies confirm the necessity of each\ncomponent of WavReward. All data and code will be publicly at\nhttps://github.com/jishengpeng/WavReward after the paper is accepted.", "authors": ["Shengpeng Ji", "Tianle Liang", "Yangzhuo Li", "Jialong Zuo", "Minghui Fang", "Jinzheng He", "Yifu Chen", "Zhengqing Liu", "Ziyue Jiang", "Xize Cheng", "Siqi Zheng", "Jin Xu", "Junyang Lin", "Zhou Zhao"], "category": "cs.LG", "updated": "2025-05-14T16:54:15Z"}
{"id": "2505.09089v1", "title": "Generating time-consistent dynamics with discriminator-guided image diffusion models", "link": "http://arxiv.org/abs/2505.09089v1", "summary": "Realistic temporal dynamics are crucial for many video generation, processing\nand modelling applications, e.g. in computational fluid dynamics, weather\nprediction, or long-term climate simulations. Video diffusion models (VDMs) are\nthe current state-of-the-art method for generating highly realistic dynamics.\nHowever, training VDMs from scratch can be challenging and requires large\ncomputational resources, limiting their wider application. Here, we propose a\ntime-consistency discriminator that enables pretrained image diffusion models\nto generate realistic spatiotemporal dynamics. The discriminator guides the\nsampling inference process and does not require extensions or finetuning of the\nimage diffusion model. We compare our approach against a VDM trained from\nscratch on an idealized turbulence simulation and a real-world global\nprecipitation dataset. Our approach performs equally well in terms of temporal\nconsistency, shows improved uncertainty calibration and lower biases compared\nto the VDM, and achieves stable centennial-scale climate simulations at daily\ntime steps.", "authors": ["Philipp Hess", "Maximilian Gelbrecht", "Christof Schötz", "Michael Aich", "Yu Huang", "Shangshang Yang", "Niklas Boers"], "category": "cs.LG", "updated": "2025-05-14T02:51:10Z"}
{"id": "2505.09106v1", "title": "Argus: Federated Non-convex Bilevel Learning over 6G Space-Air-Ground Integrated Network", "link": "http://arxiv.org/abs/2505.09106v1", "summary": "The space-air-ground integrated network (SAGIN) has recently emerged as a\ncore element in the 6G networks. However, traditional centralized and\nsynchronous optimization algorithms are unsuitable for SAGIN due to\ninfrastructureless and time-varying environments. This paper aims to develop a\nnovel Asynchronous algorithm a.k.a. Argus for tackling non-convex and\nnon-smooth decentralized federated bilevel learning over SAGIN. The proposed\nalgorithm allows networked agents (e.g. autonomous aerial vehicles) to tackle\nbilevel learning problems in time-varying networks asynchronously, thereby\naverting stragglers from impeding the overall training speed. We provide a\ntheoretical analysis of the iteration complexity, communication complexity, and\ncomputational complexity of Argus. Its effectiveness is further demonstrated\nthrough numerical experiments.", "authors": ["Ya Liu", "Kai Yang", "Yu Zhu", "Keying Yang", "Haibo Zhao"], "category": "cs.LG", "updated": "2025-05-14T03:28:19Z"}
{"id": "2505.09214v1", "title": "The Larger the Merrier? Efficient Large AI Model Inference in Wireless Edge Networks", "link": "http://arxiv.org/abs/2505.09214v1", "summary": "The growing demand for large artificial intelligence model (LAIM) services is\ndriving a paradigm shift from traditional cloud-based inference to edge-based\ninference for low-latency, privacy-preserving applications. In particular,\nedge-device co-inference, which partitions LAIMs between edge devices and\nservers, has emerged as a promising strategy for resource-efficient LAIM\nexecution in wireless networks. In this paper, we investigate a pruning-aware\nLAIM co-inference scheme, where a pre-trained LAIM is pruned and partitioned\ninto on-device and on-server sub-models for deployment. For analysis, we first\nprove that the LAIM output distortion is upper bounded by its parameter\ndistortion. Then, we derive a lower bound on parameter distortion via\nrate-distortion theory, analytically capturing the relationship between pruning\nratio and co-inference performance. Next, based on the analytical results, we\nformulate an LAIM co-inference distortion bound minimization problem by jointly\noptimizing the pruning ratio, transmit power, and computation frequency under\nsystem latency, energy, and available resource constraints. Moreover, we\npropose an efficient algorithm to tackle the considered highly non-convex\nproblem. Finally, extensive simulations demonstrate the effectiveness of the\nproposed design. In particular, model parameter distortion is shown to provide\na reliable bound on output distortion. Also, the proposed joint pruning ratio\nand resource management design achieves superior performance in balancing\ntrade-offs among inference performance, system latency, and energy consumption\ncompared with benchmark schemes, such as fully on-device and on-server\ninference. Moreover, the split point is shown to play a critical role in system\nperformance optimization under heterogeneous and resource-limited edge\nenvironments.", "authors": ["Zhonghao Lyu", "Ming Xiao", "Jie Xu", "Mikael Skoglund", "Marco Di Renzo"], "category": "cs.LG", "updated": "2025-05-14T08:18:55Z"}
{"id": "2505.09239v1", "title": "Stable and Convexified Information Bottleneck Optimization via Symbolic Continuation and Entropy-Regularized Trajectories", "link": "http://arxiv.org/abs/2505.09239v1", "summary": "The Information Bottleneck (IB) method frequently suffers from unstable\noptimization, characterized by abrupt representation shifts near critical\npoints of the IB trade-off parameter, beta. In this paper, I introduce a novel\napproach to achieve stable and convex IB optimization through symbolic\ncontinuation and entropy-regularized trajectories. I analytically prove\nconvexity and uniqueness of the IB solution path when an entropy regularization\nterm is included, and demonstrate how this stabilizes representation learning\nacross a wide range of \\b{eta} values. Additionally, I provide extensive\nsensitivity analyses around critical points (beta) with statistically robust\nuncertainty quantification (95% confidence intervals). The open-source\nimplementation, experimental results, and reproducibility framework included in\nthis work offer a clear path for practical deployment and future extension of\nmy proposed method.", "authors": ["Faruk Alpay"], "category": "cs.LG", "updated": "2025-05-14T09:27:09Z"}
{"id": "2505.09294v1", "title": "On the Learning with Augmented Class via Forests", "link": "http://arxiv.org/abs/2505.09294v1", "summary": "Decision trees and forests have achieved successes in various real\napplications, most working with all testing classes known in training data. In\nthis work, we focus on learning with augmented class via forests, where an\naugmented class may appear in testing data yet not in training data. We\nincorporate information of augmented class into trees' splitting, i.e., a new\nsplitting criterion, called augmented Gini impurity, is introduced to exploit\nsome unlabeled data from testing distribution. We then develop the approach\nnamed Learning with Augmented Class via Forests (LACForest), which constructs\nshallow forests based on the augmented Gini impurity and then splits forests\nwith pseudo-labeled augmented instances for better performance. We also develop\ndeep neural forests with a novel optimization objective based on our augmented\nGini impurity, so as to utilize the representation power of neural networks for\nforests. Theoretically, we present the convergence analysis for augmented Gini\nimpurity, and finally conduct experiments to verify the effectiveness of our\napproaches. The code is available at https://github.com/nju-xuf/LACForest/.", "authors": ["Fan Xu", "Wuyang Chen", "Wei Gao"], "category": "cs.LG", "updated": "2025-05-14T11:22:22Z"}
{"id": "2505.09308v1", "title": "Neural Multivariate Regression: Qualitative Insights from the Unconstrained Feature Model", "link": "http://arxiv.org/abs/2505.09308v1", "summary": "The Unconstrained Feature Model (UFM) is a mathematical framework that\nenables closed-form approximations for minimal training loss and related\nperformance measures in deep neural networks (DNNs). This paper leverages the\nUFM to provide qualitative insights into neural multivariate regression, a\ncritical task in imitation learning, robotics, and reinforcement learning.\nSpecifically, we address two key questions: (1) How do multi-task models\ncompare to multiple single-task models in terms of training performance? (2)\nCan whitening and normalizing regression targets improve training performance?\nThe UFM theory predicts that multi-task models achieve strictly smaller\ntraining MSE than multiple single-task models when the same or stronger\nregularization is applied to the latter, and our empirical results confirm\nthese findings. Regarding whitening and normalizing regression targets, the UFM\ntheory predicts that they reduce training MSE when the average variance across\nthe target dimensions is less than one, and our empirical results once again\nconfirm these findings. These findings highlight the UFM as a powerful\nframework for deriving actionable insights into DNN design and data\npre-processing strategies.", "authors": ["George Andriopoulos", "Soyuj Jung Basnet", "Juan Guevara", "Li Guo", "Keith Ross"], "category": "cs.LG", "updated": "2025-05-14T11:52:45Z"}
{"id": "2505.09331v1", "title": "MUST: Multi-Scale Structural-Temporal Link Prediction Model for UAV Ad Hoc Networks", "link": "http://arxiv.org/abs/2505.09331v1", "summary": "Link prediction in unmanned aerial vehicle (UAV) ad hoc networks (UANETs)\naims to predict the potential formation of future links between UAVs. In\nadversarial environments where the route information of UAVs is unavailable,\npredicting future links must rely solely on the observed historical topological\ninformation of UANETs. However, the highly dynamic and sparse nature of UANET\ntopologies presents substantial challenges in effectively capturing meaningful\nstructural and temporal patterns for accurate link prediction. Most existing\nlink prediction methods focus on temporal dynamics at a single structural scale\nwhile neglecting the effects of sparsity, resulting in insufficient information\ncapture and limited applicability to UANETs. In this paper, we propose a\nmulti-scale structural-temporal link prediction model (MUST) for UANETs.\nSpecifically, we first employ graph attention networks (GATs) to capture\nstructural features at multiple levels, including the individual UAV level, the\nUAV community level, and the overall network level. Then, we use long\nshort-term memory (LSTM) networks to learn the temporal dynamics of these\nmulti-scale structural features. Additionally, we address the impact of\nsparsity by introducing a sophisticated loss function during model\noptimization. We validate the performance of MUST using several UANET datasets\ngenerated through simulations. Extensive experimental results demonstrate that\nMUST achieves state-of-the-art link prediction performance in highly dynamic\nand sparse UANETs.", "authors": ["Cunlai Pu", "Fangrui Wu", "Rajput Ramiz Sharafat", "Guangzhao Dai", "Xiangbo Shu"], "category": "cs.LG", "updated": "2025-05-14T12:26:46Z"}
{"id": "2505.09354v1", "title": "Exploiting the Potential Supervision Information of Clean Samples in Partial Label Learning", "link": "http://arxiv.org/abs/2505.09354v1", "summary": "Diminishing the impact of false-positive labels is critical for conducting\ndisambiguation in partial label learning. However, the existing disambiguation\nstrategies mainly focus on exploiting the characteristics of individual partial\nlabel instances while neglecting the strong supervision information of clean\nsamples randomly lying in the datasets. In this work, we show that clean\nsamples can be collected to offer guidance and enhance the confidence of the\nmost possible candidates. Motivated by the manner of the differentiable count\nloss strat- egy and the K-Nearest-Neighbor algorithm, we proposed a new\ncalibration strategy called CleanSE. Specifically, we attribute the most\nreliable candidates with higher significance under the assumption that for each\nclean sample, if its label is one of the candidates of its nearest neighbor in\nthe representation space, it is more likely to be the ground truth of its\nneighbor. Moreover, clean samples offer help in characterizing the sample\ndistributions by restricting the label counts of each label to a specific\ninterval. Extensive experiments on 3 synthetic benchmarks and 5 real-world PLL\ndatasets showed this calibration strategy can be applied to most of the\nstate-of-the-art PLL methods as well as enhance their performance.", "authors": ["Guangtai Wang", "Chi-Man Vong", "Jintao Huang"], "category": "cs.LG", "updated": "2025-05-14T13:04:55Z"}
{"id": "2505.09361v1", "title": "Efficient Mixed Precision Quantization in Graph Neural Networks", "link": "http://arxiv.org/abs/2505.09361v1", "summary": "Graph Neural Networks (GNNs) have become essential for handling large-scale\ngraph applications. However, the computational demands of GNNs necessitate the\ndevelopment of efficient methods to accelerate inference. Mixed precision\nquantization emerges as a promising solution to enhance the efficiency of GNN\narchitectures without compromising prediction performance. Compared to\nconventional deep learning architectures, GNN layers contain a wider set of\ncomponents that can be quantized, including message passing functions,\naggregation functions, update functions, the inputs, learnable parameters, and\noutputs of these functions. In this paper, we introduce a theorem for efficient\nquantized message passing to aggregate integer messages. It guarantees\nnumerical equality of the aggregated messages using integer values with respect\nto those obtained with full (FP32) precision. Based on this theorem, we\nintroduce the Mixed Precision Quantization for GNN (MixQ-GNN) framework, which\nflexibly selects effective integer bit-widths for all components within GNN\nlayers. Our approach systematically navigates the wide set of possible\nbit-width combinations, addressing the challenge of optimizing efficiency while\naiming at maintaining comparable prediction performance. MixQ-GNN integrates\nwith existing GNN quantization methods, utilizing their graph structure\nadvantages to achieve higher prediction performance. On average, MixQ-GNN\nachieved reductions in bit operations of 5.5x for node classification and 5.1x\nfor graph classification compared to architectures represented in FP32\nprecision.", "authors": ["Samir Moustafa", "Nils M. Kriege", "Wilfried N. Gansterer"], "category": "cs.LG", "updated": "2025-05-14T13:11:39Z"}
{"id": "2505.09366v1", "title": "Personalized Control for Lower Limb Prosthesis Using Kolmogorov-Arnold Networks", "link": "http://arxiv.org/abs/2505.09366v1", "summary": "Objective: This paper investigates the potential of learnable activation\nfunctions in Kolmogorov-Arnold Networks (KANs) for personalized control in a\nlower-limb prosthesis. In addition, user-specific vs. pooled training data is\nevaluated to improve machine learning (ML) and Deep Learning (DL) performance\nfor turn intent prediction.\n  Method: Inertial measurement unit (IMU) data from the shank were collected\nfrom five individuals with lower-limb amputation performing turning tasks in a\nlaboratory setting. Ability to classify an upcoming turn was evaluated for\nMultilayer Perceptron (MLP), Kolmogorov-Arnold Network (KAN), convolutional\nneural network (CNN), and fractional Kolmogorov-Arnold Networks (FKAN). The\ncomparison of MLP and KAN (for ML models) and FKAN and CNN (for DL models)\nassessed the effectiveness of learnable activation functions. Models were\ntrained separately on user-specific and pooled data to evaluate the impact of\ntraining data on their performance.\n  Results: Learnable activation functions in KAN and FKAN did not yield\nsignificant improvement compared to MLP and CNN, respectively. Training on\nuser-specific data yielded superior results compared to pooled data for ML\nmodels ($p < 0.05$). In contrast, no significant difference was observed\nbetween user-specific and pooled training for DL models.\n  Significance: These findings suggest that learnable activation functions may\ndemonstrate distinct advantages in datasets involving more complex tasks and\nlarger volumes. In addition, pooled training showed comparable performance to\nuser-specific training in DL models, indicating that model training for\nprosthesis control can utilize data from multiple participants.", "authors": ["SeyedMojtaba Mohasel", "Alireza Afzal Aghaei", "Corey Pew"], "category": "cs.LG", "updated": "2025-05-14T13:18:57Z"}
{"id": "2505.09458v1", "title": "Variational Rank Reduction Autoencoder", "link": "http://arxiv.org/abs/2505.09458v1", "summary": "Deterministic Rank Reduction Autoencoders (RRAEs) enforce by construction a\nregularization on the latent space by applying a truncated SVD. While this\nregularization makes Autoencoders more powerful, using them for generative\npurposes is counter-intuitive due to their deterministic nature. On the other\nhand, Variational Autoencoders (VAEs) are well known for their generative\nabilities by learning a probabilistic latent space. In this paper, we present\nVariational Rank Reduction Autoencoders (VRRAEs), a model that leverages the\nadvantages of both RRAEs and VAEs. Our claims and results show that when\ncarefully sampling the latent space of RRAEs and further regularizing with the\nKullback-Leibler (KL) divergence (similarly to VAEs), VRRAEs outperform RRAEs\nand VAEs. Additionally, we show that the regularization induced by the SVD not\nonly makes VRRAEs better generators than VAEs, but also reduces the possibility\nof posterior collapse. Our results include a synthetic dataset of a small size\nthat showcases the robustness of VRRAEs against collapse, and three real-world\ndatasets; the MNIST, CelebA, and CIFAR-10, over which VRRAEs are shown to\noutperform both VAEs and RRAEs on many random generation and interpolation\ntasks based on the FID score.", "authors": ["Jad Mounayer", "Alicia Tierz", "Jerome Tomezyk", "Chady Ghnatios", "Francisco Chinesta"], "category": "cs.LG", "updated": "2025-05-14T15:08:28Z"}
{"id": "2505.09500v1", "title": "Layered Unlearning for Adversarial Relearning", "link": "http://arxiv.org/abs/2505.09500v1", "summary": "Our goal is to understand how post-training methods, such as fine-tuning,\nalignment, and unlearning, modify language model behavior and representations.\nWe are particularly interested in the brittle nature of these modifications\nthat makes them easy to bypass through prompt engineering or relearning. Recent\nresults suggest that post-training induces shallow context-dependent\n``circuits'' that suppress specific response patterns. This could be one\nexplanation for the brittleness of post-training. To test this hypothesis, we\ndesign an unlearning algorithm, Layered Unlearning (LU), that creates distinct\ninhibitory mechanisms for a growing subset of the data. By unlearning the first\n$i$ folds while retaining the remaining $k - i$ at the $i$th of $k$ stages, LU\nlimits the ability of relearning on a subset of data to recover the full\ndataset. We evaluate LU through a combination of synthetic and large language\nmodel (LLM) experiments. We find that LU improves robustness to adversarial\nrelearning for several different unlearning methods. Our results contribute to\nthe state-of-the-art of machine unlearning and provide insight into the effect\nof post-training updates.", "authors": ["Timothy Qian", "Vinith Suriyakumar", "Ashia Wilson", "Dylan Hadfield-Menell"], "category": "cs.LG", "updated": "2025-05-14T15:50:45Z"}
{"id": "2505.09503v1", "title": "Towards Fair In-Context Learning with Tabular Foundation Models", "link": "http://arxiv.org/abs/2505.09503v1", "summary": "Tabular foundational models have exhibited strong in-context learning (ICL)\ncapabilities on structured data, allowing them to make accurate predictions on\ntest sets without parameter updates, using training examples as context. This\nemerging approach positions itself as a competitive alternative to traditional\ngradient-boosted tree methods. However, while biases in conventional machine\nlearning models are well documented, it remains unclear how these biases\nmanifest in tabular ICL. The paper investigates the fairness implications of\ntabular ICL and explores three preprocessing strategies--correlation removal,\ngroup-balanced demonstration selection, and uncertainty-based demonstration\nselection--to address bias. Comprehensive experiments indicate that\nuncertainty-based demonstration selection consistently enhances group fairness\nof in-context predictions. The source code for reproducing the results of this\nwork can be found at https://github.com/patrikken/Fair-TabICL.", "authors": ["Patrik Kenfack", "Samira Ebrahimi Kaho", "Ulrich Aïvodji"], "category": "cs.LG", "updated": "2025-05-14T15:53:14Z"}
{"id": "2505.09586v1", "title": "Rhomboid Tiling for Geometric Graph Deep Learning", "link": "http://arxiv.org/abs/2505.09586v1", "summary": "Graph Neural Networks (GNNs) have proven effective for learning from\ngraph-structured data through their neighborhood-based message passing\nframework. Many hierarchical graph clustering pooling methods modify this\nframework by introducing clustering-based strategies, enabling the construction\nof more expressive and powerful models. However, all of these message passing\nframework heavily rely on the connectivity structure of graphs, limiting their\nability to capture the rich geometric features inherent in geometric graphs. To\naddress this, we propose Rhomboid Tiling (RT) clustering, a novel clustering\nmethod based on the rhomboid tiling structure, which performs clustering by\nleveraging the complex geometric information of the data and effectively\nextracts its higher-order geometric structures. Moreover, we design RTPool, a\nhierarchical graph clustering pooling model based on RT clustering for graph\nclassification tasks. The proposed model demonstrates superior performance,\noutperforming 21 state-of-the-art competitors on all the 7 benchmark datasets.", "authors": ["Yipeng Zhang", "Longlong Li", "Kelin Xia"], "category": "cs.LG", "updated": "2025-05-14T17:37:15Z"}
{"id": "2505.09593v1", "title": "Online Isolation Forest", "link": "http://arxiv.org/abs/2505.09593v1", "summary": "The anomaly detection literature is abundant with offline methods, which\nrequire repeated access to data in memory, and impose impractical assumptions\nwhen applied to a streaming context. Existing online anomaly detection methods\nalso generally fail to address these constraints, resorting to periodic\nretraining to adapt to the online context. We propose Online-iForest, a novel\nmethod explicitly designed for streaming conditions that seamlessly tracks the\ndata generating process as it evolves over time. Experimental validation on\nreal-world datasets demonstrated that Online-iForest is on par with online\nalternatives and closely rivals state-of-the-art offline anomaly detection\ntechniques that undergo periodic retraining. Notably, Online-iForest\nconsistently outperforms all competitors in terms of efficiency, making it a\npromising solution in applications where fast identification of anomalies is of\nprimary importance such as cybersecurity, fraud and fault detection.", "authors": ["Filippo Leveni", "Guilherme Weigert Cassales", "Bernhard Pfahringer", "Albert Bifet", "Giacomo Boracchi"], "category": "cs.LG", "updated": "2025-05-14T17:42:50Z"}
{"id": "2505.09075v1", "title": "Risk Bounds For Distributional Regression", "link": "http://arxiv.org/abs/2505.09075v1", "summary": "This work examines risk bounds for nonparametric distributional regression\nestimators. For convex-constrained distributional regression, general upper\nbounds are established for the continuous ranked probability score (CRPS) and\nthe worst-case mean squared error (MSE) across the domain. These theoretical\nresults are applied to isotonic and trend filtering distributional regression,\nyielding convergence rates consistent with those for mean estimation.\nFurthermore, a general upper bound is derived for distributional regression\nunder non-convex constraints, with a specific application to neural\nnetwork-based estimators. Comprehensive experiments on both simulated and real\ndata validate the theoretical contributions, demonstrating their practical\neffectiveness.", "authors": ["Carlos Misael Madrid Padilla", "Oscar Hernan Madrid Padilla", "Sabyasachi Chatterjee"], "category": "cs.LG", "updated": "2025-05-14T02:22:12Z"}
{"id": "2505.09076v1", "title": "AdaFortiTran: An Adaptive Transformer Model for Robust OFDM Channel Estimation", "link": "http://arxiv.org/abs/2505.09076v1", "summary": "Deep learning models for channel estimation in Orthogonal Frequency Division\nMultiplexing (OFDM) systems often suffer from performance degradation under\nfast-fading channels and low-SNR scenarios. To address these limitations, we\nintroduce the Adaptive Fortified Transformer (AdaFortiTran), a novel model\nspecifically designed to enhance channel estimation in challenging\nenvironments. Our approach employs convolutional layers that exploit locality\nbias to capture strong correlations between neighboring channel elements,\ncombined with a transformer encoder that applies the global Attention mechanism\nto channel patches. This approach effectively models both long-range\ndependencies and spectro-temporal interactions within single OFDM frames. We\nfurther augment the model's adaptability by integrating nonlinear\nrepresentations of available channel statistics SNR, delay spread, and Doppler\nshift as priors. A residual connection is employed to merge global features\nfrom the transformer with local features from early convolutional processing,\nfollowed by final convolutional layers to refine the hierarchical channel\nrepresentation. Despite its compact architecture, AdaFortiTran achieves up to 6\ndB reduction in mean squared error (MSE) compared to state-of-the-art models.\nTested across a wide range of Doppler shifts (200-1000 Hz), SNRs (0 to 25 dB),\nand delay spreads (50-300 ns), it demonstrates superior robustness in\nhigh-mobility environments.", "authors": ["Berkay Guler", "Hamid Jafarkhani"], "category": "cs.LG", "updated": "2025-05-14T02:22:37Z"}
{"id": "2505.09087v1", "title": "A Comparative Review of RNA Language Models", "link": "http://arxiv.org/abs/2505.09087v1", "summary": "Given usefulness of protein language models (LMs) in structure and functional\ninference, RNA LMs have received increased attentions in the last few years.\nHowever, these RNA models are often not compared against the same standard.\nHere, we divided RNA LMs into three classes (pretrained on multiple RNA types\n(especially noncoding RNAs), specific-purpose RNAs, and LMs that unify RNA with\nDNA or proteins or both) and compared 13 RNA LMs along with 3 DNA and 1 protein\nLMs as controls in zero-shot prediction of RNA secondary structure and\nfunctional classification. Results shows that the models doing well on\nsecondary structure prediction often perform worse in function classification\nor vice versa, suggesting that more balanced unsupervised training is needed.", "authors": ["He Wang", "Yikun Zhang", "Jie Chen", "Jian Zhan", "Yaoqi Zhou"], "category": "cs.LG", "updated": "2025-05-14T02:40:13Z"}
{"id": "2505.09099v1", "title": "Imitation Learning for Adaptive Control of a Virtual Soft Exoglove", "link": "http://arxiv.org/abs/2505.09099v1", "summary": "The use of wearable robots has been widely adopted in rehabilitation training\nfor patients with hand motor impairments. However, the uniqueness of patients'\nmuscle loss is often overlooked. Leveraging reinforcement learning and a\nbiologically accurate musculoskeletal model in simulation, we propose a\ncustomized wearable robotic controller that is able to address specific muscle\ndeficits and to provide compensation for hand-object manipulation tasks. Video\ndata of a same subject performing human grasping tasks is used to train a\nmanipulation model through learning from demonstration. This manipulation model\nis subsequently fine-tuned to perform object-specific interaction tasks. The\nmuscle forces in the musculoskeletal manipulation model are then weakened to\nsimulate neurological motor impairments, which are later compensated by the\nactuation of a virtual wearable robotics glove. Results shows that integrating\nthe virtual wearable robotic glove provides shared assistance to support the\nhand manipulator with weakened muscle forces. The learned exoglove controller\nachieved an average of 90.5\\% of the original manipulation proficiency.", "authors": ["Shirui Lyu", "Vittorio Caggiano", "Matteo Leonetti", "Dario Farina", "Letizia Gionfrida"], "category": "cs.LG", "updated": "2025-05-14T03:09:21Z"}
{"id": "2505.09113v1", "title": "Sequential Treatment Effect Estimation with Unmeasured Confounders", "link": "http://arxiv.org/abs/2505.09113v1", "summary": "This paper studies the cumulative causal effects of sequential treatments in\nthe presence of unmeasured confounders. It is a critical issue in sequential\ndecision-making scenarios where treatment decisions and outcomes dynamically\nevolve over time. Advanced causal methods apply transformer as a backbone to\nmodel such time sequences, which shows superiority in capturing long time\ndependence and periodic patterns via attention mechanism. However, even they\ncontrol the observed confounding, these estimators still suffer from unmeasured\nconfounders, which influence both treatment assignments and outcomes. How to\nadjust the latent confounding bias in sequential treatment effect estimation\nremains an open challenge. Therefore, we propose a novel Decomposing Sequential\nInstrumental Variable framework for CounterFactual Regression (DSIV-CFR),\nrelying on a common negative control assumption. Specifically, an instrumental\nvariable (IV) is a special negative control exposure, while the previous\noutcome serves as a negative control outcome. This allows us to recover the IVs\nlatent in observation variables and estimate sequential treatment effects via a\ngeneralized moment condition. We conducted experiments on 4 datasets and\nachieved significant performance in one- and multi-step prediction, supported\nby which we can identify optimal treatments for dynamic systems.", "authors": ["Yingrong Wang", "Anpeng Wu", "Baohong Li", "Ziyang Xiao", "Ruoxuan Xiong", "Qing Han", "Kun Kuang"], "category": "cs.LG", "updated": "2025-05-14T03:42:43Z"}
{"id": "2505.09134v1", "title": "Scaling Gaussian Process Regression with Full Derivative Observations", "link": "http://arxiv.org/abs/2505.09134v1", "summary": "We present a scalable Gaussian Process (GP) method that can fit and predict\nfull derivative observations called DSoftKI. It extends SoftKI, a method that\napproximates a kernel via softmax interpolation from learned interpolation\npoint locations, to the setting with derivatives. DSoftKI enhances SoftKI's\ninterpolation scheme to incorporate the directional orientation of\ninterpolation points relative to the data. This enables the construction of a\nscalable approximate kernel, including its first and second-order derivatives,\nthrough interpolation. We evaluate DSoftKI on a synthetic function benchmark\nand high-dimensional molecular force field prediction (100-1000 dimensions),\ndemonstrating that DSoftKI is accurate and can scale to larger datasets with\nfull derivative observations than previously possible.", "authors": ["Daniel Huang"], "category": "cs.LG", "updated": "2025-05-14T04:35:26Z"}
{"id": "2505.09167v1", "title": "Online Learning of Neural Networks", "link": "http://arxiv.org/abs/2505.09167v1", "summary": "We study online learning of feedforward neural networks with the sign\nactivation function that implement functions from the unit ball in\n$\\mathbb{R}^d$ to a finite label set $\\{1, \\ldots, Y\\}$.\n  First, we characterize a margin condition that is sufficient and in some\ncases necessary for online learnability of a neural network: Every neuron in\nthe first hidden layer classifies all instances with some margin $\\gamma$\nbounded away from zero. Quantitatively, we prove that for any net, the optimal\nmistake bound is at most approximately $\\mathtt{TS}(d,\\gamma)$, which is the\n$(d,\\gamma)$-totally-separable-packing number, a more restricted variation of\nthe standard $(d,\\gamma)$-packing number. We complement this result by\nconstructing a net on which any learner makes $\\mathtt{TS}(d,\\gamma)$ many\nmistakes. We also give a quantitative lower bound of approximately\n$\\mathtt{TS}(d,\\gamma) \\geq \\max\\{1/(\\gamma \\sqrt{d})^d, d\\}$ when $\\gamma \\geq\n1/2$, implying that for some nets and input sequences every learner will err\nfor $\\exp(d)$ many times, and that a dimension-free mistake bound is almost\nalways impossible.\n  To remedy this inevitable dependence on $d$, it is natural to seek additional\nnatural restrictions to be placed on the network, so that the dependence on $d$\nis removed. We study two such restrictions. The first is the multi-index model,\nin which the function computed by the net depends only on $k \\ll d$ orthonormal\ndirections. We prove a mistake bound of approximately $(1.5/\\gamma)^{k + 2}$ in\nthis model. The second is the extended margin assumption. In this setting, we\nassume that all neurons (in all layers) in the network classify every ingoing\ninput from previous layer with margin $\\gamma$ bounded away from zero. In this\nmodel, we prove a mistake bound of approximately $(\\log Y)/ \\gamma^{O(L)}$,\nwhere L is the depth of the network.", "authors": ["Amit Daniely", "Idan Mehalel", "Elchanan Mossel"], "category": "cs.LG", "updated": "2025-05-14T06:03:07Z"}
{"id": "2505.09175v1", "title": "Optimizing Urban Critical Green Space Development Using Machine Learning", "link": "http://arxiv.org/abs/2505.09175v1", "summary": "This paper presents a novel framework for prioritizing urban green space\ndevelopment in Tehran using diverse socio-economic, environmental, and\nsensitivity indices. The indices were derived from various sources including\nGoogle Earth Engine, air pollution measurements, municipal reports and the\nWeather Research & Forecasting (WRF) model. The WRF model was used to estimate\nthe air temperature at a 1 km resolution due to insufficient meteorological\nstations, yielding RMSE and MAE values of 0.96{\\deg}C and 0.92{\\deg}C,\nrespectively. After data preparation, several machine learning models were used\nfor binary vegetation cover classification including XGBoost, LightGBM, Random\nForest (RF) and Extra Trees. RF achieved the highest performance, exceeding 94%\nin Overall Accuracy, Recall, and F1-score. Then, the probability of areas\nlacking vegetation cover was assessed using socio-economic, environmental and\nsensitivity indices. This resulted in the RF generating an urban green space\ndevelopment prioritization map. Feature Importance Analysis revealed that the\nmost significant indices were nightly land surface temperature (LST) and\nsensitive population. Finally, the framework performance was validated through\nmicroclimate simulation to assess the critical areas after and before the green\nspace development by green roofs. The simulation demonstrated reducing air\ntemperature by up to 0.67{\\deg}C after utilizing the green roof technology in\ncritical areas. As a result, this framework provides a valuable tool for urban\nplanners to develop green spaces.", "authors": ["Mohammad Ganjirad", "Mahmoud Reza Delavar", "Hossein Bagheri", "Mohammad Mehdi Azizi"], "category": "cs.LG", "updated": "2025-05-14T06:13:23Z"}
{"id": "2505.09284v1", "title": "Generating Full-field Evolution of Physical Dynamics from Irregular Sparse Observations", "link": "http://arxiv.org/abs/2505.09284v1", "summary": "Modeling and reconstructing multidimensional physical dynamics from sparse\nand off-grid observations presents a fundamental challenge in scientific\nresearch. Recently, diffusion-based generative modeling shows promising\npotential for physical simulation. However, current approaches typically\noperate on on-grid data with preset spatiotemporal resolution, but struggle\nwith the sparsely observed and continuous nature of real-world physical\ndynamics. To fill the gaps, we present SDIFT, Sequential DIffusion in\nFunctional Tucker space, a novel framework that generates full-field evolution\nof physical dynamics from irregular sparse observations. SDIFT leverages the\nfunctional Tucker model as the latent space representer with proven universal\napproximation property, and represents observations as latent functions and\nTucker core sequences. We then construct a sequential diffusion model with\ntemporally augmented UNet in the functional Tucker space, denoising noise drawn\nfrom a Gaussian process to generate the sequence of core tensors.\n  At the posterior sampling stage, we propose a Message-Passing Posterior\nSampling mechanism, enabling conditional generation of the entire sequence\nguided by observations at limited time steps. We validate SDIFT on three\nphysical systems spanning astronomical (supernova explosions, light-year\nscale), environmental (ocean sound speed fields, kilometer scale), and\nmolecular (organic liquid, millimeter scale) domains, demonstrating significant\nimprovements in both reconstruction accuracy and computational efficiency\ncompared to state-of-the-art approaches.", "authors": ["Panqi Chen", "Yifan Sun", "Lei Cheng", "Yang Yang", "Weichang Li", "Yang Liu", "Weiqing Liu", "Jiang Bian", "Shikai Fang"], "category": "cs.LG", "updated": "2025-05-14T11:09:15Z"}
{"id": "2505.09287v1", "title": "Ranking-Based At-Risk Student Prediction Using Federated Learning and Differential Features", "link": "http://arxiv.org/abs/2505.09287v1", "summary": "Digital textbooks are widely used in various educational contexts, such as\nuniversity courses and online lectures. Such textbooks yield learning log data\nthat have been used in numerous educational data mining (EDM) studies for\nstudent behavior analysis and performance prediction. However, these studies\nhave faced challenges in integrating confidential data, such as academic\nrecords and learning logs, across schools due to privacy concerns.\nConsequently, analyses are often conducted with data limited to a single\nschool, which makes developing high-performing and generalizable models\ndifficult. This study proposes a method that combines federated learning and\ndifferential features to address these issues. Federated learning enables model\ntraining without centralizing data, thereby preserving student privacy.\nDifferential features, which utilize relative values instead of absolute\nvalues, enhance model performance and generalizability. To evaluate the\nproposed method, a model for predicting at-risk students was trained using data\nfrom 1,136 students across 12 courses conducted over 4 years, and validated on\nhold-out test data from 5 other courses. Experimental results demonstrated that\nthe proposed method addresses privacy concerns while achieving performance\ncomparable to that of models trained via centralized learning in terms of Top-n\nprecision, nDCG, and PR-AUC. Furthermore, using differential features improved\nprediction performance across all evaluation datasets compared to\nnon-differential approaches. The trained models were also applicable for early\nprediction, achieving high performance in detecting at-risk students in earlier\nstages of the semester within the validation datasets.", "authors": ["Shunsuke Yoneda", "Valdemar Švábenský", "Gen Li", "Daisuke Deguchi", "Atsushi Shimada"], "category": "cs.LG", "updated": "2025-05-14T11:12:30Z"}
{"id": "2505.09306v1", "title": "Predicting butterfly species presence from satellite imagery using soft contrastive regularisation", "link": "http://arxiv.org/abs/2505.09306v1", "summary": "The growing demand for scalable biodiversity monitoring methods has fuelled\ninterest in remote sensing data, due to its widespread availability and\nextensive coverage. Traditionally, the application of remote sensing to\nbiodiversity research has focused on mapping and monitoring habitats, but with\nincreasing availability of large-scale citizen-science wildlife observation\ndata, recent methods have started to explore predicting multi-species presence\ndirectly from satellite images. This paper presents a new data set for\npredicting butterfly species presence from satellite data in the United\nKingdom. We experimentally optimise a Resnet-based model to predict\nmulti-species presence from 4-band satellite images, and find that this model\nespecially outperforms the mean rate baseline for locations with high species\nbiodiversity. To improve performance, we develop a soft, supervised contrastive\nregularisation loss that is tailored to probabilistic labels (such as\nspecies-presence data), and demonstrate that this improves prediction accuracy.\nIn summary, our new data set and contrastive regularisation method contribute\nto the open challenge of accurately predicting species biodiversity from remote\nsensing data, which is key for efficient biodiversity monitoring.", "authors": ["Thijs L van der Plas", "Stephen Law", "Michael JO Pocock"], "category": "cs.LG", "updated": "2025-05-14T11:42:09Z"}
{"id": "2505.09313v1", "title": "Detecting Sybil Addresses in Blockchain Airdrops: A Subgraph-based Feature Propagation and Fusion Approach", "link": "http://arxiv.org/abs/2505.09313v1", "summary": "Sybil attacks pose a significant security threat to blockchain ecosystems,\nparticularly in token airdrop events. This paper proposes a novel sybil address\nidentification method based on subgraph feature extraction lightGBM. The method\nfirst constructs a two-layer deep transaction subgraph for each address, then\nextracts key event operation features according to the lifecycle of sybil\naddresses, including the time of first transaction, first gas acquisition,\nparticipation in airdrop activities, and last transaction. These temporal\nfeatures effectively capture the consistency of sybil address behavior\noperations. Additionally, the method extracts amount and network structure\nfeatures, comprehensively describing address behavior patterns and network\ntopology through feature propagation and fusion. Experiments conducted on a\ndataset containing 193,701 addresses (including 23,240 sybil addresses) show\nthat this method outperforms existing approaches in terms of precision, recall,\nF1 score, and AUC, with all metrics exceeding 0.9. The methods and results of\nthis study can be further applied to broader blockchain security areas such as\ntransaction manipulation identification and token liquidity risk assessment,\ncontributing to the construction of a more secure and fair blockchain\necosystem.", "authors": ["Qiangqiang Liu", "Qian Huang", "Frank Fan", "Haishan Wu", "Xueyan Tang"], "category": "cs.LG", "updated": "2025-05-14T12:04:26Z"}
{"id": "2505.09358v1", "title": "Marigold: Affordable Adaptation of Diffusion-Based Image Generators for Image Analysis", "link": "http://arxiv.org/abs/2505.09358v1", "summary": "The success of deep learning in computer vision over the past decade has\nhinged on large labeled datasets and strong pretrained models. In data-scarce\nsettings, the quality of these pretrained models becomes crucial for effective\ntransfer learning. Image classification and self-supervised learning have\ntraditionally been the primary methods for pretraining CNNs and\ntransformer-based architectures. Recently, the rise of text-to-image generative\nmodels, particularly those using denoising diffusion in a latent space, has\nintroduced a new class of foundational models trained on massive, captioned\nimage datasets. These models' ability to generate realistic images of unseen\ncontent suggests they possess a deep understanding of the visual world. In this\nwork, we present Marigold, a family of conditional generative models and a\nfine-tuning protocol that extracts the knowledge from pretrained latent\ndiffusion models like Stable Diffusion and adapts them for dense image analysis\ntasks, including monocular depth estimation, surface normals prediction, and\nintrinsic decomposition. Marigold requires minimal modification of the\npre-trained latent diffusion model's architecture, trains with small synthetic\ndatasets on a single GPU over a few days, and demonstrates state-of-the-art\nzero-shot generalization. Project page:\nhttps://marigoldcomputervision.github.io", "authors": ["Bingxin Ke", "Kevin Qu", "Tianfu Wang", "Nando Metzger", "Shengyu Huang", "Bo Li", "Anton Obukhov", "Konrad Schindler"], "category": "cs.LG", "updated": "2025-05-14T13:07:03Z"}
{"id": "2505.09368v1", "title": "RobustSpring: Benchmarking Robustness to Image Corruptions for Optical Flow, Scene Flow and Stereo", "link": "http://arxiv.org/abs/2505.09368v1", "summary": "Standard benchmarks for optical flow, scene flow, and stereo vision\nalgorithms generally focus on model accuracy rather than robustness to image\ncorruptions like noise or rain. Hence, the resilience of models to such\nreal-world perturbations is largely unquantified. To address this, we present\nRobustSpring, a comprehensive dataset and benchmark for evaluating robustness\nto image corruptions for optical flow, scene flow, and stereo models.\nRobustSpring applies 20 different image corruptions, including noise, blur,\ncolor changes, quality degradations, and weather distortions, in a time-,\nstereo-, and depth-consistent manner to the high-resolution Spring dataset,\ncreating a suite of 20,000 corrupted images that reflect challenging\nconditions. RobustSpring enables comparisons of model robustness via a new\ncorruption robustness metric. Integration with the Spring benchmark enables\npublic two-axis evaluations of both accuracy and robustness. We benchmark a\ncurated selection of initial models, observing that accurate models are not\nnecessarily robust and that robustness varies widely by corruption type.\nRobustSpring is a new computer vision benchmark that treats robustness as a\nfirst-class citizen to foster models that combine accuracy with resilience. It\nwill be available at https://spring-benchmark.org.", "authors": ["Jenny Schmalfuss", "Victor Oei", "Lukas Mehl", "Madlen Bartsch", "Shashank Agnihotri", "Margret Keuper", "Andrés Bruhn"], "category": "cs.LG", "updated": "2025-05-14T13:21:34Z"}
{"id": "2505.09425v1", "title": "Independent Component Analysis by Robust Distance Correlation", "link": "http://arxiv.org/abs/2505.09425v1", "summary": "Independent component analysis (ICA) is a powerful tool for decomposing a\nmultivariate signal or distribution into fully independent sources, not just\nuncorrelated ones. Unfortunately, most approaches to ICA are not robust against\noutliers. Here we propose a robust ICA method called RICA, which estimates the\ncomponents by minimizing a robust measure of dependence between multivariate\nrandom variables. The dependence measure used is the distance correlation\n(dCor). In order to make it more robust we first apply a new transformation\ncalled the bowl transform, which is bounded, one-to-one, continuous, and maps\nfar outliers to points close to the origin. This preserves the crucial property\nthat a zero dCor implies independence. RICA estimates the independent sources\nsequentially, by looking for the component that has the smallest dCor with the\nremainder. RICA is strongly consistent and has the usual parametric rate of\nconvergence. Its robustness is investigated by a simulation study, in which it\ngenerally outperforms its competitors. The method is illustrated on three\napplications, including the well-known cocktail party problem.", "authors": ["Sarah Leyder", "Jakob Raymaekers", "Peter J. Rousseeuw", "Tom Van Deuren", "Tim Verdonck"], "category": "cs.LG", "updated": "2025-05-14T14:25:43Z"}
{"id": "2505.09427v1", "title": "SafePath: Conformal Prediction for Safe LLM-Based Autonomous Navigation", "link": "http://arxiv.org/abs/2505.09427v1", "summary": "Large Language Models (LLMs) show growing promise in autonomous driving by\nreasoning over complex traffic scenarios to generate path plans. However, their\ntendencies toward overconfidence, and hallucinations raise critical safety\nconcerns. We introduce SafePath, a modular framework that augments LLM-based\npath planning with formal safety guarantees using conformal prediction.\nSafePath operates in three stages. In the first stage, we use an LLM that\ngenerates a set of diverse candidate paths, exploring possible trajectories\nbased on agent behaviors and environmental cues. In the second stage, SafePath\nfilters out high-risk trajectories while guaranteeing that at least one safe\noption is included with a user-defined probability, through a multiple-choice\nquestion-answering formulation that integrates conformal prediction. In the\nfinal stage, our approach selects the path with the lowest expected collision\nrisk when uncertainty is low or delegates control to a human when uncertainty\nis high. We theoretically prove that SafePath guarantees a safe trajectory with\na user-defined probability, and we show how its human delegation rate can be\ntuned to balance autonomy and safety. Extensive experiments on nuScenes and\nHighway-env show that SafePath reduces planning uncertainty by 77\\% and\ncollision rates by up to 70\\%, demonstrating effectiveness in making LLM-driven\npath planning more safer.", "authors": ["Achref Doula", "Max Mühläuser", "Alejandro Sanchez Guinea"], "category": "cs.LG", "updated": "2025-05-14T14:28:24Z"}
{"id": "2505.09430v1", "title": "Train a Multi-Task Diffusion Policy on RLBench-18 in One Day with One GPU", "link": "http://arxiv.org/abs/2505.09430v1", "summary": "We present a method for training multi-task vision-language robotic diffusion\npolicies that reduces training time and memory usage by an order of magnitude.\nThis improvement arises from a previously underexplored distinction between\naction diffusion and the image diffusion techniques that inspired it: image\ngeneration targets are high-dimensional, while robot actions lie in a much\nlower-dimensional space. Meanwhile, the vision-language conditions for action\ngeneration remain high-dimensional. Our approach, Mini-Diffuser, exploits this\nasymmetry by introducing Level-2 minibatching, which pairs multiple noised\naction samples with each vision-language condition, instead of the conventional\none-to-one sampling strategy. To support this batching scheme, we introduce\narchitectural adaptations to the diffusion transformer that prevent information\nleakage across samples while maintaining full conditioning access. In RLBench\nsimulations, Mini-Diffuser achieves 95\\% of the performance of state-of-the-art\nmulti-task diffusion policies, while using only 5\\% of the training time and\n7\\% of the memory. Real-world experiments further validate that Mini-Diffuser\npreserves the key strengths of diffusion-based policies, including the ability\nto model multimodal action distributions and produce behavior conditioned on\ndiverse perceptual inputs. Code available at\ngithub.com/utomm/mini-diffuse-actor.", "authors": ["Yutong Hu", "Pinhao Song", "Kehan Wen", "Renaud Detry"], "category": "cs.LG", "updated": "2025-05-14T14:34:40Z"}
{"id": "2505.09432v1", "title": "Establishing Linear Surrogate Regret Bounds for Convex Smooth Losses via Convolutional Fenche-Young Losses", "link": "http://arxiv.org/abs/2505.09432v1", "summary": "Surrogate regret bounds bridge the gap between the convergence rates of\nsurrogate and target losses, with linear bounds favorable for their lossless\nregret transfer. While convex smooth surrogate losses are appealing in\nparticular due to the efficient estimation and optimization, the existence of a\ntrade-off between the smoothness and linear regret bound has been believed in\nthe community. That being said, the better optimization and estimation\nproperties of convex smooth surrogate losses may inevitably deteriorate after\nundergoing the regret transfer onto a target loss. We overcome this dilemma for\narbitrary discrete target losses by constructing a convex smooth surrogate\nloss, which entails a linear surrogate regret bound composed with a tailored\nprediction link. The construction is based on Fenchel-Young losses generated by\nthe convolutional negentropy, which are equivalent to the infimal convolution\nof a generalized negentropy and the target Bayes risk. Consequently, the\ninfimal convolution enables us to derive a smooth loss while maintaining the\nsurrogate regret bound linear. We additionally benefit from the infimal\nconvolution to have a consistent estimator of the underlying class probability.\nOur results are overall a novel demonstration of how convex analysis penetrates\ninto optimization and statistical efficiency in risk minimization.", "authors": ["Yuzhou Cao", "Han Bao", "Lei Feng", "Bo An"], "category": "cs.LG", "updated": "2025-05-14T14:37:32Z"}
{"id": "2505.09496v1", "title": "Reinforcement Learning for Individual Optimal Policy from Heterogeneous Data", "link": "http://arxiv.org/abs/2505.09496v1", "summary": "Offline reinforcement learning (RL) aims to find optimal policies in dynamic\nenvironments in order to maximize the expected total rewards by leveraging\npre-collected data. Learning from heterogeneous data is one of the fundamental\nchallenges in offline RL. Traditional methods focus on learning an optimal\npolicy for all individuals with pre-collected data from a single episode or\nhomogeneous batch episodes, and thus, may result in a suboptimal policy for a\nheterogeneous population. In this paper, we propose an individualized offline\npolicy optimization framework for heterogeneous time-stationary Markov decision\nprocesses (MDPs). The proposed heterogeneous model with individual latent\nvariables enables us to efficiently estimate the individual Q-functions, and\nour Penalized Pessimistic Personalized Policy Learning (P4L) algorithm\nguarantees a fast rate on the average regret under a weak partial coverage\nassumption on behavior policies. In addition, our simulation studies and a real\ndata application demonstrate the superior numerical performance of the proposed\nmethod compared with existing methods.", "authors": ["Rui Miao", "Babak Shahbaba", "Annie Qu"], "category": "cs.LG", "updated": "2025-05-14T15:44:10Z"}
{"id": "2505.09506v1", "title": "Deep-SITAR: A SITAR-Based Deep Learning Framework for Growth Curve Modeling via Autoencoders", "link": "http://arxiv.org/abs/2505.09506v1", "summary": "Several approaches have been developed to capture the complexity and\nnonlinearity of human growth. One widely used is the Super Imposition by\nTranslation and Rotation (SITAR) model, which has become popular in studies of\nadolescent growth. SITAR is a shape-invariant mixed-effects model that\nrepresents the shared growth pattern of a population using a natural cubic\nspline mean curve while incorporating three subject-specific random effects --\ntiming, size, and growth intensity -- to account for variations among\nindividuals. In this work, we introduce a supervised deep learning framework\nbased on an autoencoder architecture that integrates a deep neural network\n(neural network) with a B-spline model to estimate the SITAR model. In this\napproach, the encoder estimates the random effects for each individual, while\nthe decoder performs a fitting based on B-splines similar to the classic SITAR\nmodel. We refer to this method as the Deep-SITAR model. This innovative\napproach enables the prediction of the random effects of new individuals\nentering a population without requiring a full model re-estimation. As a\nresult, Deep-SITAR offers a powerful approach to predicting growth\ntrajectories, combining the flexibility and efficiency of deep learning with\nthe interpretability of traditional mixed-effects models.", "authors": ["María Alejandra Hernández", "Oscar Rodriguez", "Dae-Jin Lee"], "category": "cs.LG", "updated": "2025-05-14T15:55:16Z"}
{"id": "2505.09546v1", "title": "Distilling Realizable Students from Unrealizable Teachers", "link": "http://arxiv.org/abs/2505.09546v1", "summary": "We study policy distillation under privileged information, where a student\npolicy with only partial observations must learn from a teacher with full-state\naccess. A key challenge is information asymmetry: the student cannot directly\naccess the teacher's state space, leading to distributional shifts and policy\ndegradation. Existing approaches either modify the teacher to produce\nrealizable but sub-optimal demonstrations or rely on the student to explore\nmissing information independently, both of which are inefficient. Our key\ninsight is that the student should strategically interact with the teacher\n--querying only when necessary and resetting from recovery states --to stay on\na recoverable path within its own observation space. We introduce two methods:\n(i) an imitation learning approach that adaptively determines when the student\nshould query the teacher for corrections, and (ii) a reinforcement learning\napproach that selects where to initialize training for efficient exploration.\nWe validate our methods in both simulated and real-world robotic tasks,\ndemonstrating significant improvements over standard teacher-student baselines\nin training efficiency and final performance. The project website is available\nat : https://portal-cornell.github.io/CritiQ_ReTRy/", "authors": ["Yujin Kim", "Nathaniel Chin", "Arnav Vasudev", "Sanjiban Choudhury"], "category": "cs.LG", "updated": "2025-05-14T16:45:51Z"}
{"id": "2505.09602v1", "title": "Adversarial Suffix Filtering: a Defense Pipeline for LLMs", "link": "http://arxiv.org/abs/2505.09602v1", "summary": "Large Language Models (LLMs) are increasingly embedded in autonomous systems\nand public-facing environments, yet they remain susceptible to jailbreak\nvulnerabilities that may undermine their security and trustworthiness.\nAdversarial suffixes are considered to be the current state-of-the-art\njailbreak, consistently outperforming simpler methods and frequently succeeding\neven in black-box settings. Existing defenses rely on access to the internal\narchitecture of models limiting diverse deployment, increase memory and\ncomputation footprints dramatically, or can be bypassed with simple prompt\nengineering methods. We introduce $\\textbf{Adversarial Suffix Filtering}$\n(ASF), a lightweight novel model-agnostic defensive pipeline designed to\nprotect LLMs against adversarial suffix attacks. ASF functions as an input\npreprocessor and sanitizer that detects and filters adversarially crafted\nsuffixes in prompts, effectively neutralizing malicious injections. We\ndemonstrate that ASF provides comprehensive defense capabilities across both\nblack-box and white-box attack settings, reducing the attack efficacy of\nstate-of-the-art adversarial suffix generation methods to below 4%, while only\nminimally affecting the target model's capabilities in non-adversarial\nscenarios.", "authors": ["David Khachaturov", "Robert Mullins"], "category": "cs.LG", "updated": "2025-05-14T17:52:10Z"}
{"id": "2505.09603v1", "title": "DataMIL: Selecting Data for Robot Imitation Learning with Datamodels", "link": "http://arxiv.org/abs/2505.09603v1", "summary": "Recently, the robotics community has amassed ever larger and more diverse\ndatasets to train generalist robot policies. However, while these policies\nachieve strong mean performance across a variety of tasks, they often\nunderperform on individual, specialized tasks and require further tuning on\nnewly acquired task-specific data. Combining task-specific data with carefully\ncurated subsets of large prior datasets via co-training can produce better\nspecialized policies, but selecting data naively may actually harm downstream\nperformance. To address this, we introduce DataMIL, a policy-driven data\nselection framework built on the datamodels paradigm that reasons about data\nselection in an end-to-end manner, using the policy itself to identify which\ndata points will most improve performance. Unlike standard practices that\nfilter data using human notions of quality (e.g., based on semantic or visual\nsimilarity), DataMIL directly optimizes data selection for task success,\nallowing us to select data that enhance the policy while dropping data that\ndegrade it. To avoid performing expensive rollouts in the environment during\nselection, we use a novel surrogate loss function on task-specific data,\nallowing us to use DataMIL in the real world without degrading performance. We\nvalidate our approach on a suite of more than 60 simulation and real-world\nmanipulation tasks - most notably showing successful data selection from the\nOpen X-Embodiment datasets-demonstrating consistent gains in success rates and\nsuperior performance over multiple baselines. Our results underscore the\nimportance of end-to-end, performance-aware data selection for unlocking the\npotential of large prior datasets in robotics. More information at\nhttps://robin-lab.cs.utexas.edu/datamodels4imitation/", "authors": ["Shivin Dass", "Alaa Khaddaj", "Logan Engstrom", "Aleksander Madry", "Andrew Ilyas", "Roberto Martín-Martín"], "category": "cs.LG", "updated": "2025-05-14T17:55:10Z"}
{"id": "2505.09063v1", "title": "Single-shot prediction of parametric partial differential equations", "link": "http://arxiv.org/abs/2505.09063v1", "summary": "We introduce Flexi-VAE, a data-driven framework for efficient single-shot\nforecasting of nonlinear parametric partial differential equations (PDEs),\neliminating the need for iterative time-stepping while maintaining high\naccuracy and stability. Flexi-VAE incorporates a neural propagator that\nadvances latent representations forward in time, aligning latent evolution with\nphysical state reconstruction in a variational autoencoder setting. We evaluate\ntwo propagation strategies, the Direct Concatenation Propagator (DCP) and the\nPositional Encoding Propagator (PEP), and demonstrate, through\nrepresentation-theoretic analysis, that DCP offers superior long-term\ngeneralization by fostering disentangled and physically meaningful latent\nspaces. Geometric diagnostics, including Jacobian spectral analysis, reveal\nthat propagated latent states reside in regions of lower decoder sensitivity\nand more stable local geometry than those derived via direct encoding,\nenhancing robustness for long-horizon predictions. We validate Flexi-VAE on\ncanonical PDE benchmarks, the 1D viscous Burgers equation and the 2D\nadvection-diffusion equation, achieving accurate forecasts across wide\nparametric ranges. The model delivers over 50x CPU and 90x GPU speedups\ncompared to autoencoder-LSTM baselines for large temporal shifts. These results\nposition Flexi-VAE as a scalable and interpretable surrogate modeling tool for\naccelerating high-fidelity simulations in computational fluid dynamics (CFD)\nand other parametric PDE-driven applications, with extensibility to\nhigher-dimensional and more complex systems.", "authors": ["Khalid Rafiq", "Wenjing Liao", "Aditya G. Nair"], "category": "cs.LG", "updated": "2025-05-14T01:48:26Z"}
{"id": "2505.09110v1", "title": "Toward Malicious Clients Detection in Federated Learning", "link": "http://arxiv.org/abs/2505.09110v1", "summary": "Federated learning (FL) enables multiple clients to collaboratively train a\nglobal machine learning model without sharing their raw data. However, the\ndecentralized nature of FL introduces vulnerabilities, particularly to\npoisoning attacks, where malicious clients manipulate their local models to\ndisrupt the training process. While Byzantine-robust aggregation rules have\nbeen developed to mitigate such attacks, they remain inadequate against more\nadvanced threats. In response, recent advancements have focused on FL detection\ntechniques to identify potentially malicious participants. Unfortunately, these\nmethods often misclassify numerous benign clients as threats or rely on\nunrealistic assumptions about the server's capabilities. In this paper, we\npropose a novel algorithm, SafeFL, specifically designed to accurately identify\nmalicious clients in FL. The SafeFL approach involves the server collecting a\nseries of global models to generate a synthetic dataset, which is then used to\ndistinguish between malicious and benign models based on their behavior.\nExtensive testing demonstrates that SafeFL outperforms existing methods,\noffering superior efficiency and accuracy in detecting malicious clients.", "authors": ["Zhihao Dou", "Jiaqi Wang", "Wei Sun", "Zhuqing Liu", "Minghong Fang"], "category": "cs.LG", "updated": "2025-05-14T03:36:36Z"}
{"id": "2505.09218v1", "title": "Birch SGD: A Tree Graph Framework for Local and Asynchronous SGD Methods", "link": "http://arxiv.org/abs/2505.09218v1", "summary": "We propose a new unifying framework, Birch SGD, for analyzing and designing\ndistributed SGD methods. The central idea is to represent each method as a\nweighted directed tree, referred to as a computation tree. Leveraging this\nrepresentation, we introduce a general theoretical result that reduces\nconvergence analysis to studying the geometry of these trees. This perspective\nyields a purely graph-based interpretation of optimization dynamics, offering a\nnew and intuitive foundation for method development. Using Birch SGD, we design\neight new methods and analyze them alongside previously known ones, with at\nleast six of the new methods shown to have optimal computational time\ncomplexity. Our research leads to two key insights: (i) all methods share the\nsame \"iteration rate\" of $O\\left(\\frac{(R + 1) L \\Delta}{\\varepsilon} +\n\\frac{\\sigma^2 L \\Delta}{\\varepsilon^2}\\right)$, where $R$ the maximum \"tree\ndistance\" along the main branch of a tree; and (ii) different methods exhibit\ndifferent trade-offs-for example, some update iterates more frequently,\nimproving practical performance, while others are more communication-efficient\nor focus on other aspects. Birch SGD serves as a unifying framework for\nnavigating these trade-offs. We believe these results provide a unified\nfoundation for understanding, analyzing, and designing efficient asynchronous\nand parallel optimization methods.", "authors": ["Alexander Tyurin", "Danil Sivtsov"], "category": "cs.LG", "updated": "2025-05-14T08:37:45Z"}
{"id": "2505.09229v1", "title": "Optimal Transport-Based Domain Adaptation for Rotated Linear Regression", "link": "http://arxiv.org/abs/2505.09229v1", "summary": "Optimal Transport (OT) has proven effective for domain adaptation (DA) by\naligning distributions across domains with differing statistical properties.\nBuilding on the approach of Courty et al. (2016), who mapped source data to the\ntarget domain for improved model transfer, we focus on a supervised DA problem\ninvolving linear regression models under rotational shifts. This ongoing work\nconsiders cases where source and target domains are related by a\nrotation-common in applications like sensor calibration or image orientation.\nWe show that in $\\mathbb{R}^2$ , when using a p-norm cost with $p $\\ge$ 2$, the\noptimal transport map recovers the underlying rotation. Based on this, we\npropose an algorithm that combines K-means clustering, OT, and singular value\ndecomposition (SVD) to estimate the rotation angle and adapt the regression\nmodel. This method is particularly effective when the target domain is sparsely\nsampled, leveraging abundant source data for improved generalization. Our\ncontributions offer both theoretical and practical insights into OT-based model\nadaptation under geometric transformations.", "authors": ["Brian Britos", "Mathias Bourel"], "category": "cs.LG", "updated": "2025-05-14T09:06:40Z"}
{"id": "2505.09266v1", "title": "Enhanced Photonic Chip Design via Interpretable Machine Learning Techniques", "link": "http://arxiv.org/abs/2505.09266v1", "summary": "Photonic chip design has seen significant advancements with the adoption of\ninverse design methodologies, offering flexibility and efficiency in optimizing\ndevice performance. However, the black-box nature of the optimization\napproaches, such as those used in inverse design in order to minimize a loss\nfunction or maximize coupling efficiency, poses challenges in understanding the\noutputs. This challenge is prevalent in machine learning-based optimization\nmethods, which can suffer from the same lack of transparency. To this end,\ninterpretability techniques address the opacity of optimization models. In this\nwork, we apply interpretability techniques from machine learning, with the aim\nof gaining understanding of inverse design optimization used in designing\nphotonic components, specifically two-mode multiplexers. We base our\nmethodology on the widespread interpretability technique known as local\ninterpretable model-agnostic explanations, or LIME. As a result, LIME-informed\ninsights point us to more effective initial conditions, directly improving\ndevice performance. This demonstrates that interpretability methods can do more\nthan explain models -- they can actively guide and enhance the inverse-designed\nphotonic components. Our results demonstrate the ability of interpretable\ntechniques to reveal underlying patterns in the inverse design process, leading\nto the development of better-performing components.", "authors": ["Lirandë Pira", "Airin Antony", "Nayanthara Prathap", "Daniel Peace", "Jacquiline Romero"], "category": "cs.LG", "updated": "2025-05-14T10:32:50Z"}
{"id": "2505.09304v1", "title": "Adaptive Noise Resilient Keyword Spotting Using One-Shot Learning", "link": "http://arxiv.org/abs/2505.09304v1", "summary": "Keyword spotting (KWS) is a key component of smart devices, enabling\nefficient and intuitive audio interaction. However, standard KWS systems\ndeployed on embedded devices often suffer performance degradation under\nreal-world operating conditions. Resilient KWS systems address this issue by\nenabling dynamic adaptation, with applications such as adding or replacing\nkeywords, adjusting to specific users, and improving noise robustness. However,\ndeploying resilient, standalone KWS systems with low latency on\nresource-constrained devices remains challenging due to limited memory and\ncomputational resources. This study proposes a low computational approach for\ncontinuous noise adaptation of pretrained neural networks used for KWS\nclassification, requiring only 1-shot learning and one epoch. The proposed\nmethod was assessed using two pretrained models and three real-world noise\nsources at signal-to-noise ratios (SNRs) ranging from 24 to -3 dB. The adapted\nmodels consistently outperformed the pretrained models across all scenarios,\nespecially at SNR $\\leq$ 18 dB, achieving accuracy improvements of 4.9% to\n46.0%. These results highlight the efficacy of the proposed methodology while\nbeing lightweight enough for deployment on resource-constrained devices.", "authors": ["Luciano Sebastian Martinez-Rau", "Quynh Nguyen Phuong Vu", "Yuxuan Zhang", "Bengt Oelmann", "Sebastian Bader"], "category": "cs.LG", "updated": "2025-05-14T11:39:47Z"}
{"id": "2505.09315v1", "title": "TransDiffuser: End-to-end Trajectory Generation with Decorrelated Multi-modal Representation for Autonomous Driving", "link": "http://arxiv.org/abs/2505.09315v1", "summary": "In recent years, diffusion model has shown its potential across diverse\ndomains from vision generation to language modeling. Transferring its\ncapabilities to modern autonomous driving systems has also emerged as a\npromising direction.In this work, we propose TransDiffuser, an encoder-decoder\nbased generative trajectory planning model for end-to-end autonomous driving.\nThe encoded scene information serves as the multi-modal conditional input of\nthe denoising decoder. To tackle the mode collapse dilemma in generating\nhigh-quality diverse trajectories, we introduce a simple yet effective\nmulti-modal representation decorrelation optimization mechanism during the\ntraining process.TransDiffuser achieves PDMS of 94.85 on the NAVSIM benchmark,\nsurpassing previous state-of-the-art methods without any anchor-based prior\ntrajectories.", "authors": ["Xuefeng Jiang", "Yuan Ma", "Pengxiang Li", "Leimeng Xu", "Xin Wen", "Kun Zhan", "Zhongpu Xia", "Peng Jia", "XianPeng Lang", "Sheng Sun"], "category": "cs.LG", "updated": "2025-05-14T12:10:41Z"}
{"id": "2505.09326v1", "title": "Accelerating Machine Learning Systems via Category Theory: Applications to Spherical Attention for Gene Regulatory Networks", "link": "http://arxiv.org/abs/2505.09326v1", "summary": "How do we enable artificial intelligence models to improve themselves? This\nis central to exponentially improving generalized artificial intelligence\nmodels, which can improve their own architecture to handle new problem domains\nin an efficient manner that leverages the latest hardware. However, current\nautomated compilation methods are poor, and efficient algorithms require years\nof human development. In this paper, we use neural circuit diagrams, based in\ncategory theory, to prove a general theorem related to deep learning\nalgorithms, guide the development of a novel attention algorithm catered to the\ndomain of gene regulatory networks, and produce a corresponding efficient\nkernel. The algorithm we propose, spherical attention, shows that neural\ncircuit diagrams enable a principled and systematic method for reasoning about\ndeep learning architectures and providing high-performance code. By replacing\nSoftMax with an $L^2$ norm as suggested by diagrams, it overcomes the special\nfunction unit bottleneck of standard attention while retaining the streaming\nproperty essential to high-performance. Our diagrammatically derived\n\\textit{FlashSign} kernel achieves comparable performance to the\nstate-of-the-art, fine-tuned FlashAttention algorithm on an A100, and\n$3.6\\times$ the performance of PyTorch. Overall, this investigation shows\nneural circuit diagrams' suitability as a high-level framework for the\nautomated development of efficient, novel artificial intelligence\narchitectures.", "authors": ["Vincent Abbott", "Kotaro Kamiya", "Gerard Glowacki", "Yu Atsumi", "Gioele Zardini", "Yoshihiro Maruyama"], "category": "cs.LG", "updated": "2025-05-14T12:24:22Z"}
{"id": "2505.09364v1", "title": "Diffusion Recommender Models and the Illusion of Progress: A Concerning Study of Reproducibility and a Conceptual Mismatch", "link": "http://arxiv.org/abs/2505.09364v1", "summary": "Countless new machine learning models are published every year and are\nreported to significantly advance the state-of-the-art in \\emph{top-n}\nrecommendation. However, earlier reproducibility studies indicate that progress\nin this area may be quite limited. Specifically, various widespread\nmethodological issues, e.g., comparisons with untuned baseline models, have led\nto an \\emph{illusion of progress}. In this work, our goal is to examine whether\nthese problems persist in today's research. To this end, we aim to reproduce\nthe latest advancements reported from applying modern Denoising Diffusion\nProbabilistic Models to recommender systems, focusing on four models published\nat the top-ranked SIGIR conference in 2023 and 2024. Our findings are\nconcerning, revealing persistent methodological problems. Alarmingly, through\nexperiments, we find that the latest recommendation techniques based on\ndiffusion models, despite their computational complexity and substantial carbon\nfootprint, are consistently outperformed by simpler existing models.\nFurthermore, we identify key mismatches between the characteristics of\ndiffusion models and those of the traditional \\emph{top-n} recommendation task,\nraising doubts about their suitability for recommendation. We also note that,\nin the papers we analyze, the generative capabilities of these models are\nconstrained to a minimum. Overall, our results and continued methodological\nissues call for greater scientific rigor and a disruptive change in the\nresearch and publication culture in this area.", "authors": ["Michael Benigni", "Maurizio Ferrari Dacrema", "Dietmar Jannach"], "category": "cs.LG", "updated": "2025-05-14T13:13:53Z"}
{"id": "2505.09365v1", "title": "ARCANE -- Early Detection of Interplanetary Coronal Mass Ejections", "link": "http://arxiv.org/abs/2505.09365v1", "summary": "Interplanetary coronal mass ejections (ICMEs) are major drivers of space\nweather disturbances, posing risks to both technological infrastructure and\nhuman activities. Automatic detection of ICMEs in solar wind in situ data is\nessential for early warning systems. While several methods have been proposed\nto identify these structures in time series data, robust real-time detection\nremains a significant challenge. In this work, we present ARCANE - the first\nframework explicitly designed for early ICME detection in streaming solar wind\ndata under realistic operational constraints, enabling event identification\nwithout requiring observation of the full structure. Our approach evaluates the\nstrengths and limitations of detection models by comparing a machine\nlearning-based method to a threshold-based baseline. The ResUNet++ model,\npreviously validated on science data, significantly outperforms the baseline,\nparticularly in detecting high-impact events, while retaining solid performance\non lower-impact cases. Notably, we find that using real-time solar wind (RTSW)\ndata instead of high-resolution science data leads to only minimal performance\ndegradation. Despite the challenges of operational settings, our detection\npipeline achieves an F1 score of 0.53, with an average detection delay of 21.5%\nof the event's duration while only seeing a minimal amount of data. As more\ndata becomes available, the performance increases significantly. These results\nmark a substantial step forward in automated space weather monitoring and lay\nthe groundwork for enhanced real-time forecasting capabilities.", "authors": ["H. T. Rüdisser", "G. Nguyen", "J. Le Louëdec", "C. Möstl"], "category": "cs.LG", "updated": "2025-05-14T13:17:45Z"}
{"id": "2505.09516v1", "title": "Depth-Based Local Center Clustering: A Framework for Handling Different Clustering Scenarios", "link": "http://arxiv.org/abs/2505.09516v1", "summary": "Cluster analysis, or clustering, plays a crucial role across numerous\nscientific and engineering domains. Despite the wealth of clustering methods\nproposed over the past decades, each method is typically designed for specific\nscenarios and presents certain limitations in practical applications. In this\npaper, we propose depth-based local center clustering (DLCC). This novel method\nmakes use of data depth, which is known to produce a center-outward ordering of\nsample points in a multivariate space. However, data depth typically fails to\ncapture the multimodal characteristics of {data}, something of the utmost\nimportance in the context of clustering. To overcome this, DLCC makes use of a\nlocal version of data depth that is based on subsets of {data}. From this,\nlocal centers can be identified as well as clusters of varying shapes.\nFurthermore, we propose a new internal metric based on density-based clustering\nto evaluate clustering performance on {non-convex clusters}. Overall, DLCC is a\nflexible clustering approach that seems to overcome some limitations of\ntraditional clustering methods, thereby enhancing data analysis capabilities\nacross a wide range of application scenarios.", "authors": ["Siyi Wang", "Alexandre Leblanc", "Paul D. McNicholas"], "category": "cs.LG", "updated": "2025-05-14T16:08:11Z"}
{"id": "2505.09529v1", "title": "Contactless Cardiac Pulse Monitoring Using Event Cameras", "link": "http://arxiv.org/abs/2505.09529v1", "summary": "Time event cameras are a novel technology for recording scene information at\nextremely low latency and with low power consumption. Event cameras output a\nstream of events that encapsulate pixel-level light intensity changes within\nthe scene, capturing information with a higher dynamic range and temporal\nresolution than traditional cameras. This study investigates the contact-free\nreconstruction of an individual's cardiac pulse signal from time event\nrecording of their face using a supervised convolutional neural network (CNN)\nmodel. An end-to-end model is trained to extract the cardiac signal from a\ntwo-dimensional representation of the event stream, with model performance\nevaluated based on the accuracy of the calculated heart rate. The experimental\nresults confirm that physiological cardiac information in the facial region is\neffectively preserved within the event stream, showcasing the potential of this\nnovel sensor for remote heart rate monitoring. The model trained on event\nframes achieves a root mean square error (RMSE) of 3.32 beats per minute (bpm)\ncompared to the RMSE of 2.92 bpm achieved by the baseline model trained on\nstandard camera frames. Furthermore, models trained on event frames generated\nat 60 and 120 FPS outperformed the 30 FPS standard camera results, achieving an\nRMSE of 2.54 and 2.13 bpm, respectively.", "authors": ["Mohamed Moustafa", "Joseph Lemley", "Peter Corcoran"], "category": "cs.LG", "updated": "2025-05-14T16:24:22Z"}
{"id": "2505.09552v1", "title": "Scalable Computations for Generalized Mixed Effects Models with Crossed Random Effects Using Krylov Subspace Methods", "link": "http://arxiv.org/abs/2505.09552v1", "summary": "Mixed effects models are widely used for modeling data with hierarchically\ngrouped structures and high-cardinality categorical predictor variables.\nHowever, for high-dimensional crossed random effects, current standard\ncomputations relying on Cholesky decompositions can become prohibitively slow.\nIn this work, we present novel Krylov subspace-based methods that address\nseveral existing computational bottlenecks. Among other things, we\ntheoretically analyze and empirically evaluate various preconditioners for the\nconjugate gradient and stochastic Lanczos quadrature methods, derive new\nconvergence results, and develop computationally efficient methods for\ncalculating predictive variances. Extensive experiments using simulated and\nreal-world data sets show that our proposed methods scale much better than\nCholesky-based computations, for instance, achieving a runtime reduction of\napproximately two orders of magnitudes for both estimation and prediction.\nMoreover, our software implementation is up to 10'000 times faster and more\nstable than state-of-the-art implementations such as lme4 and glmmTMB when\nusing default settings. Our methods are implemented in the free C++ software\nlibrary GPBoost with high-level Python and R packages.", "authors": ["Pascal Kündig", "Fabio Sigrist"], "category": "cs.LG", "updated": "2025-05-14T16:50:19Z"}
{"id": "2505.09572v1", "title": "SAD Neural Networks: Divergent Gradient Flows and Asymptotic Optimality via o-minimal Structures", "link": "http://arxiv.org/abs/2505.09572v1", "summary": "We study gradient flows for loss landscapes of fully connected feed forward\nneural networks with commonly used continuously differentiable activation\nfunctions such as the logistic, hyperbolic tangent, softplus or GELU function.\nWe prove that the gradient flow either converges to a critical point or\ndiverges to infinity while the loss converges to an asymptotic critical value.\nMoreover, we prove the existence of a threshold $\\varepsilon>0$ such that the\nloss value of any gradient flow initialized at most $\\varepsilon$ above the\noptimal level converges to it. For polynomial target functions and sufficiently\nbig architecture and data set, we prove that the optimal loss value is zero and\ncan only be realized asymptotically. From this setting, we deduce our main\nresult that any gradient flow with sufficiently good initialization diverges to\ninfinity. Our proof heavily relies on the geometry of o-minimal structures. We\nconfirm these theoretical findings with numerical experiments and extend our\ninvestigation to real-world scenarios, where we observe an analogous behavior.", "authors": ["Julian Kranz", "Davide Gallon", "Steffen Dereich", "Arnulf Jentzen"], "category": "cs.LG", "updated": "2025-05-14T17:15:11Z"}
{"id": "2505.09098v1", "title": "Statistical Mean Estimation with Coded Relayed Observations", "link": "http://arxiv.org/abs/2505.09098v1", "summary": "We consider a problem of statistical mean estimation in which the samples are\nnot observed directly, but are instead observed by a relay (``teacher'') that\ntransmits information through a memoryless channel to the decoder\n(``student''), who then produces the final estimate. We consider the minimax\nestimation error in the large deviations regime, and establish achievable error\nexponents that are tight in broad regimes of the estimation accuracy and\nchannel quality. In contrast, two natural baseline methods are shown to yield\nstrictly suboptimal error exponents. We initially focus on Bernoulli sources\nand binary symmetric channels, and then generalize to sub-Gaussian and\nheavy-tailed settings along with arbitrary discrete memoryless channels.", "authors": ["Yan Hao Ling", "Zhouhao Yang", "Jonathan Scarlett"], "category": "cs.LG", "updated": "2025-05-14T03:07:05Z"}
{"id": "2505.09471v1", "title": "Fairness-aware Bayes optimal functional classification", "link": "http://arxiv.org/abs/2505.09471v1", "summary": "Algorithmic fairness has become a central topic in machine learning, and\nmitigating disparities across different subpopulations has emerged as a rapidly\ngrowing research area. In this paper, we systematically study the\nclassification of functional data under fairness constraints, ensuring the\ndisparity level of the classifier is controlled below a pre-specified\nthreshold. We propose a unified framework for fairness-aware functional\nclassification, tackling an infinite-dimensional functional space, addressing\nkey challenges from the absence of density ratios and intractability of\nposterior probabilities, and discussing unique phenomena in functional\nclassification. We further design a post-processing algorithm, Fair Functional\nLinear Discriminant Analysis classifier (Fair-FLDA), which targets at\nhomoscedastic Gaussian processes and achieves fairness via group-wise\nthresholding. Under weak structural assumptions on eigenspace, theoretical\nguarantees on fairness and excess risk controls are established. As a\nbyproduct, our results cover the excess risk control of the standard FLDA as a\nspecial case, which, to the best of our knowledge, is first time seen. Our\ntheoretical findings are complemented by extensive numerical experiments on\nsynthetic and real datasets, highlighting the practicality of our designed\nalgorithm.", "authors": ["Xiaoyu Hu", "Gengyu Xue", "Zhenhua Lin", "Yi Yu"], "category": "cs.LG", "updated": "2025-05-14T15:22:09Z"}
{"id": "2505.09612v1", "title": "Adaptively-weighted Nearest Neighbors for Matrix Completion", "link": "http://arxiv.org/abs/2505.09612v1", "summary": "In this technical note, we introduce and analyze AWNN: an adaptively weighted\nnearest neighbor method for performing matrix completion. Nearest neighbor (NN)\nmethods are widely used in missing data problems across multiple disciplines\nsuch as in recommender systems and for performing counterfactual inference in\npanel data settings. Prior works have shown that in addition to being very\nintuitive and easy to implement, NN methods enjoy nice theoretical guarantees.\nHowever, the performance of majority of the NN methods rely on the appropriate\nchoice of the radii and the weights assigned to each member in the nearest\nneighbor set and despite several works on nearest neighbor methods in the past\ntwo decades, there does not exist a systematic approach of choosing the radii\nand the weights without relying on methods like cross-validation. AWNN\naddresses this challenge by judiciously balancing the bias variance trade off\ninherent in weighted nearest-neighbor regression. We provide theoretical\nguarantees for the proposed method under minimal assumptions and support the\ntheory via synthetic experiments.", "authors": ["Tathagata Sadhukhan", "Manit Paul", "Raaz Dwivedi"], "category": "cs.LG", "updated": "2025-05-14T17:59:17Z"}
{"id": "2505.09056v1", "title": "A Comprehensive Analysis of Large Language Model Outputs: Similarity, Diversity, and Bias", "link": "http://arxiv.org/abs/2505.09056v1", "summary": "Large Language Models (LLMs) represent a major step toward artificial general\nintelligence, significantly advancing our ability to interact with technology.\nWhile LLMs perform well on Natural Language Processing tasks -- such as\ntranslation, generation, code writing, and summarization -- questions remain\nabout their output similarity, variability, and ethical implications. For\ninstance, how similar are texts generated by the same model? How does this\ncompare across different models? And which models best uphold ethical\nstandards? To investigate, we used 5{,}000 prompts spanning diverse tasks like\ngeneration, explanation, and rewriting. This resulted in approximately 3\nmillion texts from 12 LLMs, including proprietary and open-source systems from\nOpenAI, Google, Microsoft, Meta, and Mistral. Key findings include: (1) outputs\nfrom the same LLM are more similar to each other than to human-written texts;\n(2) models like WizardLM-2-8x22b generate highly similar outputs, while GPT-4\nproduces more varied responses; (3) LLM writing styles differ significantly,\nwith Llama 3 and Mistral showing higher similarity, and GPT-4 standing out for\ndistinctiveness; (4) differences in vocabulary and tone underscore the\nlinguistic uniqueness of LLM-generated content; (5) some LLMs demonstrate\ngreater gender balance and reduced bias. These results offer new insights into\nthe behavior and diversity of LLM outputs, helping guide future development and\nethical evaluation.", "authors": ["Brandon Smith", "Mohamed Reda Bouadjenek", "Tahsin Alamgir Kheya", "Phillip Dawson", "Sunil Aryal"], "category": "cs.CL", "updated": "2025-05-14T01:21:46Z"}
{"id": "2505.09269v1", "title": "How an unintended Side Effect of a Research Project led to Boosting the Power of UML", "link": "http://arxiv.org/abs/2505.09269v1", "summary": "This paper describes the design, implementation and use of a new UML modeling\ntool that represents a significant advance over conventional tools. Among other\nthings, it allows the integration of class diagrams and object diagrams as well\nas the execution of objects. This not only enables new software architectures\ncharacterized by the integration of software with corresponding object models,\nbut is also ideal for use in teaching, as it provides students with a\nparticularly stimulating learning experience. A special feature of the project\nis that it has emerged from a long-standing international research project,\nwhich is aimed at a comprehensive multi-level architecture. The project is\ntherefore an example of how research can lead to valuable results that arise as\na side effect of other work.", "authors": ["Ulrich Frank", "Pierre Maier"], "category": "cs.CL", "updated": "2025-05-14T10:38:37Z"}
{"id": "2505.09286v1", "title": "A Scalable Unsupervised Framework for multi-aspect labeling of Multilingual and Multi-Domain Review Data", "link": "http://arxiv.org/abs/2505.09286v1", "summary": "Effectively analyzing online review data is essential across industries.\nHowever, many existing studies are limited to specific domains and languages or\ndepend on supervised learning approaches that require large-scale labeled\ndatasets. To address these limitations, we propose a multilingual, scalable,\nand unsupervised framework for cross-domain aspect detection. This framework is\ndesigned for multi-aspect labeling of multilingual and multi-domain review\ndata. In this study, we apply automatic labeling to Korean and English review\ndatasets spanning various domains and assess the quality of the generated\nlabels through extensive experiments. Aspect category candidates are first\nextracted through clustering, and each review is then represented as an\naspect-aware embedding vector using negative sampling. To evaluate the\nframework, we conduct multi-aspect labeling and fine-tune several pretrained\nlanguage models to measure the effectiveness of the automatically generated\nlabels. Results show that these models achieve high performance, demonstrating\nthat the labels are suitable for training. Furthermore, comparisons with\npublicly available large language models highlight the framework's superior\nconsistency and scalability when processing large-scale data. A human\nevaluation also confirms that the quality of the automatic labels is comparable\nto those created manually. This study demonstrates the potential of a robust\nmulti-aspect labeling approach that overcomes limitations of supervised methods\nand is adaptable to multilingual, multi-domain environments. Future research\nwill explore automatic review summarization and the integration of artificial\nintelligence agents to further improve the efficiency and depth of review\nanalysis.", "authors": ["Jiin Park", "Misuk Kim"], "category": "cs.CL", "updated": "2025-05-14T11:11:17Z"}
{"id": "2505.09338v1", "title": "Llama See, Llama Do: A Mechanistic Perspective on Contextual Entrainment and Distraction in LLMs", "link": "http://arxiv.org/abs/2505.09338v1", "summary": "We observe a novel phenomenon, contextual entrainment, across a wide range of\nlanguage models (LMs) and prompt settings, providing a new mechanistic\nperspective on how LMs become distracted by ``irrelevant'' contextual\ninformation in the input prompt. Specifically, LMs assign significantly higher\nlogits (or probabilities) to any tokens that have previously appeared in the\ncontext prompt, even for random tokens. This suggests that contextual\nentrainment is a mechanistic phenomenon, occurring independently of the\nrelevance or semantic relation of the tokens to the question or the rest of the\nsentence. We find statistically significant evidence that the magnitude of\ncontextual entrainment is influenced by semantic factors. Counterfactual\nprompts have a greater effect compared to factual ones, suggesting that while\ncontextual entrainment is a mechanistic phenomenon, it is modulated by semantic\nfactors.\n  We hypothesise that there is a circuit of attention heads -- the entrainment\nheads -- that corresponds to the contextual entrainment phenomenon. Using a\nnovel entrainment head discovery method based on differentiable masking, we\nidentify these heads across various settings. When we ``turn off'' these heads,\ni.e., set their outputs to zero, the effect of contextual entrainment is\nsignificantly attenuated, causing the model to generate output that capitulates\nto what it would produce if no distracting context were provided. Our discovery\nof contextual entrainment, along with our investigation into LM distraction via\nthe entrainment heads, marks a key step towards the mechanistic analysis and\nmitigation of the distraction problem.", "authors": ["Jingcheng Niu", "Xingdi Yuan", "Tong Wang", "Hamidreza Saghir", "Amir H. Abdi"], "category": "cs.CL", "updated": "2025-05-14T12:33:05Z"}
{"id": "2505.09388v1", "title": "Qwen3 Technical Report", "link": "http://arxiv.org/abs/2505.09388v1", "summary": "In this work, we present Qwen3, the latest version of the Qwen model family.\nQwen3 comprises a series of large language models (LLMs) designed to advance\nperformance, efficiency, and multilingual capabilities. The Qwen3 series\nincludes models of both dense and Mixture-of-Expert (MoE) architectures, with\nparameter scales ranging from 0.6 to 235 billion. A key innovation in Qwen3 is\nthe integration of thinking mode (for complex, multi-step reasoning) and\nnon-thinking mode (for rapid, context-driven responses) into a unified\nframework. This eliminates the need to switch between different models--such as\nchat-optimized models (e.g., GPT-4o) and dedicated reasoning models (e.g.,\nQwQ-32B)--and enables dynamic mode switching based on user queries or chat\ntemplates. Meanwhile, Qwen3 introduces a thinking budget mechanism, allowing\nusers to allocate computational resources adaptively during inference, thereby\nbalancing latency and performance based on task complexity. Moreover, by\nleveraging the knowledge from the flagship models, we significantly reduce the\ncomputational resources required to build smaller-scale models, while ensuring\ntheir highly competitive performance. Empirical evaluations demonstrate that\nQwen3 achieves state-of-the-art results across diverse benchmarks, including\ntasks in code generation, mathematical reasoning, agent tasks, etc.,\ncompetitive against larger MoE models and proprietary models. Compared to its\npredecessor Qwen2.5, Qwen3 expands multilingual support from 29 to 119\nlanguages and dialects, enhancing global accessibility through improved\ncross-lingual understanding and generation capabilities. To facilitate\nreproducibility and community-driven research and development, all Qwen3 models\nare publicly accessible under Apache 2.0.", "authors": ["An Yang", "Anfeng Li", "Baosong Yang", "Beichen Zhang", "Binyuan Hui", "Bo Zheng", "Bowen Yu", "Chang Gao", "Chengen Huang", "Chenxu Lv", "Chujie Zheng", "Dayiheng Liu", "Fan Zhou", "Fei Huang", "Feng Hu", "Hao Ge", "Haoran Wei", "Huan Lin", "Jialong Tang", "Jian Yang", "Jianhong Tu", "Jianwei Zhang", "Jianxin Yang", "Jiaxi Yang", "Jing Zhou", "Jingren Zhou", "Junyang Lin", "Kai Dang", "Keqin Bao", "Kexin Yang", "Le Yu", "Lianghao Deng", "Mei Li", "Mingfeng Xue", "Mingze Li", "Pei Zhang", "Peng Wang", "Qin Zhu", "Rui Men", "Ruize Gao", "Shixuan Liu", "Shuang Luo", "Tianhao Li", "Tianyi Tang", "Wenbiao Yin", "Xingzhang Ren", "Xinyu Wang", "Xinyu Zhang", "Xuancheng Ren", "Yang Fan", "Yang Su", "Yichang Zhang", "Yinger Zhang", "Yu Wan", "Yuqiong Liu", "Zekun Wang", "Zeyu Cui", "Zhenru Zhang", "Zhipeng Zhou", "Zihan Qiu"], "category": "cs.CL", "updated": "2025-05-14T13:41:34Z"}
{"id": "2505.09519v1", "title": "PT-MoE: An Efficient Finetuning Framework for Integrating Mixture-of-Experts into Prompt Tuning", "link": "http://arxiv.org/abs/2505.09519v1", "summary": "Parameter-efficient fine-tuning (PEFT) methods have shown promise in adapting\nlarge language models, yet existing approaches exhibit counter-intuitive\nphenomena: integrating router into prompt tuning (PT) increases training\nefficiency yet does not improve performance universally; parameter reduction\nthrough matrix decomposition can improve performance in specific domains.\nMotivated by these observations and the modular nature of PT, we propose\nPT-MoE, a novel framework that integrates matrix decomposition with\nmixture-of-experts (MoE) routing for efficient PT. Results across 17 datasets\ndemonstrate that PT-MoE achieves state-of-the-art performance in both question\nanswering (QA) and mathematical problem solving tasks, improving F1 score by\n1.49 points over PT and 2.13 points over LoRA in QA tasks, while enhancing\nmathematical accuracy by 10.75 points over PT and 0.44 points over LoRA, all\nwhile using 25% fewer parameters than LoRA. Our analysis reveals that while PT\nmethods generally excel in QA tasks and LoRA-based methods in math datasets,\nthe integration of matrix decomposition and MoE in PT-MoE yields complementary\nbenefits: decomposition enables efficient parameter sharing across experts\nwhile MoE provides dynamic adaptation, collectively enabling PT-MoE to\ndemonstrate cross-task consistency and generalization abilities. These\nfindings, along with ablation studies on routing mechanisms and architectural\ncomponents, provide insights for future PEFT methods.", "authors": ["Zongqian Li", "Yixuan Su", "Nigel Collier"], "category": "cs.CL", "updated": "2025-05-14T16:16:36Z"}
{"id": "2505.09068v1", "title": "S-DAT: A Multilingual, GenAI-Driven Framework for Automated Divergent Thinking Assessment", "link": "http://arxiv.org/abs/2505.09068v1", "summary": "This paper introduces S-DAT (Synthetic-Divergent Association Task), a\nscalable, multilingual framework for automated assessment of divergent thinking\n(DT) -a core component of human creativity. Traditional creativity assessments\nare often labor-intensive, language-specific, and reliant on subjective human\nratings, limiting their scalability and cross-cultural applicability. In\ncontrast, S-DAT leverages large language models and advanced multilingual\nembeddings to compute semantic distance -- a language-agnostic proxy for DT. We\nevaluate S-DAT across eleven diverse languages, including English, Spanish,\nGerman, Russian, Hindi, and Japanese (Kanji, Hiragana, Katakana), demonstrating\nrobust and consistent scoring across linguistic contexts. Unlike prior DAT\napproaches, the S-DAT shows convergent validity with other DT measures and\ncorrect discriminant validity with convergent thinking. This cross-linguistic\nflexibility allows for more inclusive, global-scale creativity research,\naddressing key limitations of earlier approaches. S-DAT provides a powerful\ntool for fairer, more comprehensive evaluation of cognitive flexibility in\ndiverse populations and can be freely assessed online:\nhttps://sdat.iol.zib.de/.", "authors": ["Jennifer Haase", "Paul H. P. Hanel", "Sebastian Pokutta"], "category": "cs.CL", "updated": "2025-05-14T02:08:40Z"}
{"id": "2505.09316v1", "title": "Scent of Knowledge: Optimizing Search-Enhanced Reasoning with Information Foraging", "link": "http://arxiv.org/abs/2505.09316v1", "summary": "Augmenting large language models (LLMs) with external retrieval has become a\nstandard method to address their inherent knowledge cutoff limitations.\nHowever, traditional retrieval-augmented generation methods employ static,\npre-inference retrieval strategies, making them inadequate for complex tasks\ninvolving ambiguous, multi-step, or evolving information needs. Recent advances\nin test-time scaling techniques have demonstrated significant potential in\nenabling LLMs to dynamically interact with external tools, motivating the shift\ntoward adaptive inference-time retrieval. Inspired by Information Foraging\nTheory (IFT), we propose InForage, a reinforcement learning framework that\nformalizes retrieval-augmented reasoning as a dynamic information-seeking\nprocess. Unlike existing approaches, InForage explicitly rewards intermediate\nretrieval quality, encouraging LLMs to iteratively gather and integrate\ninformation through adaptive search behaviors. To facilitate training, we\nconstruct a human-guided dataset capturing iterative search and reasoning\ntrajectories for complex, real-world web tasks. Extensive evaluations across\ngeneral question answering, multi-hop reasoning tasks, and a newly developed\nreal-time web QA dataset demonstrate InForage's superior performance over\nbaseline methods. These results highlight InForage's effectiveness in building\nrobust, adaptive, and efficient reasoning agents.", "authors": ["Hongjin Qian", "Zheng Liu"], "category": "cs.CL", "updated": "2025-05-14T12:13:38Z"}
{"id": "2505.09083v1", "title": "Ornithologist: Towards Trustworthy \"Reasoning\" about Central Bank Communications", "link": "http://arxiv.org/abs/2505.09083v1", "summary": "I develop Ornithologist, a weakly-supervised textual classification system\nand measure the hawkishness and dovishness of central bank text. Ornithologist\nuses ``taxonomy-guided reasoning'', guiding a large language model with\nhuman-authored decision trees. This increases the transparency and\nexplainability of the system and makes it accessible to non-experts. It also\nreduces hallucination risk. Since it requires less supervision than traditional\nclassification systems, it can more easily be applied to other problems or\nsources of text (e.g. news) without much modification. Ornithologist\nmeasurements of hawkishness and dovishness of RBA communication carry\ninformation about the future of the cash rate path and of market expectations.", "authors": ["Dominic Zaun Eu Jones"], "category": "cs.CL", "updated": "2025-05-14T02:36:26Z"}
