{"id": "2505.09187v1", "title": "Wavefunction-Free Approach for Predicting Nonlinear Responses in Weyl Semimetals", "link": "http://arxiv.org/abs/2505.09187v1", "summary": "By sidestepping the intractable calculations of many-body wavefunctions,\ndensity functional theory (DFT) has revolutionized the prediction of ground\nstates of materials. However, predicting nonlinear responses--critical for\nnext-generation quantum devices--still relies heavily on explicit\nwavefunctions, limiting computational efficiency. In this letter, using the\ncircular photogalvanic effect (CPGE) in Weyl semimetals as a representative\nexample, we realize a 1000-fold computational speedup by eliminating the\nexplicit dependence on wavefunctions. Our approach leverages the one-to-one\ncorrespondence between free parameters of Weyl fermions and the associated\nresponses to obtain precise wavefunction-free formulations. Applying our\nmethodology, we systematically investigated known Weyl semimetals and revealed\nthat Ta$_3$S$_2$ exhibits photocurrents an order of magnitude greater than\nthose observed in TaAs, with potential for an additional order-of-magnitude\nenhancement under strain. Our work paves the way for substantially more\nefficient screening and optimization of nonlinear electromagnetic properties of\ntopological quantum materials.", "authors": ["Mohammad Yahyavi", "Ilya Belopolski", "Yuanjun Jin", "Md Shafayat Hossain", "Yilin Zhao", "Jinyang Ni", "Naizhou Wang", "Yi-Chun Hung", "Zi-Jia Cheng", "Tyler A. Cochran", "Tay-Rong Chang", "Wei-bo Gao", "Su-Yang Xu", "Jia-Xin Yin", "Qiong Ma", "M. Zahid Hasan", "Arun Bansil", "Naoto Nagaosa", "Guoqing Chang"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T06:32:11Z", "summary_ja": "多体波動関数の扱いにくい計算を回避することで、密度汎関数理論（DFT）は材料の基底状態の予測に革命をもたらした。しかし、次世代量子デバイスに不可欠な非線形応答の予測は、依然として明示的な波動関数に大きく依存しており、計算効率を制限している。本論文では、ワイル半金属における円偏光光起電力効果（CPGE）を代表的な例として、波動関数への明示的な依存性を排除することで、1000倍の計算速度向上を実現した。我々のアプローチは、ワイルフェルミオンの自由パラメータとそれに関連する応答との間の1対1の対応を利用して、正確な波動関数フリーの定式化を得る。この方法論を適用し、既知のワイル半金属を系統的に調査した結果、Ta$_3$S$_2$はTaAsで観察されたものよりも一桁大きい光電流を示し、歪みを加えることでさらにもう一桁の増強の可能性があることが明らかになった。我々の研究は、トポロジカル量子材料の非線形電磁特性の大幅に効率的なスクリーニングと最適化への道を開くものである。"}
{"id": "2505.09161v1", "title": "Bridging Theory and Experiment in Materials Discovery: Machine-Learning-Assisted Prediction of Synthesizable Structures", "link": "http://arxiv.org/abs/2505.09161v1", "summary": "Even though thermodynamic energy-based crystal structure prediction (CSP) has\nrevolutionized materials discovery, the energy-driven CSP approaches often\nstruggle to identify experimentally realizable metastable materials synthesized\nthrough kinetically controlled pathways, creating a critical gap between\ntheoretical predictions and experimental synthesis. Here, we propose a\nsynthesizability-driven CSP framework that integrates symmetry-guided structure\nderivation with a Wyckoff encode-based machine-learning model, allowing for the\nefficient localization of subspaces likely to yield highly synthesizable\nstructures. Within the identified promising subspaces, a structure-based\nsynthesizability evaluation model, fine-tuned using recently synthesized\nstructures to enhance predictive accuracy, is employed in conjunction with ab\ninitio calculations to systematically identify synthesizable candidates. The\nframework successfully reproduces 13 experimentally known XSe (X = Sc, Ti, Mn,\nFe, Ni, Cu, Zn) structures, demonstrating its effectiveness in predicting\nsynthesizable structures. Notably, 92,310 structures are filtered from the\n554,054 candidates predicted by GNoME, exhibiting great potential for promising\nsynthesizability. Additionally, eight thermodynamically favorable Hf-X-O (X =\nTi, V, and Mn) structures have been identified, among which three HfV$_2$O$_7$\ncandidates exhibit high synthesizability, presenting viable candidates for\nexperimental realization and potentially associated with experimentally\nobserved temperature-induced phase transitions. This work establishes a\ndata-driven paradigm for machine-learning-assisted inorganic materials\nsynthesis, highlighting its potential to bridge the gap between computational\npredictions and experimental realization while unlocking new opportunities for\nthe targeted discovery of novel functional materials.", "authors": ["Yu Xin", "Peng Liu", "Zhuohang Xie", "Wenhui Mi", "Pengyue Gao", "Hong Jian Zhao", "Jian Lv", "Yanchao Wang", "Yanming Ma"], "category": "cs.LG", "updated": "2025-05-14T05:48:55Z", "summary_ja": "熱力学的エネルギーに基づく結晶構造予測（CSP）は材料発見に革命をもたらしましたが、エネルギー主導のCSPアプローチは、速度論的に制御された経路で合成される実験的に実現可能な準安定物質の特定に苦労することが多く、理論的予測と実験的合成の間に重大なギャップが生じています。本研究では、対称性に基づいた構造導出と、Wyckoffエンコードに基づく機械学習モデルを統合した、合成可能性主導のCSPフレームワークを提案します。これにより、合成可能性の高い構造を生み出す可能性のある部分空間を効率的に特定できます。特定された有望な部分空間内では、最近合成された構造を用いて予測精度を高めるように微調整された構造ベースの合成可能性評価モデルが、第一原理計算と組み合わせて使用され、合成可能な候補を体系的に特定します。このフレームワークは、実験的に知られている13個のXSe（X = Sc, Ti, Mn, Fe, Ni, Cu, Zn）構造を再現し、合成可能な構造の予測における有効性を示しています。特に、GNoMEによって予測された554,054個の候補から92,310個の構造がフィルタリングされ、有望な合成可能性の大きな可能性を示しています。さらに、熱力学的に有利な8個のHf-X-O（X = Ti, V, Mn）構造が特定され、そのうち3個のHfV$_2$O$_7$候補は高い合成可能性を示し、実験的実現のための実行可能な候補となり、実験的に観察された温度誘起相転移に関連する可能性があります。本研究は、機械学習支援による無機材料合成のためのデータ駆動型パラダイムを確立し、計算予測と実験的実現の間のギャップを埋め、新規機能性材料の標的発見のための新たな機会を切り開く可能性を強調しています。"}
{"id": "2505.09174v1", "title": "Quotient Complex Transformer (QCformer) for Perovskite Data Analysis", "link": "http://arxiv.org/abs/2505.09174v1", "summary": "The discovery of novel functional materials is crucial in addressing the\nchallenges of sustainable energy generation and climate change. Hybrid\norganic-inorganic perovskites (HOIPs) have gained attention for their\nexceptional optoelectronic properties in photovoltaics. Recently, geometric\ndeep learning, particularly graph neural networks (GNNs), has shown strong\npotential in predicting material properties and guiding material design.\nHowever, traditional GNNs often struggle to capture the periodic structures and\nhigher-order interactions prevalent in such systems. To address these\nlimitations, we propose a novel representation based on quotient complexes\n(QCs) and introduce the Quotient Complex Transformer (QCformer) for material\nproperty prediction. A material structure is modeled as a quotient complex,\nwhich encodes both pairwise and many-body interactions via simplices of varying\ndimensions and captures material periodicity through a quotient operation. Our\nmodel leverages higher-order features defined on simplices and processes them\nusing a simplex-based Transformer module. We pretrain QCformer on benchmark\ndatasets such as the Materials Project and JARVIS, and fine-tune it on HOIP\ndatasets. The results show that QCformer outperforms state-of-the-art models in\nHOIP property prediction, demonstrating its effectiveness. The quotient complex\nrepresentation and QCformer model together contribute a powerful new tool for\npredictive modeling of perovskite materials.", "authors": ["Xinyu You", "Xiang Liu", "Chuan-Shen Hu", "Kelin Xia", "Tze Chien Sum"], "category": "cs.LG", "updated": "2025-05-14T06:13:14Z", "summary_ja": "新規な機能性材料の発見は、持続可能なエネルギー生成と気候変動の課題に対処する上で極めて重要です。ハイブリッド有機無機ペロブスカイト（HOIP）は、太陽光発電における優れた光電子特性により注目を集めています。近年、幾何学的深層学習、特にグラフニューラルネットワーク（GNN）は、材料特性の予測と材料設計の指針において強力な可能性を示しています。しかし、従来のGNNは、このようなシステムに遍在する周期構造や高次の相互作用を捉えるのに苦労することがよくあります。これらの制限に対処するため、我々は商複体（QC）に基づく新しい表現を提案し、材料特性予測のための商複体トランスフォーマー（QCformer）を導入します。材料構造は商複体としてモデル化され、これは様々な次元のシンプレックスを介してペアワイズおよび多体相互作用の両方をエンコードし、商演算を通じて材料の周期性を捉えます。我々のモデルは、シンプレックス上で定義された高次の特徴を活用し、シンプレックスベースのトランスフォーマーモジュールを使用してそれらを処理します。我々は、Materials ProjectやJARVISなどのベンチマークデータセットでQCformerを事前学習し、HOIPデータセットでファインチューンします。その結果、QCformerはHOIP特性予測において最先端のモデルを上回り、その有効性を示しています。商複体表現とQCformerモデルは、ペロブスカイト材料の予測モデリングのための強力な新しいツールを共に提供します。"}
{"id": "2505.09362v1", "title": "Optoelectronic properties and performance optimization for photovoltaic applications of R3m-RbGeX$_3$ (X = Cl, Br, I) perovskites: A combined DFT and SCAPS-1D study", "link": "http://arxiv.org/abs/2505.09362v1", "summary": "In pursuit of an all-inorganic non-toxic perovskite solar cell (PSC) with\nenhanced performance, we have investigated the rhombohedral phase of the\ngermanium-based rubidium halide perovskites RbGeX$_3$ (X = Cl, Br, I). The\nstructural analysis followed by an in-depth study of the electronic and optical\nproperties of these materials is performed within the framework of density\nfunctional theory (DFT). A detailed investigation of the electronic properties\nis carried out by examining the band structure and partial density of states\n(PDOS). PBE and TB-mBJ exchange-correlation functionals are used with and\nwithout the spin-orbit coupling (SOC), thereby obtaining accurate predictions\nof the band gaps. The key optical properties such as the real and imaginary\nparts of the dielectric function, absorption coefficient and refractive index\nare studied using PBE functional and compared among the three halides.\nRbGeI$_3$ exhibits the lowest band gap of 0.96 eV with the TB-mBJ + SOC\nfunctional, along with the most favorable optical properties, hence, it was\nidentified as the most suitable candidate for the absorber layer (AL) of the\nPSC. SCAPS-1D simulation is performed using various input parameters for the AL\nsuch as the band gap, the effective densities of states for the conduction and\nvalence bands and the electron and hole mobilities extracted from the DFT\ncalculation. Performance optimization is done by exploring the impact of\ndifferent inorganic hole transport layers (HTLs) and electron transport layers\n(ETLs). The impact of different layer thicknesses, doping densities, defect\ndensities at the AL, ETL/AL, and AL/HTL interfaces, various back contacts, and\nthe influence of series and shunt resistance on the overall device performance\nare studied. The optimized all-inorganic device demonstrated a remarkable power\nconversion efficiency (PCE) of $25.76\\%$ with a fill factor (FF) of $79.81\\%$.", "authors": ["Piyush Kumar Dash", "Palash Banarjee", "Anupriya Nyayban", "Subhasis Panda"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T13:12:03Z", "summary_ja": "高性能な完全無機非毒性ペロブスカイト太陽電池（PSC）を追求するため、ゲルマニウムベースのルビジウムハロゲン化物ペロブスカイトRbGeX$_3$（X = Cl, Br, I）の菱面体相を調査しました。これらの材料の構造解析に続き、密度汎関数理論（DFT）の枠組みの中で、電子および光学特性の詳細な研究を行いました。バンド構造と部分状態密度（PDOS）を調べることにより、電子特性の詳細な調査を実施しました。PBEおよびTB-mBJ交換相関汎関数を、スピン軌道結合（SOC）の有無にかかわらず使用し、バンドギャップの正確な予測を得ました。誘電関数の実部と虚部、吸収係数、屈折率などの主要な光学特性をPBE汎関数を用いて調べ、3つのハロゲン化物間で比較しました。RbGeI$_3$は、TB-mBJ + SOC汎関数で0.96 eVという最も低いバンドギャップを示し、最も好ましい光学特性を備えているため、PSCの吸収層（AL）として最も適切な候補として特定されました。SCAPS-1Dシミュレーションは、バンドギャップ、伝導帯および価電子帯の有効状態密度、DFT計算から抽出された電子および正孔移動度など、ALのさまざまな入力パラメータを使用して実行されます。性能最適化は、さまざまな無機正孔輸送層（HTL）および電子輸送層（ETL）の影響を調べることによって行われます。さまざまな層の厚さ、ドーピング密度、AL、ETL/AL、およびAL/HTL界面の欠陥密度、さまざまな背面電極の影響、および直列抵抗とシャント抵抗がデバイス全体の性能に与える影響を調査しました。最適化された完全無機デバイスは、79.81％のフィルファクター（FF）で25.76％という驚異的な電力変換効率（PCE）を示しました。"}
{"id": "2505.09401v1", "title": "A unified bonding entropy model to determine magnetic properties in graphene nanoflakes", "link": "http://arxiv.org/abs/2505.09401v1", "summary": "Graphene nanoflakes (GNFs) exhibit rich magnetic behaviors arising from two\nprimary mechanisms: geometry frustration in non-Kekul\\'e structures and\nelectron delocalization-driven aromatic stabilization in Kekul\\'e-type systems.\nHerein, we develop a unified bonding entropy model (BEM) to quantitatively\ncharacterize the magnetic properties in GNFs within a statistical framework,\nproviding an entropy-based criterion for understanding and predicting bond\noccupancy numbers and unpaired electron distributions. While non-Kekul\\'e\nsystems naturally favor high-spin configurations due to topological\nfrustration, the BEM reveals that even Kekul\\'e-type GNFs can exhibit magnetic\ncharacter when the entropy gain from unpaired electrons outweighs the loss of\naromatic stabilization. The model predictions show excellent agreement with\ndensity functional theory calculations in terms of spin density distributions\nand unpaired electron counts. Our results establish bonding entropy as a\ngeneral guiding principle for designing carbon-based magentic materials with\ntunable magnetic properties.", "authors": ["Chang-Chun He", "Jiarui Zeng", "Yu-Jun Zhao", "Xiao-Bao Yang"], "category": "cond-mat.mtrl-sci", "updated": "2025-05-14T13:59:00Z", "summary_ja": "グラフェンナノフレーク（GNF）は、主に2つのメカニズム、すなわち非ケクレ構造における幾何学的フラストレーションと、ケクレ型システムにおける電子非局在化駆動型芳香族安定化に起因する多様な磁気的挙動を示す。本研究では、統計的枠組みの中でGNFの磁気特性を定量的に特徴づけるための統一結合エントロピーモデル（BEM）を開発し、結合占有数と不対電子分布を理解し予測するためのエントロピーに基づく基準を提供する。非ケクレ系はトポロジカルなフラストレーションにより自然に高スピン配置を好むが、BEMは、不対電子からのエントロピー増加が芳香族安定化の損失を上回る場合、ケクレ型GNFでさえ磁気的特性を示す可能性があることを明らかにする。モデルの予測は、スピン密度分布と不対電子数に関して、密度汎関数理論計算と優れた一致を示す。我々の結果は、結合エントロピーを、調整可能な磁気特性を持つ炭素ベースの磁性材料を設計するための一般的な指針として確立する。"}
{"id": "2505.09606v1", "title": "Comparative Analysis of GFN Methods in Geometry Optimization of Small Organic Semiconductor Molecules: A DFT Benchmarking Study", "link": "http://arxiv.org/abs/2505.09606v1", "summary": "This study benchmarks the geometric, frequency, non-covalent (GFN)\nsemi-empirical methods, GFN1-xTB, GFN2-xTB, GFN0-xTB, and GFN-FF, against\ndensity functional theory (DFT) for the geometry optimization of small organic\nsemiconductor molecules. Two datasets are evaluated: a QM9-derived subset of\nsmall organic molecules and the Harvard Clean Energy Project (CEP) database of\nextended $\\pi$-systems relevant to organic photovoltaics. Structural agreement\nis quantified using heavy-atom RMSD, equilibrium rotational constants, bond\nlengths, angles, and HOMO-LUMO energy gaps. Computational efficiency is\nassessed via CPU time and scaling behavior. GFN1-xTB and GFN2-xTB demonstrate\nthe highest structural fidelity, while GFN-FF offers an optimal balance between\naccuracy and speed, particularly for larger systems. The results indicate that\nGFN-based methods are suitable for high-throughput molecular screening of small\norganic semiconductors, the choice of the method depending on the accuracy-cost\ntrade-offs. The findings support the deployment of GFN approaches in\ncomputational pipelines for the discovery of organic electronics and materials,\nproviding information on their strengths and limitations relative to\nestablished DFT methods.", "authors": ["Steve Cabrel Teguia Kouam", "Jean-Pierre Tchapet Njafa", "Raoult Dabou Teukam", "Patrick Mvoto Kongo", "Jean-Pierre Nguenang", "Serge Guy Nana Engo"], "category": "physics.chem-ph", "updated": "2025-05-14T17:57:21Z", "summary_ja": "本研究では、小有機半導体分子の構造最適化において、幾何構造、振動数、非共有結合（GFN）半経験的手法であるGFN1-xTB、GFN2-xTB、GFN0-xTB、GFN-FFを密度汎関数理論（DFT）と比較評価する。評価には、小有機分子のQM9由来のサブセットと、有機太陽電池に関連する拡張π系からなるハーバードクリーンエネルギープロジェクト（CEP）データベースの2つのデータセットを用いる。構造の一致度は、重原子RMSD、平衡回転定数、結合長、角度、HOMO-LUMOエネルギーギャップを用いて定量化する。計算効率は、CPU時間とスケーリング挙動によって評価する。GFN1-xTBとGFN2-xTBは最も高い構造忠実度を示し、GFN-FFは特に大規模な系において、精度と速度の最適なバランスを提供する。結果は、GFNベースの手法が小有機半導体のハイスループット分子スクリーニングに適しており、手法の選択は精度とコストのトレードオフに依存することを示唆している。本研究の知見は、有機エレクトロニクスおよび材料の発見のための計算パイプラインにおけるGFNアプローチの展開を支持し、確立されたDFT手法と比較して、その長所と短所に関する情報を提供する。"}
{"id": "2505.09203v1", "title": "InvDesFlow-AL: Active Learning-based Workflow for Inverse Design of Functional Materials", "link": "http://arxiv.org/abs/2505.09203v1", "summary": "Developing inverse design methods for functional materials with specific\nproperties is critical to advancing fields like renewable energy, catalysis,\nenergy storage, and carbon capture. Generative models based on diffusion\nprinciples can directly produce new materials that meet performance\nconstraints, thereby significantly accelerating the material design process.\nHowever, existing methods for generating and predicting crystal structures\noften remain limited by low success rates. In this work, we propose a novel\ninverse material design generative framework called InvDesFlow-AL, which is\nbased on active learning strategies. This framework can iteratively optimize\nthe material generation process to gradually guide it towards desired\nperformance characteristics. In terms of crystal structure prediction, the\nInvDesFlow-AL model achieves an RMSE of 0.0423 {\\AA}, representing an 32.96%\nimprovement in performance compared to exsisting generative models.\nAdditionally, InvDesFlow-AL has been successfully validated in the design of\nlow-formation-energy and low-Ehull materials. It can systematically generate\nmaterials with progressively lower formation energies while continuously\nexpanding the exploration across diverse chemical spaces. These results fully\ndemonstrate the effectiveness of the proposed active learning-driven generative\nmodel in accelerating material discovery and inverse design. To further prove\nthe effectiveness of this method, we took the search for BCS superconductors\nunder ambient pressure as an example explored by InvDesFlow-AL. As a result, we\nsuccessfully identified Li\\(_2\\)AuH\\(_6\\) as a conventional BCS superconductor\nwith an ultra-high transition temperature of 140 K. This discovery provides\nstrong empirical support for the application of inverse design in materials\nscience.", "authors": ["Xiao-Qi Han", "Peng-Jie Guo", "Ze-Feng Gao", "Hao Sun", "Zhong-Yi Lu"], "category": "cs.LG", "updated": "2025-05-14T07:29:06Z", "summary_ja": "特定の特性を持つ機能性材料のための逆設計手法の開発は、再生可能エネルギー、触媒、エネルギー貯蔵、炭素回収などの分野を前進させるために不可欠です。拡散原理に基づく生成モデルは、性能制約を満たす新しい材料を直接生成できるため、材料設計プロセスを大幅に加速できます。しかし、既存の結晶構造の生成および予測方法は、成功率が低いという制限が残ることがよくあります。本研究では、アクティブラーニング戦略に基づいた、InvDesFlow-ALと呼ばれる新しい逆材料設計生成フレームワークを提案します。このフレームワークは、材料生成プロセスを反復的に最適化し、望ましい性能特性に向けて徐々に誘導することができます。結晶構造予測の観点から、InvDesFlow-ALモデルは0.0423 {\\AA}のRMSEを達成し、既存の生成モデルと比較して32.96%の性能向上を示しています。さらに、InvDesFlow-ALは、低生成エネルギーおよび低Ehull材料の設計において、その有効性が検証されています。多様な化学空間にわたる探索を継続的に拡大しながら、より低い生成エネルギーを持つ材料を体系的に生成できます。これらの結果は、材料の発見と逆設計を加速する上で、提案されたアクティブラーニング駆動型生成モデルの有効性を完全に実証しています。この手法の有効性をさらに証明するために、InvDesFlow-ALによって探索された常圧下でのBCS超伝導体の探索を例にとりました。その結果、Li\\(_2\\)AuH\\(_6\\)を140 Kという超高転移温度を持つ従来のBCS超伝導体として特定することに成功しました。この発見は、材料科学における逆設計の応用に対する強力な経験的裏付けとなります。"}
{"id": "2505.09442v1", "title": "Probing the Temporal Response of Liquid Water to a THz Pump Pulse Using Machine Learning-Accelerated Non-Equilibrium Molecular Dynamics", "link": "http://arxiv.org/abs/2505.09442v1", "summary": "Ultrafast, time-resolved spectroscopies enable the direct observation of\nnon-equilibrium processes in condensed-phase systems and have revealed key\ninsights into energy transport, hydrogen-bond dynamics, and vibrational\ncoupling. While ab initio molecular dynamics (AIMD) provides accurate,\natomistic resolution of such dynamics, it becomes prohibitively expensive for\nnon-equilibrium processes that require many independent trajectories to capture\nthe stochastic nature of excitation and relaxation. To address this, we\nimplemented a machine learning potential that incorporates time-dependent\nelectric fields in a perturbative fashion, retaining AIMD-level accuracy. Using\nthis approach, we simulate the time-dependent response of liquid water to a\n12.3 THz Gaussian pump pulse (1.3 ps width), generating 32 ns of total\ntrajectory data. With access to ab initio-quality electronic structure, we\ncompute absorption coefficients and frequency-dependent refractive indices\nbefore, during, and after the pulse. The simulations reproduce key experimental\nobservables, including transient birefringence and relaxation times. We observe\nenergy transfer from the excited librational modes into translational and\nintramolecular vibrations, accompanied by a transient, nonlinear response of\nthe hydrogen-bond network and a characteristic 0.7 ps timescale associated with\nlibrational energy dissipation. These findings demonstrate the method's ability\nto capture essential non-equilibrium dynamics with theoretical time-dependent\nIR spectroscopy and establish a broadly applicable framework for studying\nfield-driven processes in complex molecular systems.", "authors": ["Kit Joll", "Philipp Schienbein"], "category": "physics.chem-ph", "updated": "2025-05-14T14:50:36Z", "summary_ja": "超高速時間分解分光法は、凝縮系における非平衡過程の直接的な観測を可能にし、エネルギー輸送、水素結合ダイナミクス、および振動結合に関する重要な洞察を明らかにしてきた。第一原理分子動力学（AIMD）は、そのようなダイナミクスを正確かつ原子レベルで解明するが、励起と緩和の確率的性質を捉えるために多数の独立な軌跡を必要とする非平衡過程では、計算コストが法外に高くなる。この問題に対処するため、時間依存電場を摂動的に組み込み、AIMDレベルの精度を維持する機械学習ポテンシャルを実装した。このアプローチを用いて、液体水の12.3 THzガウス型ポンプパルス（1.3 ps幅）に対する時間依存応答をシミュレートし、合計32 nsの軌跡データを生成した。第一原理品質の電子構造にアクセスできるため、パルスの前後およびパルス中に、吸収係数と周波数依存屈折率を計算した。シミュレーションは、過渡複屈折や緩和時間など、主要な実験的観測量を再現する。励起されたライブレーションモードから並進および分子内振動へのエネルギー移動を観察し、それに伴い、水素結合ネットワークの過渡的な非線形応答と、ライブレーションエネルギー散逸に関連する特徴的な0.7 psの時間スケールを観察した。これらの発見は、この手法が理論的な時間依存IR分光法を用いて本質的な非平衡ダイナミクスを捉える能力を示し、複雑な分子系における電場駆動過程を研究するための広範な応用可能なフレームワークを確立する。"}
{"id": "2505.09262v1", "title": "EDBench: Large-Scale Electron Density Data for Molecular Modeling", "link": "http://arxiv.org/abs/2505.09262v1", "summary": "Existing molecular machine learning force fields (MLFFs) generally focus on\nthe learning of atoms, molecules, and simple quantum chemical properties (such\nas energy and force), but ignore the importance of electron density (ED)\n$\\rho(r)$ in accurately understanding molecular force fields (MFFs). ED\ndescribes the probability of finding electrons at specific locations around\natoms or molecules, which uniquely determines all ground state properties (such\nas energy, molecular structure, etc.) of interactive multi-particle systems\naccording to the Hohenberg-Kohn theorem. However, the calculation of ED relies\non the time-consuming first-principles density functional theory (DFT) which\nleads to the lack of large-scale ED data and limits its application in MLFFs.\nIn this paper, we introduce EDBench, a large-scale, high-quality dataset of ED\ndesigned to advance learning-based research at the electronic scale. Built upon\nthe PCQM4Mv2, EDBench provides accurate ED data, covering 3.3 million\nmolecules. To comprehensively evaluate the ability of models to understand and\nutilize electronic information, we design a suite of ED-centric benchmark tasks\nspanning prediction, retrieval, and generation. Our evaluation on several\nstate-of-the-art methods demonstrates that learning from EDBench is not only\nfeasible but also achieves high accuracy. Moreover, we show that learning-based\nmethod can efficiently calculate ED with comparable precision while\nsignificantly reducing the computational cost relative to traditional DFT\ncalculations. All data and benchmarks from EDBench will be freely available,\nlaying a robust foundation for ED-driven drug discovery and materials science.", "authors": ["Hongxin Xiang", "Ke Li", "Mingquan Liu", "Zhixiang Cheng", "Bin Yao", "Wenjie Du", "Jun Xia", "Li Zeng", "Xin Jin", "Xiangxiang Zeng"], "category": "cs.LG", "updated": "2025-05-14T10:23:22Z", "summary_ja": "既存の分子機械学習力場（MLFF）は一般的に、原子、分子、および単純な量子化学的特性（エネルギーや力など）の学習に焦点を当てており、分子力場（MFF）を正確に理解する上で重要な電子密度（ED）$\\rho(r)$の重要性を無視しています。EDは、原子または分子の周囲の特定の場所に電子を見つける確率を表し、ホーエンベルグ-コーンの定理によれば、相互作用する多粒子系のすべての基底状態特性（エネルギー、分子構造など）を一意に決定します。しかし、EDの計算は時間のかかる第一原理密度汎関数理論（DFT）に依存しており、大規模なEDデータの不足につながり、MLFFでの応用を制限しています。本論文では、電子スケールでの学習ベースの研究を推進するために設計された、大規模で高品質なEDデータセットであるEDBenchを紹介します。PCQM4Mv2を基盤として構築されたEDBenchは、330万個の分子を網羅する正確なEDデータを提供します。モデルが電子情報を理解し活用する能力を包括的に評価するために、予測、検索、生成に及ぶED中心のベンチマークタスクスイートを設計しました。いくつかの最先端の手法に対する評価により、EDBenchからの学習は実行可能であるだけでなく、高い精度を達成することも示されています。さらに、学習ベースの手法は、従来のDFT計算と比較して計算コストを大幅に削減しながら、同等の精度でEDを効率的に計算できることを示しています。EDBenchからのすべてのデータとベンチマークは自由に利用可能になり、ED駆動の創薬と材料科学のための強固な基盤を築きます。"}
{"id": "2505.09543v1", "title": "Learned Free-Energy Functionals from Pair-Correlation Matching for Dynamical Density Functional Theory", "link": "http://arxiv.org/abs/2505.09543v1", "summary": "Classical density functional theory (cDFT) and dynamical density functional\ntheory (DDFT) are modern statistical mechanical theories for modelling\nmany-body colloidal systems at the one-body density level. The theories hinge\non knowing the excess free-energy accurately, which is however not feasible for\nmost practical applications. Dijkman et al. [Phys. Rev. Lett. 134, 056103\n(2025)] recently showed how a neural excess free-energy functional for cDFT can\nbe learned from inexpensive bulk simulations via pair-correlation matching. In\nthis Letter, we demonstrate how this same functional can be applied to DDFT,\nwithout any retraining, to simulate non-equilibrium overdamped dynamics of\ninhomogeneous densities. We evaluate this on a 3D Lennard-Jones system with\nplanar geometry under various complex external potentials and observe good\nagreement of the dynamical densities with those from expensive Brownian dynamic\nsimulations, up to the limit of the adiabatic approximation. We further develop\nand apply an extension of DDFT to a grand-canonical system modeled after\nbreakthrough gas adsorption studies, finding similarly good agreement. Our\nresults demonstrate a practical route for leveraging learned free-energy\nfunctionals in DDFT, paving the way for accurate and efficient modeling of\nnon-equilibrium systems.", "authors": ["Karnik Ram", "Jacobus Dijkman", "René van Roij", "Jan-Willem Van de Meent", "Bernd Ensing", "Max Welling", "Daniel Cremers"], "category": "physics.chem-ph", "updated": "2025-05-14T16:42:36Z", "summary_ja": "古典密度汎関数理論（cDFT）と動的密度汎関数理論（DDFT）は、多体コロイド系を一体密度レベルでモデル化するための現代的な統計力学理論です。これらの理論は、過剰自由エネルギーを正確に知ることに依存していますが、ほとんどの実用的な応用では実現不可能です。Dijkmanら[Phys. Rev. Lett. 134, 056103 (2025)]は最近、cDFTのためのニューラル過剰自由エネルギー汎関数を、ペア相関マッチングを通じて安価なバルクシミュレーションから学習する方法を示しました。本論文では、この同じ汎関数をDDFTに適用して、再トレーニングなしに、不均一な密度の非平衡過減衰ダイナミクスをシミュレートできることを実証します。様々な複雑な外部ポテンシャルの下で平面形状を持つ3Dレナード-ジョーンズ系でこれを評価し、断熱近似の限界まで、高価なブラウン運動シミュレーションからの動的密度と良好な一致を観察します。さらに、DDFTの拡張を開発し、ブレークスルーガス吸着研究をモデルにしたグランドカノニカル系に適用し、同様に良好な一致を見出しました。我々の結果は、DDFTにおける学習された自由エネルギー汎関数を活用するための実用的な経路を示し、非平衡系の正確かつ効率的なモデリングへの道を開きます。"}
{"id": "2505.09062v1", "title": "Variational Prefix Tuning for Diverse and Accurate Code Summarization Using Pre-trained Language Models", "link": "http://arxiv.org/abs/2505.09062v1", "summary": "Recent advancements in source code summarization have leveraged\ntransformer-based pre-trained models, including Large Language Models of Code\n(LLMCs), to automate and improve the generation of code summaries. However,\nexisting methods often focus on generating a single high-quality summary for a\ngiven source code, neglecting scenarios where the generated summary might be\ninadequate and alternative options are needed. In this paper, we introduce\nVariational Prefix Tuning (VPT), a novel approach that enhances pre-trained\nmodels' ability to generate diverse yet accurate sets of summaries, allowing\nthe user to choose the most suitable one for the given source code. Our method\nintegrates a Conditional Variational Autoencoder (CVAE) framework as a modular\ncomponent into pre-trained models, enabling us to model the distribution of\nobserved target summaries and sample continuous embeddings to be used as\nprefixes to steer the generation of diverse outputs during decoding.\nImportantly, we construct our method in a parameter-efficient manner,\neliminating the need for expensive model retraining, especially when using\nLLMCs. Furthermore, we employ a bi-criteria reranking method to select a subset\nof generated summaries, optimizing both the diversity and the accuracy of the\noptions presented to users. We present extensive experimental evaluations using\nwidely used datasets and current state-of-the-art pre-trained code\nsummarization models to demonstrate the effectiveness of our approach and its\nadaptability across models.", "authors": ["Junda Zhao", "Yuliang Song", "Eldan Cohen"], "category": "cs.LG", "updated": "2025-05-14T01:46:56Z", "summary_ja": "近年のソースコード要約の進歩は、コードの大規模言語モデル（LLMC）を含む、Transformerベースの事前学習済みモデルを活用して、コード要約の生成を自動化し、改善しています。しかし、既存の手法は、与えられたソースコードに対して単一の高品質な要約を生成することに焦点を当てがちであり、生成された要約が不適切で代替案が必要となるシナリオを無視しています。本論文では、Variational Prefix Tuning（VPT）という新しいアプローチを紹介します。これは、事前学習済みモデルが多様でありながら正確な要約セットを生成する能力を向上させ、ユーザーが与えられたソースコードに最適なものを選択できるようにするものです。私たちの手法は、条件付き変分オートエンコーダ（CVAE）フレームワークをモジュールコンポーネントとして事前学習済みモデルに統合し、観測されたターゲット要約の分布をモデル化し、連続的な埋め込みをサンプリングして、デコード中に多様な出力を生成するためのプレフィックスとして使用できるようにします。重要なことに、私たちはパラメータ効率の良い方法でこの手法を構築しており、特にLLMCを使用する場合に、高価なモデルの再トレーニングの必要性を排除しています。さらに、生成された要約のサブセットを選択するために、二基準のリランキング手法を採用し、ユーザーに提示されるオプションの多様性と正確性の両方を最適化します。広く使用されているデータセットと、現在の最先端の事前学習済みコード要約モデルを使用した広範な実験的評価を行い、私たちのアプローチの有効性とモデル間の適応性を示します。"}
{"id": "2505.09246v1", "title": "Focus, Merge, Rank: Improved Question Answering Based on Semi-structured Knowledge Bases", "link": "http://arxiv.org/abs/2505.09246v1", "summary": "In many real-world settings, machine learning models and interactive systems\nhave access to both structured knowledge, e.g., knowledge graphs or tables, and\nunstructured content, e.g., natural language documents. However, most rely on\neither. Semi-Structured Knowledge Bases (SKBs) bridge this gap by linking\nunstructured content to nodes within structured data, thereby enabling new\nstrategies for knowledge access and use. In this work, we present\nFocusedRetriever, a modular SKB-based framework for multi-hop question\nanswering. It integrates components (VSS-based entity search, LLM-based\ngeneration of Cypher queries and pairwise re-ranking) in a way that enables it\nto outperform state-of-the-art methods across all three STaRK benchmark test\nsets, covering diverse domains and multiple performance metrics. The average\nfirst-hit rate exceeds that of the second-best method by 25.7%.\nFocusedRetriever leverages (1) the capacity of Large Language Models (LLMs) to\nextract relational facts and entity attributes from unstructured text, (2) node\nset joins to filter answer candidates based on these extracted triplets and\nconstraints, (3) vector similarity search to retrieve and rank relevant\nunstructured content, and (4) the contextual capabilities of LLMs to finally\nrank the top-k answers. For generality, we only incorporate base LLMs in\nFocusedRetriever in our evaluation. However, our analysis of intermediate\nresults highlights several opportunities for further upgrades including\nfinetuning. The source code is publicly available at\nhttps://github.com/kramerlab/FocusedRetriever .", "authors": ["Derian Boer", "Stephen Roth", "Stefan Kramer"], "category": "cs.CL", "updated": "2025-05-14T09:35:56Z", "summary_ja": "多くの現実世界の設定において、機械学習モデルやインタラクティブシステムは、知識グラフやテーブルなどの構造化された知識と、自然言語ドキュメントなどの非構造化コンテンツの両方にアクセスできます。しかし、ほとんどのものはどちらか一方に依存しています。半構造化知識ベース（SKB）は、非構造化コンテンツを構造化データ内のノードにリンクすることで、このギャップを埋め、知識へのアクセスと利用のための新しい戦略を可能にします。本研究では、マルチホップ質問応答のためのモジュール式SKBベースのフレームワークであるFocusedRetrieverを紹介します。これは、多様なドメインと複数のパフォーマンス指標をカバーする3つのSTaRKベンチマークテストセットすべてにおいて、最先端の手法を上回るように、コンポーネント（VSSベースのエンティティ検索、LLMベースのCypherクエリ生成、ペアワイズ再ランキング）を統合しています。平均的な初回ヒット率は、2番目に優れた手法を25.7%上回っています。\n\nFocusedRetrieverは、(1)非構造化テキストから関係的事実とエンティティ属性を抽出する大規模言語モデル（LLM）の能力、(2)これらの抽出されたトリプレットと制約に基づいて回答候補をフィルタリングするためのノードセット結合、(3)関連する非構造化コンテンツを検索およびランク付けするためのベクトル類似性検索、(4)最終的に上位k個の回答をランク付けするためのLLMの文脈的機能を利用しています。汎用性を考慮して、評価ではベースLLMのみをFocusedRetrieverに組み込んでいます。ただし、中間結果の分析により、ファインチューニングを含むさらなるアップグレードの機会がいくつか明らかになっています。ソースコードは、https://github.com/kramerlab/FocusedRetriever で公開されています。"}
{"id": "2505.09134v1", "title": "Scaling Gaussian Process Regression with Full Derivative Observations", "link": "http://arxiv.org/abs/2505.09134v1", "summary": "We present a scalable Gaussian Process (GP) method that can fit and predict\nfull derivative observations called DSoftKI. It extends SoftKI, a method that\napproximates a kernel via softmax interpolation from learned interpolation\npoint locations, to the setting with derivatives. DSoftKI enhances SoftKI's\ninterpolation scheme to incorporate the directional orientation of\ninterpolation points relative to the data. This enables the construction of a\nscalable approximate kernel, including its first and second-order derivatives,\nthrough interpolation. We evaluate DSoftKI on a synthetic function benchmark\nand high-dimensional molecular force field prediction (100-1000 dimensions),\ndemonstrating that DSoftKI is accurate and can scale to larger datasets with\nfull derivative observations than previously possible.", "authors": ["Daniel Huang"], "category": "cs.LG", "updated": "2025-05-14T04:35:26Z", "summary_ja": "我々は、DSoftKIと呼ばれる、完全な導関数観測に適合し予測できるスケーラブルなガウス過程（GP）法を提案します。これは、学習された補間点の位置からのソフトマックス補間によってカーネルを近似する手法であるSoftKIを、導関数を持つ設定に拡張したものです。DSoftKIは、SoftKIの補間スキームを強化し、データに対する補間点の方向性を取り込みます。これにより、補間を通じて、その一次および二次導関数を含む、スケーラブルな近似カーネルを構築できます。我々は、合成関数ベンチマークと高次元分子力場予測（100〜1000次元）においてDSoftKIを評価し、DSoftKIが正確であり、これまで以上に大きな完全な導関数観測データセットにスケールできることを示しています。"}
{"id": "2505.09284v1", "title": "Generating Full-field Evolution of Physical Dynamics from Irregular Sparse Observations", "link": "http://arxiv.org/abs/2505.09284v1", "summary": "Modeling and reconstructing multidimensional physical dynamics from sparse\nand off-grid observations presents a fundamental challenge in scientific\nresearch. Recently, diffusion-based generative modeling shows promising\npotential for physical simulation. However, current approaches typically\noperate on on-grid data with preset spatiotemporal resolution, but struggle\nwith the sparsely observed and continuous nature of real-world physical\ndynamics. To fill the gaps, we present SDIFT, Sequential DIffusion in\nFunctional Tucker space, a novel framework that generates full-field evolution\nof physical dynamics from irregular sparse observations. SDIFT leverages the\nfunctional Tucker model as the latent space representer with proven universal\napproximation property, and represents observations as latent functions and\nTucker core sequences. We then construct a sequential diffusion model with\ntemporally augmented UNet in the functional Tucker space, denoising noise drawn\nfrom a Gaussian process to generate the sequence of core tensors.\n  At the posterior sampling stage, we propose a Message-Passing Posterior\nSampling mechanism, enabling conditional generation of the entire sequence\nguided by observations at limited time steps. We validate SDIFT on three\nphysical systems spanning astronomical (supernova explosions, light-year\nscale), environmental (ocean sound speed fields, kilometer scale), and\nmolecular (organic liquid, millimeter scale) domains, demonstrating significant\nimprovements in both reconstruction accuracy and computational efficiency\ncompared to state-of-the-art approaches.", "authors": ["Panqi Chen", "Yifan Sun", "Lei Cheng", "Yang Yang", "Weichang Li", "Yang Liu", "Weiqing Liu", "Jiang Bian", "Shikai Fang"], "category": "cs.LG", "updated": "2025-05-14T11:09:15Z", "summary_ja": "疎でオフグリッドな観測から多次元物理ダイナミクスをモデル化し再構築することは、科学研究における根本的な課題です。近年、拡散ベースの生成モデリングは物理シミュレーションにおいて有望な可能性を示しています。しかし、現在のアプローチは通常、事前に設定された時空間解像度を持つオングリッドデータで動作しますが、現実世界の物理ダイナミクスの疎な観測と連続的な性質には苦戦しています。このギャップを埋めるために、我々はSDIFT（Sequential DIffusion in Functional Tucker space、関数型タッカー空間における逐次拡散）を提案します。これは、不規則な疎な観測から物理ダイナミクスの全フィールド進化を生成する新しいフレームワークです。SDIFTは、普遍近似特性が証明されている関数型タッカーモデルを潜在空間表現として活用し、観測を潜在関数とタッカーコアシーケンスとして表現します。次に、関数型タッカー空間に時間的に拡張されたUNetを持つ逐次拡散モデルを構築し、ガウス過程から抽出されたノイズを除去してコアテンソルのシーケンスを生成します。\n\n事後サンプリング段階では、メッセージパッシング事後サンプリングメカニズムを提案し、限られたタイムステップでの観測によって誘導されるシーケンス全体の条件付き生成を可能にします。我々は、天文学的（超新星爆発、光年スケール）、環境的（海洋音速場、キロメートルスケール）、分子（有機液体、ミリメートルスケール）のドメインにまたがる3つの物理システムでSDIFTを検証し、最先端のアプローチと比較して、再構築精度と計算効率の両方において大幅な改善を示しています。"}
{"id": "2505.09063v1", "title": "Single-shot prediction of parametric partial differential equations", "link": "http://arxiv.org/abs/2505.09063v1", "summary": "We introduce Flexi-VAE, a data-driven framework for efficient single-shot\nforecasting of nonlinear parametric partial differential equations (PDEs),\neliminating the need for iterative time-stepping while maintaining high\naccuracy and stability. Flexi-VAE incorporates a neural propagator that\nadvances latent representations forward in time, aligning latent evolution with\nphysical state reconstruction in a variational autoencoder setting. We evaluate\ntwo propagation strategies, the Direct Concatenation Propagator (DCP) and the\nPositional Encoding Propagator (PEP), and demonstrate, through\nrepresentation-theoretic analysis, that DCP offers superior long-term\ngeneralization by fostering disentangled and physically meaningful latent\nspaces. Geometric diagnostics, including Jacobian spectral analysis, reveal\nthat propagated latent states reside in regions of lower decoder sensitivity\nand more stable local geometry than those derived via direct encoding,\nenhancing robustness for long-horizon predictions. We validate Flexi-VAE on\ncanonical PDE benchmarks, the 1D viscous Burgers equation and the 2D\nadvection-diffusion equation, achieving accurate forecasts across wide\nparametric ranges. The model delivers over 50x CPU and 90x GPU speedups\ncompared to autoencoder-LSTM baselines for large temporal shifts. These results\nposition Flexi-VAE as a scalable and interpretable surrogate modeling tool for\naccelerating high-fidelity simulations in computational fluid dynamics (CFD)\nand other parametric PDE-driven applications, with extensibility to\nhigher-dimensional and more complex systems.", "authors": ["Khalid Rafiq", "Wenjing Liao", "Aditya G. Nair"], "category": "cs.LG", "updated": "2025-05-14T01:48:26Z", "summary_ja": "Flexi-VAEは、非線形パラメトリック偏微分方程式（PDE）の効率的なシングルショット予測のためのデータ駆動型フレームワークであり、高い精度と安定性を維持しながら、反復的な時間ステップ処理の必要性を排除します。Flexi-VAEは、潜在表現を時間的に前進させるニューラルプロパゲーターを組み込み、変分オートエンコーダー設定で潜在的な進化を物理的な状態再構築と整合させます。2つの伝播戦略、Direct Concatenation Propagator（DCP）とPositional Encoding Propagator（PEP）を評価し、表現論的分析を通じて、DCPが、解きほぐされた物理的に意味のある潜在空間を育成することにより、優れた長期汎化を提供することを示します。ヤコビアンスペクトル分析を含む幾何学的診断により、伝播された潜在状態は、直接エンコードによって導出されたものよりも、デコーダー感度が低く、より安定した局所幾何学の領域に存在し、長期予測のロバスト性を高めることが明らかになりました。Flexi-VAEを、1次元粘性バーガース方程式と2次元移流拡散方程式という標準的なPDEベンチマークで検証し、幅広いパラメトリック範囲で正確な予測を達成しました。このモデルは、大きな時間シフトに対して、オートエンコーダー-LSTMベースラインと比較して、50倍以上のCPU高速化と90倍以上のGPU高速化を実現します。これらの結果は、Flexi-VAEを、計算流体力学（CFD）やその他のパラメトリックPDE駆動型アプリケーションにおける高忠実度シミュレーションを加速するための、スケーラブルで解釈可能な代替モデリングツールとして位置づけ、高次元でより複雑なシステムへの拡張性を示しています。"}
{"id": "2505.09316v1", "title": "Scent of Knowledge: Optimizing Search-Enhanced Reasoning with Information Foraging", "link": "http://arxiv.org/abs/2505.09316v1", "summary": "Augmenting large language models (LLMs) with external retrieval has become a\nstandard method to address their inherent knowledge cutoff limitations.\nHowever, traditional retrieval-augmented generation methods employ static,\npre-inference retrieval strategies, making them inadequate for complex tasks\ninvolving ambiguous, multi-step, or evolving information needs. Recent advances\nin test-time scaling techniques have demonstrated significant potential in\nenabling LLMs to dynamically interact with external tools, motivating the shift\ntoward adaptive inference-time retrieval. Inspired by Information Foraging\nTheory (IFT), we propose InForage, a reinforcement learning framework that\nformalizes retrieval-augmented reasoning as a dynamic information-seeking\nprocess. Unlike existing approaches, InForage explicitly rewards intermediate\nretrieval quality, encouraging LLMs to iteratively gather and integrate\ninformation through adaptive search behaviors. To facilitate training, we\nconstruct a human-guided dataset capturing iterative search and reasoning\ntrajectories for complex, real-world web tasks. Extensive evaluations across\ngeneral question answering, multi-hop reasoning tasks, and a newly developed\nreal-time web QA dataset demonstrate InForage's superior performance over\nbaseline methods. These results highlight InForage's effectiveness in building\nrobust, adaptive, and efficient reasoning agents.", "authors": ["Hongjin Qian", "Zheng Liu"], "category": "cs.CL", "updated": "2025-05-14T12:13:38Z", "summary_ja": "大規模言語モデル（LLM）を外部検索で拡張することは、その固有の知識の限界に対処するための標準的な方法となっています。しかし、従来の検索拡張生成手法は、静的な推論前検索戦略を採用しており、曖昧、多段階、または進化する情報ニーズを伴う複雑なタスクには不十分です。テスト時のスケーリング技術における最近の進歩は、LLMが外部ツールと動的に対話することを可能にする上で大きな可能性を示しており、適応的な推論時検索への移行を促しています。情報探索理論（IFT）に触発され、我々はInForageという、検索拡張推論を動的な情報探索プロセスとして形式化する強化学習フレームワークを提案します。既存のアプローチとは異なり、InForageは中間的な検索品質を明示的に評価し、LLMが適応的な検索行動を通じて反復的に情報を収集し統合することを奨励します。トレーニングを容易にするために、複雑な現実世界のウェブタスクにおける反復的な検索と推論の軌跡を捉えた、人間がガイドするデータセットを構築します。一般的な質問応答、マルチホップ推論タスク、および新たに開発されたリアルタイムウェブQAデータセットにわたる広範な評価により、InForageがベースラインメソッドよりも優れたパフォーマンスを発揮することが示されています。これらの結果は、InForageが堅牢で適応的かつ効率的な推論エージェントを構築する上で効果的であることを強調しています。"}
